[
  {
    "manufacturer": "ibc-solar",
    "product": "IBC AeroFix",
    "candidates": [
      {
        "url": "https://hkraft.no/wp-content/uploads/2019/02/ibc-aerofix_691.2-dataark-for-montasjesystem-tak.pdf",
        "title": "[PDF] IBC AeroFix",
        "snippet": "The IBC AeroFix is an in-house development from IBC SOLAR, based on years of experience with ballasted flat roof mounting systems.",
        "score": 0.78154784,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.pv-magazine.com/wp-content/uploads/2021/08/pv-magazine-Spotlight_IBC-SOLAR-AeroFix_EN.pdf",
        "title": "[PDF] Maximum flexibility – The new AeroFix G3 for flat roofs. - PV Magazine",
        "snippet": "7 8 General requirements Roof pitch 0°-10° From 5% or 2,8° secure the system against thermal hiking Roof covering foil, bitumen, gravel, green roof Building height max. 35 m Higher buildings only with IBC SOLAR approval Minimum field size 2x3 or 3x2 modules Maximum field size 20x20 m Module size Length: 1500 – 2100 mm width: 980 – 1150 mm Only one tool plug nut SW10 Clamp for potential equalization TX40 G3 Module clamp TX40 Components Less is more. [...] Maximum flexibility – The new AeroFix G3 for flat roofs.\nW E B I N A R Johannes Cayé, Product Manager Mounting Structures at IBC SOLAR Dieter Miener, Teammanager Technical Application Engineer at IBC SOLAR Agenda pv magazine Spotlight 2 Wind tunnel test Systems General requirements Components Module support Cable laying www.ibc-solar.com/AeroFixG3 Wind tunnel test Perfect aerodynamics.\n3 4 Systems 6 setup variants. [...] J O H A N N E S C A Y É P r o d u c t M a n a g e r M o u n t i n g S t r u c t u r e s Tel: +49 9573 9224 - 884 Email: johannes.caye@ibc-solar.de @IBC-SOLAR-AG @IBCSOLAR @IBCSOLAR.DE D I E T E R M I E N E R T e c h n i c a l A p p l i c a t i o n E n g i n e e r Tel: +49 9573 9224 - 422 Email: dieter.miener@ibc-solar.de @IBC-SOLAR-International @IBCSOLAR_Int",
        "score": 0.74273956,
        "bucket": "datasheets"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_AeroFix-AeroFlat_EN_V_19_01.pdf",
        "title": "[PDF] Installation instructions - IBC AeroFix / AeroFlat",
        "snippet": "The IBC AeroFix / AeroFlat flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or base",
        "score": 0.8399576,
        "bucket": "installation"
      },
      {
        "url": "https://cdn.exiteme.com/exitetogo/www.neosolar-ng.com/userfiles/files/2004200013_IBC%20MonoSol%20310%20VL4_installation%20manual_EN.pdf",
        "title": "[PDF] Installation guide",
        "snippet": "the valid IBC AeroFix installation manual. Module type Long side Short side AeroFix AeroFix+ IBC Snow Load Rail G2 AeroFix+ 3´rd IBC AeroFix mounting rail PolySol MS 1650x992x40 permitted (max 5400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) PolySol GX/GX4 1654x989x40 permitted (max 5400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) PolySol CS5 1956x992x40 permitted (max 5400Pa) permitted (max [...] responsibility for patent infringements or other infringements from third parties that may be caused through the use of the modules. \"Use\" does not include implicit or other licensing under any patent or Patent Act. The information in this manual is based on the knowledge and experience of IBC SOLAR AG and is considered to be reliable. However, information, product specifications (without restriction) and suggestions have neither the explicit or implicit nature of a guarantee. IBC SOLAR AG [...] reserves the right to make changes to products, specifications or this manual without prior notice. 20 IAEE-V170810 IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0) 9573-92 24 0 Fax +49 (0) 9573-92 24 111 info@ibc-solar.de www.ibc-solar.com",
        "score": 0.8066246,
        "bucket": "installation"
      },
      {
        "url": "https://www.e-nummersok.se/infoDocs/MAN/MAN_34887_5288922.pdf",
        "title": "[PDF] IBC AeroFix G3",
        "snippet": "The IBC AeroFix G3 flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or",
        "score": 0.7625837,
        "bucket": "installation"
      },
      {
        "url": "https://www.gelia.se/external-assets/Documents/36/95/AssetDocument60853695.pdf",
        "title": "[PDF] Installation guide - Gelia",
        "snippet": "1600 IBC MonoSol xxx OS9-HC 2094x1038x35 mm 2400 / 2400 1600 / 1600 1600 / 1600 1066 / 1066 18 IAEE-V220510 3.4.3 IBC AeroFix G3 and G2 mounting system 19 IAEE-V220510 Note: AeroFix system with clamping on the short side, C= starting directly at the outer edge of the module on the short frame side in the length of the clamp. Please refer for more information to the valid IBC AeroFix installation manual. Loads according to IEC 61215-2:2016 ; Design load = Test load / safety factor 1,5 Module [...] the installation instructions of the IBC mounting products. Please do not damage the modules whilst doing this and ensure a proper connection between clamp and module. ▪ Only use corrosion-free screws, nuts and washers during assembly. ▪ Sufficient lightning protection is recommended, particularly on exposed sites. Integration into any existing lightning protection must follow the relevant guidelines. ▪ Only mount solar modules upright with the socket facing upwards or transversely. ▪ On the [...] .......................................................................................... 14 3.4.2 Insertion systems for long and short side .................................................................................. 16 3.4.3 IBC AeroFix G3 and G2 mounting system ................................................................................ 18 4. Maintenance",
        "score": 0.75377536,
        "bucket": "installation"
      },
      {
        "url": "https://cdn.exiteme.com/exitetogo/www.neosolar-ng.com/userfiles/files/2004100044_IBC%20MonoSol%20305%20ZX5_installation%20manual_EN.pdf",
        "title": "[PDF] Das ist die neue Word-Vorlage",
        "snippet": "2400Pa) MonoSol VL5 1640x992x40 150 mm (max 5400Pa) 330 mm (max 5400Pa) 50 mm (max 2400Pa) 190 mm (max 2400Pa) 15 IAEE-V170810 Insertion systems and Aerofix Long side short side  Please refer to the valid IBC AeroFix installation manual. Module type Long side Short side AeroFix AeroFix+ IBC Snow Load Rail G2 AeroFix+ 3´rd IBC AeroFix mounting rail PolySol MS 1650x992x40 permitted (max 5400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) PolySol GX5 [...] must be disposed of correctly. They should not be disposed of with household waste but according to the valid disposal regulations for electronic scrap. 19 IAEE-V170810 8. Disclaimer IBC SOLAR AG does not control the use of this safety, installation and instruction manual or the conditions and procedures for installing, operating, using and maintaining the modules. Therefore, IBC SOLAR AG does not accept any responsibility for loss, damage, injury or costs that may occur during installation, [...] use assembly procedures that are not described in the diagrams please contact IBC SOLAR AG for approval. Otherwise your guarantee and module certification will become invalid.  Alongside the instructions in the installation manual, please always follow the installation instructions from the elevated installation manufacturer. In cases where the instructions from this manufacturer are stricter than the ones in this installation manual, they take priority.  If the maximum permitted load",
        "score": 0.735737,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_IBC_TopFix200_EN_V_19_01.pdf",
        "title": "[PDF] Installation manual - IBC SOLAR Fachpartnerportal",
        "snippet": "To simplify the installation and commissioning of your IBC TopFix 200 mounting system, we have included these detailed installation instructions. They are",
        "score": 0.6836946,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty_IBC_SOLAR_AeroFix_TopFix200.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "Version 17.01, last update: July 2017 1 IBC AeroFix / TopFix 200 IBC SOLAR AG, Am Hochgericht 10, 96231 Bad Staffelstein, Germany Tel. +49 (0)9573/ 92 24 0; Fax +49 (0)9573/ 92 24 111 hereinafter referred to as “IBC”, provides for each of the assembly systems IBC AeroFix and TopFix 200 the following worldwide product warranty (“Warranty”): Product warranty The legal rights of rectification, withdrawal, reduction or compensation in the event of defects in the assembly system IBC AeroFix or TopFix [...] Term of Warranty The term of warranty (”Warranty Period“) given to the Customer by IBC for the assembly systems IBC AeroFix or TopFix 200, as applicable, shall be 10 years and commences with the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts latest six (6) months after delivery by IBC to their buyer. Warranty conditions and warranty For the duration of the Warranty Period, IBC guarantees Customer that each of the assembly [...] systems IBC AeroFix or TopFix 200, as applicable, is free of material defects. However, for sealing and plastic materials, no warranty or whatsoever is provided by IBC. At this, the Warranty is only provided in the case of compliance with the following conditions: 01. The assembly systems IBC AeroFix or TopFix 200, as applicable, has been dimensioned, installed and maintained in a proper and professional manner according to the current version of the assembly instruction at the date of its",
        "score": 0.90452427,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/IBC_Systemwarranty_EN.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "page 1 of 5 TERMS AND CONDITION OF WARRANTY (Version 1.10 / Last Update: July 2025) System consisting of IBC AeroFix / IBC AeroFlat / IBC TopFix 200 / IBC WallFix mounting systems and IBC Module / IBC MonoSol solar modules. Guarantor: IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0)9573/ 92 24 0 Fax +49 (0)9573/ 92 24 111 hereinafter referred to as „IBC“. A. General warranty conditions Beneficiary IBC provides the end customer (hereinafter „Customer“) a non-transferable [...] by this warranty. Applicable law This warranty is subject to the law of the Federal Republic of Germany. The courts of Coburg, Germany shall be the place of jurisdiction for all disputes arising from or in connection with this warranty. B. Specific warranty conditions for the mounting system used in the system Product Warranty For the duration of the Warranty Period, IBC guarantees Customer in the system that each of the assembly systems in IBC AeroFix, IBC AeroFlat, IBC TopFix 200 or IBC [...] case may be, do not constitute a warranty claim. Normal wear and tear, in particular normal wear and tear of the IBC AeroFix, IBC AeroFlat, IBC TopFix 200 or IBC WallFix, 200 mounting systems due to use, does not constitute a warranty claim. Warranty performance In case of a warranty claim, IBC shall, in its sole discretion, deliver Customer either a defect-free part, repair the defect part or reimburse the fair value of the defect part to the Customer. The expenses necessary for fulfilling the",
        "score": 0.85797083,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty-IBC-Solar-modules-EU_EN.pdf",
        "title": "[PDF] Warranty Statement - ibc solar",
        "snippet": "As of: 15. October 2024 Page 1 from 5 Warranty Statement (Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Ice-land, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, Turkey, Ukraine, Vatican City, Belarus and also Japan) IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein, Germany P +49 (0)9573/92 24 0 F +49 (0)9573/92 24 111 (hereinafter referred to as ´IBC SOLAR´) as the [...] SOLAR. As of: 15. October 2024 Page 2 from 5 3. Product Warranty IBC SOLAR grants a Product Warranty for quality in material and processing of the Module. For glass foil modules (Example: IBC MonoSol xxx MS10-HC-N): In the event a defect due to material or manufacturing fault(s) occurs within the first fifteen (15) years and that certain defect impairs Module's functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. [...] time of the warranty event. Only the Beneficiary shall be entitled to assert any warranty event. That Warranty applies to a Module IBC SOLAR delivered as from January 1st, 2024, until the concerned Module forms part of the photovoltaic system in which it had been initially installed. Any Module that was removed and reinstalled is not covered by that Warranty, unless it was removed and reinstalled as part of repair work (in terms of section 5.). Note: This Warranty excludes the junction box",
        "score": 0.77487355,
        "bucket": "other"
      },
      {
        "url": "https://www.theboilerguys.com/wp-content/uploads/2019/02/T-Series-Warranty.pdf",
        "title": "[PDF] T SERIES IBC Technologies LIMITED WARRANTY INFORMATION ...",
        "snippet": "Page 1 WARRANTY STATEMENT - T SERIES IBC Technologies LIMITED WARRANTY INFORMATION IBC warranty obligations are limited to the terms set forth below: IBC warrants to the original purchaser that this product will be free of manufacturing defects in material and workmanship for a period of one (1) year from the original purchase date, or eighteen (18) months from IBC’s original invoice, whichever expires first. The original purchase date as used herein shall mean the date stated in the vendor’s [...] the product fail to perform according to the specifications set forth by IBC during the warranty period, IBC will repair or replace, free of charge, the products that it finds defective. If you wish to make a warranty claim, please complete this form. Incomplete forms will not be processed. To make multiple claims, please fill out one form for each individual unit. Name: Company: Address: Telephone: Fax: Product Information: Model Name: Comments: Serial Number: (indicate source/symptoms of [...] responsible for such costs. IBC RESERVES THE RIGHT TO CHANGE SPECIFICATIONS OR DISCONTINUE MODELS WITHOUT NOTICE. 120-266 Page 2 X WARRANTY CLAIMS FORM IBC WARRANTY CLAIMS FORM IBC warrants this product against defects in materials and workmanship for a period of one (1) year from the original purchase date, or eighteen (18) months from IBC’s original invoice, whichever expires first. The original purchase date as used herein shall mean the date stated in the vendor’s original invoice. Should",
        "score": 0.6760432,
        "bucket": "other"
      },
      {
        "url": "https://www.ibcboiler.com/support/TIPortal/Content/Installation_&_Maintenance/Warranties/PDF/IWT_warranty_EN.pdf",
        "title": "[PDF] LIMITED WARRANTY",
        "snippet": "description of the claim. All alleged appliances and defective component parts must be returned through IBC-authorized distributor channels. Replacement component parts, if the conditions of this Limited Warranty are met, will be provided by IBC through such authorized distributor or relevant representatives. No contractor or distributor may grant any service under this warranty without the prior approval of IBC. If there are any questions about the coverage of this Limited Warranty, please [...] applicable building codes/ordinances, regulations and standards, good plumbing and electrical trade practices, or the Installation and Operating Manual) will invalidate warranty coverage. IBC warrants this appliance, and its component parts, to be free from defects in materials and manufacture, under normal use and service, during the Applicable Limited Warranty Periods and subject to the Limited Warranty Exclusions set out below. In its sole discretion, IBC will repair or replace the defective [...] behalf of IBC. ANY APPLICABLE IMPLIED WARRANTIES, INCLUDING OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE, SHALL NOT EXTEND BEYOND THE APPLICABLE LIMITED WARRANTY PERIODS SPECIFIED BELOW. IBC’S SOLE LIABILITY, WITH RESPECT TO ANY DEFECT IN THIS APPLIANCE, SHALL BE AS SET FORTH IN THIS LIMITED WARRANTY. IBC SHALL HAVE NO LIABILITY WHATSOEVER FOR ANY AND ALL CLAIMS FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL DAMAGES (INCLUDING DAMAGE RESULTING FROM WATER LEAKAGE), ALL OF WHICH ARE",
        "score": 0.6628188,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ibc-solar",
    "product": "IBC FlatFix",
    "candidates": [
      {
        "url": "https://www.pvo-int.com/wp-content/uploads/2019/01/Brochure-FlatFix-Fusion-EN.pdf",
        "title": "[PDF] THE INNOVATIVE",
        "snippet": "Quick and easy assembly 100% Dutch product One-tool approach 20 year warranty 20 YEAR Dual formation Lightweight system The system only needs to be ballasted on a few strategic points due to the interconnected and closed structure. This keeps the additional roof load very low.\nUnique click connection The revolutionary and unique click connection makes the FlatFix Fusion system a very quick and easy to install mounting system. Only one tool is required to mount the solar panels. [...] • Aesthetic TRANSPORT AND HANDLING • Minimal number of components • Lightweight • Shorter profiles for easy transportation • Fixed measurements INSTALLATION TIME • Click joints instead of screws • One single tool for the installation of the panels • Fixed dimensions, no measurement errors UP TO 40% FASTER INSTALLATION FlatFix Fusion is a revolutionary and lightweight racking system for solar panels on both large and small surface flat roofs. The system can be mounted in different ways so as to [...] Unique thermal-effect compensation built-in The FlatFix Fusion system is thermally disconnected through self-aligning roof supports. The system can ‘glide’ across the roof supports, whereby the forces are not transferred to the roof and vice versa. 1 2 3 4 2 1 4 Integrated cable management system FlatFix Fusion is equipped with an integrated cable management system. The cables and plugs of the solar panels can be simply attached to the mounting system. This reduces the chance of malfunctions in",
        "score": 0.6708892,
        "bucket": "datasheets"
      },
      {
        "url": "https://natec.com/wp-content/uploads/2021/09/Esdec-Brochure_FlatFix_WaveEntry_EN_212.pdf",
        "title": "[PDF] PROFESSIONAL ENTRY-LEVEL - Natec",
        "snippet": "Pitch length of 2300 mm • Angle of inclination 10° SAFE & ROBUST • Roof support with movable connectors • Unique thermal decoupling prevents damage to roof material • Integrated bonding • Multiple ballast options for optimal weight distribution and maximum safety • High coupling factor due to clamping on both panel sides Quick & easy installation FlatFix Wave Entry can be installed easy and quickly thanks to the limited number of mounting steps and components. Align and extend the pre-assembled [...] Pre-assembled base units for 2 panels: easy to handle on the roof Cable management Quick and easy feeding and stowing of cables using the cable rack Integrated bonding Adapter bracket: Integrated bonding Robust system Clamping on both the long and the short side of the solar panel Only 1 tool needed Multi head screw T30 and SW10 1 2 3 4 5 1 2 4 3 5 FlatFix Fusion is focused on the benefits that installers and end-users are looking for in the residen-tial sector, ideally suited for roofs with",
        "score": 0.58237284,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.pv-tech.org/wp-content/uploads/legacy-publication-pdfs/14d226d30c-pv-tech-power-volume-18.pdf",
        "title": "[PDF] Leaving the rest in the shade - PV Tech",
        "snippet": "tracking systems and inverters, and presenting comparative simulation and measurement results from bifacial and monofacial systems PV systems with lowest LCOE using bifacial modules: State-of-the-art systems and components Figure 1. Bifacial IBC (interdigitated back contact) cell with bifacial character (ISC Konstanz, “ZEBRA” cell; bifacial factor in module >0.75) Bifacial systems cover story www.pv-tech.org | February 2019 | 17 easily upgraded from monofacial PERC and PERC is currently [...] For bifacial as for monofacial modules, a common attribute is the used cell technol-ogy, which is often not directly referring to the underlying technology, such as n-PERT, IBC, HJT or p-PERC, but to the name chosen by the manufacturer for their specific process. There is a wide field of technologies, which allow a differentiation. A detailed discussion of the respective cell concepts, their advantages and drawbacks, would be beyond the scope of this article, but comprehensive information can [...] HJT and IBC, both with more complex processes and more expensive n-type wafers, promise the highest efficiencies and HJT is superior with regard to the bifaciality. Bifacial IBC is the most complex but least investigated technology. N-PERT and also PERC+ are the most common bifacial cell types today, with n-PERT showing a higher bifaciality and higher efficiency potential, but at higher cost. There is a large number of n-type manufac-turers, but there is also a steadily growing amount of p-type",
        "score": 0.18590319,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.pv-tech.org/wp-content/uploads/legacy-publication-pdfs/1a4ff77a68-pv-tech-power-volume-16.pdf",
        "title": "[PDF] Puzzling times - PV Tech",
        "snippet": "Availability: Available since July 2018.\nblack back sheet and frame, with power classes up to 320Wp.\nApplications: Residential and commercial. [...] fl exibility and compatibility with high-output PV panels. [...] harsh, such as heavy load or impact load (snow), it is common that inverter will go offl ine and damage the circuit making the fault hard to fi nd.",
        "score": 0.16881615,
        "bucket": "datasheets"
      },
      {
        "url": "https://solar-media.s3.amazonaws.com/assets/Pubs/PVTP%2016/PVTP16.pdf",
        "title": "[PDF] Puzzling times - AWS",
        "snippet": "fl exibility and compatibility with high-output PV panels. [...] harsh, such as heavy load or impact load (snow), it is common that inverter will go offl ine and damage the circuit making the fault hard to fi nd. [...] Availability: First production and sales in The Netherlands starting in November, while full capacity production is expected to be reached in the first quarter of 2019. between busbars, losses from micro cracks in a cell are lower, providing security from large losses. Applications: Utility-scale PV power plants.",
        "score": 0.09726189,
        "bucket": "datasheets"
      },
      {
        "url": "https://portal.segensolar.de/reseller/docs/Manual_FlatFixFusion_Single_EN_051.pdf",
        "title": "[PDF] FlatFix Fusion Flat roof mounting system for solar panels in a single ...",
        "snippet": "MANUAL FOR FLATFIX FUSION MOUNTING SYSTEM FOR FLAT ROOFS. 1. Introduction. This manual describes the installation of the FlatFix Fusion mounting system for",
        "score": 0.98577,
        "bucket": "installation"
      },
      {
        "url": "https://amonraenergy.eu/wp-content/uploads/2024/03/Manual_FlatFixFusion_Single_EN_316.pdf",
        "title": "[PDF] MANUAL",
        "snippet": "1007196) 24 MANUAL FOR FLATFIX FUSION MOUNTING SYSTEM FOR FLAT ROOFS Article number Description Panel length [mm] Min Max 1007202 Ballast container 1600 1550 1690 1007210 Ballast container 1700 1655 1795 1007213 Ballast container 1900 1830 1970 1007086 Ballast container 2000 1940 2080 1007219 Ballast container 2100 (DTO) 2050 2190 Article number Description Panel length [mm] Grey Black Min Max 1007201 1007201-B Wind deflector back 1600 1550 1690 1007209 1007209-B Wind deflector back 1700 1655 1795 1007212 1007212-B Wind deflector back 1900 1830 1970 1007085 1007585-B Wind deflector back 2000 1940 2080 1007218 1007218-B Wind deflector back 2100 (DTO) 2050 2190 7.2 Installing cable exit guides, cables and wind deflectors 25 MANUAL FOR FLATFIX FUSION MOUNTING SYSTEM FOR FLAT ROOFS 7.2.1 Mounting cable exit guides (optional) Optional cable exit guides should be placed on the edge (left or right) of the panel array, on the first or last base profile of a row.",
        "score": 0.98455,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_IBC_TopFix200_EN_V_19_01.pdf",
        "title": "[PDF] Installation manual - IBC SOLAR Fachpartnerportal",
        "snippet": "To simplify the installation and commissioning of your IBC TopFix 200 mounting system, we have included these detailed installation instructions. They are",
        "score": 0.98176,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_AeroFix-AeroFlat_EN_V_19_01.pdf",
        "title": "[PDF] Installation instructions - IBC AeroFix / AeroFlat",
        "snippet": "The IBC AeroFix / AeroFlat flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or base",
        "score": 0.97308,
        "bucket": "installation"
      },
      {
        "url": "https://www.esdec.com/wp-content/uploads/2023/06/Manual_FlatFixWave_Plus_EN_REV05.pdf",
        "title": "[PDF] manual - flatfix wave plus - Esdec",
        "snippet": "FlatFix Wave Roof support 1009120 WIND DEFLECTORS BALLAST 105 105 80 210 4 kg PANEL FRAME X Y 1,2 mm 14 mm 2 mm 35 mm min max Y X 1b. FlatFix Wave Ballast Tray 1009129 7b 8 7a 6R 7b 7c 6L 13 13 14 03 2 PREPARATIONS FOR ASSEMBLY 3 PLACE DUAL START UNIT 1 PREPARING THE ROOF AND ALIGNING (THE FIELDS) 2 MEASURING AND MARKING (OF FIELD) 2 UNFOLD THE TOP OF THE DUAL START UNIT UNTIL IT IS COMPLETELY FLAT AND CLICKS INTO PLACE 3 PLACE THE HIGH BASE (2x) IN STANDING POSITION SO THAT IT CLICKS NB: Follow the installation drawing and make sure the fields are well coordinated.",
        "score": 0.97219,
        "bucket": "installation"
      },
      {
        "url": "https://pimassetsprdst.blob.core.windows.net/assets/apc_Original/85/08/25458508.pdf",
        "title": "[PDF] manual - flatfix wave entry - NET",
        "snippet": "Slide the clips of 2 lower adapters on the panel locks over the edge of the front panel until the panel is firmly clamped in place. Click! 7",
        "score": 0.96886,
        "bucket": "installation"
      },
      {
        "url": "https://www.e-nummersok.se/infoDocs/MAN/MAN_34887_5288922.pdf",
        "title": "[PDF] IBC AeroFix G3",
        "snippet": "The IBC AeroFix G3 flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or",
        "score": 0.96582,
        "bucket": "installation"
      },
      {
        "url": "https://www.esdec.com/wp-content/uploads/2023/03/22-0801-DNV-Report-Esdec-Solar-Group-Bankability-Study-Flatfix-Wave-Series.pdf",
        "title": "[PDF] Esdec FlatFix Wave Series",
        "snippet": "is completed on the roof, based on the layout drawing and installation manual provided by Esdec. FlatFix Wave system is a unique toolless solution to install, easy to understand and unfold. All these properties allow for a significant labor time saving and make the system cost effective. The uniqueness of its mechanism makes it significantly unconventional in comparison with other systems but DNV does not expect assembly or operating issues. Specially, since this mechanism plays an important [...] environment, mounting systems are not completely “manufactured” until they are assembled and commissioned at a project site. The FlatFix Wave plan involves the shipment of components to the installation site, storage and staging onsite. The final assembly will be done by the contractors of the project on site. The design of the system is by Esdec and the production is done by selected, external and exclusively working for Esdec manufacturers. The manufactured components are transported and [...] performing the proper checks to verify the installed system is in conformance with the installation manual. FlatFix Wave has adequate installation manual with an illustrative procedure for the installation of the mounting system (see Chapter 2). The FlatFix Wave checklist includes delivered material, alignment and placement, and installation procedure of the components. However, it does not provide any recommendation or awareness towards visual checks of corrosion protection coating and signs",
        "score": 0.6337056,
        "bucket": "installation"
      },
      {
        "url": "https://www.energy-storage.news/wp-content/uploads/legacy-publication-pdfs/c147564d00-pv-tech-power-volume-17.pdf",
        "title": "[PDF] The solar briefing - Energy-Storage.News",
        "snippet": "Platform: Using self-levelling baseplates, FlatFix is available with ballasted and hybrid attachment options. The fl exible system can be oriented in a traditional south-facing direction or in a dual-tilt orientation. FlatFix’s materials and design compensate for thermal eff ects, reducing potential heat-induced degradation of the PV modules and protecting the integrity of the roof. The system comes with a 20-year warranty and UL certifi cation. [...] system design. A fl exible ballasted non-penetrating system that can be oriented in a traditional south-facing direction or in a dual-tilt orien-tation is often required. Solution: The FlatFix system is said to guarantee the use all common solar panels on any fl at roof. The lightweight system exerts less of a load on the roof, is quick to mount thanks to the click-fi t connectors, and has a unique thermal decoupling. FlatFix’s racking components, including bonding straps, are assembled by [...] Credit: Flickr: 193days products 14 | December 2018 | www.pv-tech.org December Product Outline: Solar rooftop mounting solutions provider Esdec has launched its fi rst product into the US market, off ering its ‘FlatFix’ system, a lightweight, clickable solar mounting system for fl at roofs. FlatFix’s innovative design enables rapid assembly, allowing commercial installers to signifi -cantly reduce installation times.",
        "score": 0.6016175,
        "bucket": "installation"
      },
      {
        "url": "https://www.nacleanenergy.com/magazine/issues/NACE_NovDec2018-WEB.pdf",
        "title": "[PDF] 2019 WIND - North American Clean Energy",
        "snippet": "roofs. Featuring a 20-year warranty and UL certification, FlatFix’s design enables rapid assembly, allowing commercial installers to significantly reduce installation times. FlatFix’s racking components, including bonding straps, are assembled by snapping into a locked position without the need for tools. The rails click together easily and quickly to form an interconnected, solid structure. Complete module installation requires just one tool and minimal parts, while power optimizers can be [...] attached via snap-on clips in a matter of seconds. Using self-levelling baseplates, FlatFix is available with ballasted and hybrid attachment options. The flexible system can be oriented in a traditional south-facing direction or in a dual-tilt orientation. FlatFix’s materials and design compensate for thermal effects, reducing potential heat-induced degradation of the PV modules and protecting the integrity of the roof. Esdec is also introducing its ClickFit product to the U.S. market. A [...] lightweight, fully adjustable rail-based racking system, ClickFit can be used on various types of pitched residential and commercial roofs. FlatFix and ClickFit are both UL-certified Class A fire-rated, having achieved fire mitigation for Type 1 and 2 PV modules.",
        "score": 0.5455042,
        "bucket": "installation"
      },
      {
        "url": "https://dualsun.com/wp-content/uploads/etn-esdec-flatfix-wave-1.pdf",
        "title": "[PDF] etn-esdec-flatfix-wave-1.pdf - Dualsun",
        "snippet": "tous les accessoires). o Le chargement limite (normal non pondéré incluant le champ lui-même et tous les accessoires) admis en fonction de la portée des bacs entre appuis (2, 3 ou plus de 3 appuis). Contraintes générales : • Pose en mode PAYSAGE uniquement. • Mise en œuvre sur bâtiments neufs ou existants (charpente bois, béton ou acier) • Possibilité de mise en œuvre sur des bâtiments commerciaux, industriels, résidentiels ou agricoles. • Possibilité de mise en œuvre sur des bâtiments type [...] 2,30m 2,35m 150 50 200 2,10m 2,20m 2,25m 150 60 210 2,00m 2,10m 2,15m 150 70 220 1,90m 2,00m 2,10m 150 80 230 1,80m 1,90m 2,00m 150 90 240 1,70m 1,80m 1,90m 150 100 250 1,60m 1,70m 1,80m 175 30 205 2,05m 2,15m 2,20m 175 40 215 1,95m 2,05m 2,10m 175 50 225 1,80m 1,90m 2,00m 175 60 235 1,70m 1,80m 1,90m 175 70 245 1,60m 1,70m 1,80m 175 90 265 1,40m 1,50m 1,60m 175 100 275 1,30m 1,40m 1,50m 200 30 230 1,90m 2,10m 2,15m 200 40 240 1,80m 2,00m 2,10m 200 50 250 1,70m 1,80m 1,90m 200 60 260 1,60m [...] du présent rapport. (Se référer également à la notice de montage). Pour les projets de réhabilitation et/ou sur des ouvrages existants, l'installation d'un champ générateur implique des modifications de cas de chargements : l'installateur devra impérativement missionner un bureau d'études spécialisé pour mener toutes les vérifications nécessaires. Dans les ouvrages existants, quel que soit le cas de figure, un diagnostic de la solidité des structures existantes devra être effectué par un bureau",
        "score": 0.53385985,
        "bucket": "installation"
      },
      {
        "url": "https://dl.bisol.com/files/Certificates/ETN%20Procede%20FLATFIX%20FUSION.pdf",
        "title": "[PDF] ETN Procede FLATFIX FUSION - BISOL Group",
        "snippet": "• L'un référencé « Manuel d'installation FLATFIX FUSION - Système de montage FlatFix Fusion sur toits plats pour ... 1-182mm Hafl cut 390w-410w",
        "score": 0.5122296,
        "bucket": "installation"
      },
      {
        "url": "https://enstall.com/wp-content/uploads/2023/10/ENSTALL_sustainability_report_2022_v1.0.pdf",
        "title": "[PDF] Accelerating a sustainable future - Enstall",
        "snippet": "Empowers, with the help of a dedicated group of volunteers, teamed up to deliver and install a solar system for OpenDoor, a sustainable living community for disabled young individuals to learn independence and feel supported in their daily activities. With the donation of our FlatFix Fusion system, we proudly contributed to the development and sustainability of this community, supplying the community with solar energy to support a completely gas-free home. Marc Dalderup, a member of the [...] quality, stress, and safety standards and certifications, such as Kiwa, MCS, UL, VDE, ASCE 7, the IBC, and the IRC. Opportunities • Maintain a market-leading position by upholding customer safety standards and ensuring exceptional product quality. [...] Making it happen, together with our partners Supply chain collaboration Design & engineering Design for low weight and maximum strength We continuously optimize the balance between the weight and the strength of our solutions to enable the most solar with the least metal.\nDesign for safety With light and innovative systems, we minimize the need for heavy lifting, complex handling maneuvers and power tool usage.",
        "score": 0.42935818,
        "bucket": "installation"
      },
      {
        "url": "https://www.pv-tech.org/wp-content/uploads/legacy-publication-pdfs/9fd9d033f7-pv-tech-power-volume-15.pdf",
        "title": "[PDF] Repowering, retrofitting and the future of asset management - PV Tech",
        "snippet": "Platform: Due to its size – 1,318 x 980 x 46 millimeters and weighing only 17 kilograms – the module is easy to install, especially in difficult installation conditions. The corresponding IEC certifications (IEC/ EN 61215 and IEC/EN 61730) confirm the module’s safety, quality and long service life; the module has also been tested according to IEC 61215 for a snow load test exerting 5,400 Pa.\nAvailability: March 2018 onwards in Europe. [...] The entire contents of this publication are pro-tected by copyright, full details of which are available from the publisher. All rights reserved. No part of this publication may be reproduced, stored in a retrieval system or transmitted in any form or by any means – electronic, me-chanical, photocopying, recording or otherwise – without the prior permission of the copyright owner. [...] easy commissioning and less cabling. The individual units are managed and interact with the grid as connection speeds installation and reduces labour. The new Power+ Solution off ers 50% faster commissioning within Sunny Portal Applications: Residential rooftop PV systems. Platform: Tool-free installation is claimed to save 75-90 minutes per system compared to other brands. Selective deployment can eliminate up to 72 minutes per system compared to other solutions. The Power+ Solution now also",
        "score": 0.16587698,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/IBC_Systemwarranty_EN.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "page 1 of 5 TERMS AND CONDITION OF WARRANTY (Version 1.10 / Last Update: July 2025) System consisting of IBC AeroFix / IBC AeroFlat / IBC TopFix 200 / IBC WallFix mounting systems and IBC Module / IBC MonoSol solar modules. Guarantor: IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0)9573/ 92 24 0 Fax +49 (0)9573/ 92 24 111 hereinafter referred to as „IBC“. A. General warranty conditions Beneficiary IBC provides the end customer (hereinafter „Customer“) a non-transferable [...] by this warranty. Applicable law This warranty is subject to the law of the Federal Republic of Germany. The courts of Coburg, Germany shall be the place of jurisdiction for all disputes arising from or in connection with this warranty. B. Specific warranty conditions for the mounting system used in the system Product Warranty For the duration of the Warranty Period, IBC guarantees Customer in the system that each of the assembly systems in IBC AeroFix, IBC AeroFlat, IBC TopFix 200 or IBC [...] case may be, do not constitute a warranty claim. Normal wear and tear, in particular normal wear and tear of the IBC AeroFix, IBC AeroFlat, IBC TopFix 200 or IBC WallFix, 200 mounting systems due to use, does not constitute a warranty claim. Warranty performance In case of a warranty claim, IBC shall, in its sole discretion, deliver Customer either a defect-free part, repair the defect part or reimburse the fair value of the defect part to the Customer. The expenses necessary for fulfilling the",
        "score": 0.78054583,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty_IBC_SOLAR_AeroFix_TopFix200.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "Term of Warranty The term of warranty (”Warranty Period“) given to the Customer by IBC for the assembly systems IBC AeroFix or TopFix 200, as applicable, shall be 10 years and commences with the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts latest six (6) months after delivery by IBC to their buyer. Warranty conditions and warranty For the duration of the Warranty Period, IBC guarantees Customer that each of the assembly [...] Version 17.01, last update: July 2017 1 IBC AeroFix / TopFix 200 IBC SOLAR AG, Am Hochgericht 10, 96231 Bad Staffelstein, Germany Tel. +49 (0)9573/ 92 24 0; Fax +49 (0)9573/ 92 24 111 hereinafter referred to as “IBC”, provides for each of the assembly systems IBC AeroFix and TopFix 200 the following worldwide product warranty (“Warranty”): Product warranty The legal rights of rectification, withdrawal, reduction or compensation in the event of defects in the assembly system IBC AeroFix or TopFix [...] Warranty Claims The entity entitled to warranty must submit a warranty claim to the respective retailer or installer of the assembly systems IBC AeroFix or TopFix 200, as the case may be, and enclose the original invoice to identify the delivery date immediately after discovering the warranty case, however, at the latest three months after the entity entitled to warranty has become aware of the facts that justify a warranty claim or if the entity did not become aware of the facts due to gross",
        "score": 0.76490957,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty-IBC-Solar-modules-EU_EN.pdf",
        "title": "[PDF] Warranty Statement - ibc solar",
        "snippet": "As of: 15. October 2024 Page 1 from 5 Warranty Statement (Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Ice-land, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, Turkey, Ukraine, Vatican City, Belarus and also Japan) IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein, Germany P +49 (0)9573/92 24 0 F +49 (0)9573/92 24 111 (hereinafter referred to as ´IBC SOLAR´) as the [...] time of the warranty event. Only the Beneficiary shall be entitled to assert any warranty event. That Warranty applies to a Module IBC SOLAR delivered as from January 1st, 2024, until the concerned Module forms part of the photovoltaic system in which it had been initially installed. Any Module that was removed and reinstalled is not covered by that Warranty, unless it was removed and reinstalled as part of repair work (in terms of section 5.). Note: This Warranty excludes the junction box [...] SOLAR. As of: 15. October 2024 Page 2 from 5 3. Product Warranty IBC SOLAR grants a Product Warranty for quality in material and processing of the Module. For glass foil modules (Example: IBC MonoSol xxx MS10-HC-N): In the event a defect due to material or manufacturing fault(s) occurs within the first fifteen (15) years and that certain defect impairs Module's functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4.",
        "score": 0.75464433,
        "bucket": "other"
      },
      {
        "url": "https://portal.segensolar.de/reseller/docs/210315-Esdec-Warranty-Conditions-ENG.pdf",
        "title": "[PDF] Warranty Conditions",
        "snippet": "ClickFit/FlatFix solar rooftop mounting products as provided by Esdec under the Sales Agreement (the \"Products\") shall, for a period of 20 (twenty) years from the date of delivery by Esdec or such longer period as is demonstrably required under mandatory provisions of applicable law (the \"Warranty Period\"), be free from material deficiencies in materials and workmanship conform to their functional and technical specifications as set forth in the product documentation provided by Esdec in [...] damage due to chemical, electrical, electrolytic, corrosive or environmental influences (k) When the correct quantities or components have not been used as prescribed in the assembly instructions and calculators. When the building, roof, roof covering or construction is not suitable for installing solar panels with the Products. [...] limitation) hail, lightning, storm, flood, explosions, fire, vandalism, extreme wind speeds or temperatures, other extreme weather conditions, or any other events of force majeure as may be set out in the Sales Agreement or that may apply in accordance with applicable law. (j) In the absence of proper professional maintenance, non-compliance with the applicable installation and / or assembly instructions, incompetent, injudicious or improper use, normal wear and tear and aging, poor assembly,",
        "score": 0.7163977,
        "bucket": "other"
      },
      {
        "url": "https://www.ibcboiler.com/wp-content/uploads/warranty/IBC-Warranty-HC-DC.pdf",
        "title": "[PDF] 10 YEAR LIMITED WARRANTY – HC & DC SERIES BOILERS",
        "snippet": "“FIVE YEAR LIMITED WARRANTY – All Parts” Within five years of the original installation of the boiler and registration of the installation with IBC; the Five Year Limited Warranty covers repair or replacement of all parts found to suffer from manufacturing defect.\nPage 1 of 2 1. [...] Summary of Coverage IBC Technologies Inc., warrants each boiler to be free from defects in material and workmanship, and will provide redress when such defects are proven, in accordance with the following terms, conditions and periods;  HC & DC Series Warrranty 120-228B Mixed residential / non-residential / multi-family residential or changed to any of these from single-family residential. [...] Legal Rights No other party is authorized to make any other warranties on IBC’s behalf. No other warranty expressed or implied (including warranty of merchantability and warranty of fitness for a particular purpose) is made. This warranty does not extend to liability for incidentals, special or consequential damage. All disputes, claims or demands arising from or relating to the Warranty, or from the terms and conditions herein contained and all claims, demands, rights or liabilities arising",
        "score": 0.62742686,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ibc-solar",
    "product": "IBC GroundFix",
    "candidates": [
      {
        "url": "https://assets.ctfassets.net/9pi13bto1z9e/NT2m4VvrkLv4SZmqHBxQR/09ed2933f83257582f13788973cb0041/121009-Maysun_IBC_MS_430W_BC-54HB.pdf",
        "title": "[PDF] 22.8% 0 ~ +5W",
        "snippet": "Higher conversion efficiency generation.\nBetter appearance Low temperature coefficient IBC solar panels feature a low temperature coefficient, which allows for better performance in hot climates. [...] Mono IBC 182mm 108 Cells MS(410-440)BC-54HB Full Black On-grid residential 410/415/420/425/430/435/440WP MAYSUNSOLAR. COM APPLICATIONS >> roof-tops On-grid commercial/ industrial roof-tops Advanced Solar Technology IBC - Full Black The most advanced technology The most advanced technology for mass-produced photovoltaic modules,cell technology is far advanced The short circuit current density of IBC cells is 5-8% higher than that of ordinary cells. No bus bars on the front to reduce optical loss [...] There is no bus bars on the front, tight cell layout, overall unity, making a beautiful and elegant appearance. MAXIMUM EFFICIENCY 22.8% POSITIVE POWER TOLERANCE 0 ~ +5W 100% — 98.5% 80% 90% — — 70% 1 5 10 15 20 25 88.9% 80% Standard Performance Warranty IBC PV modules have a wider application scenario and are especially suitable for building More application scenarios applied PV. Higher reliability Compared to PV modules made by front welding, the reliability and stability of IBC modules are",
        "score": 0.50959414,
        "bucket": "datasheets"
      },
      {
        "url": "https://ethiopias-elephants.com/wp-content/uploads/2020/10/Babile_ES_Management_Plan_Final-Feb.-2011.pdf",
        "title": "[PDF] babile elephant sanctuary management plan - Ethiopia's",
        "snippet": "Manual, pp. 1-5, (Meester, J. and Setzer, H.A., Eds), Part 11, Smithsonian Institute. Press, Washington. Anteneh Belayneh (2006). Floristic analysis and",
        "score": 0.98559,
        "bucket": "installation"
      },
      {
        "url": "https://cro.ie/wp-content/uploads/2025/07/30-July-2025-Annual-Returns-Received.pdf",
        "title": "[PDF] CRO Gazette Annual Returns Received",
        "snippet": "Document Date Of Receipt. 753200. EMERALD LOCUMS LIMITED. B1C. 25/07/2025. 732491. CONNOLLY'S SOLAR PV SYSTEMS LIMITED. B1C. 25/07/2025. 536186.",
        "score": 0.98509,
        "bucket": "installation"
      },
      {
        "url": "https://www.worldradiohistory.com/UK/Short-Wave-UK/90s/SWM-1995-09.pdf",
        "title": "[PDF] sm.... - World Radio History",
        "snippet": "Records and saves 400 unique frequencies. Records 255 hits on each frequency in memory. Digital Filter and AutoCapture in Pend.).",
        "score": 0.98464,
        "bucket": "installation"
      },
      {
        "url": "https://cdn.manchesterhistory.org/News/Manchester%20Evening%20Hearld_1958-08-04.pdf",
        "title": "[PDF] Ike Vetoes Funds ncies, Raps Retirement Total To UAR Seals ...",
        "snippet": "1958 (F O U R T E E N P A G E S ) JPRtC r Y I Y E C E N T S Ike Vetoes Funds , ' 'V ncies, Raps Retirement Total To Washington, Aug. 4 (/t^—* President Eisenhower today vetoed a bill carrying billion for 17 federid agencies. n iir m h i< l* F f ' P A d A v V l l h r r t i t A t h f i i l K h t n f t o n W n i i M h p \\ P i v l i A i f l J o h .",
        "score": 0.97788,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_IBC_TopFix200_EN_V_19_01.pdf",
        "title": "[PDF] Installation manual - IBC SOLAR Fachpartnerportal",
        "snippet": "adatper) (length/width/height): 1660-1680 mm/990 mm/40–50 mm (1640-1659 mm/ ca. 990 mm/ 40-50 mm) 1580-1620 mm/ 800 mm/40-50 mm 1310-1340 mm/990 mm/40-50 mm  Cable capacity up to 8 kN (800 kg)  Mounting in a few simple steps  Module frame not affected by additional drilling  In the event of subsequent repairs to the PV generator it is merely required to remove the module, not the entire mounting system Assembly  If necessary, insert the adapter on the cable frorm the clamping shoe.  [...] adjustability at the base plate. parameters value Material Stainless steel 1.4301 S460 yield strength fy,k = 460 N/mm² Dimensions base plate (length / width / height) 155/ 75/ 5 mm Dimensions hook (width / height) 35/ 6 mm Drilling holes baseplate ∅ 9 mm Drilling holes hook slot ∅ 11 mm, L=30 mm Hook distance from the base plate 42 mm – 55 mm Horizontal adjustment at the base plate ± 55,5 mm weight 1,355 kg General construction approval Z-14.4.-661 Maximum ch. load / roof hook [kN] not [...] manufacturer of the respective roofing. Proceed as follows during mounting:  Do not drill into the water bearing depressions, but into the protruding parts.  Use the pre-drilling diamters, screwing depths illustrated in Figure 50 and minimum dimension in Figure 166. Hanger bolt pre-drilling diameter [mm] Screwing depth lef [mm] Hanger bolt M12x300 A2 8,4 48…100 Hanger bolt M10x200 A2 7,0 40…67 Figure 50: pre-drilling diameters for plate and substructure; screwing depths for substructure ",
        "score": 0.6917478,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_AeroFix-AeroFlat_EN_V_19_01.pdf",
        "title": "[PDF] Installation instructions - IBC AeroFix / AeroFlat",
        "snippet": "still have questions after reading them, please contact your IBC partner, who will be happy to assist you. We wish you a sunny day! Your team IBC SOLAR AG 4 Version 19.01, 21-Jun-2019 2. Tool list  Cordless screwdriver with various bits (Torx 40, SW8 socket, SW15 socket,...)  Bit holder 300 mm  Pencil  Tape measure  Folding rule  Plumb line  Angle grinder with diamond grinding wheel  Torx screwdriver with T-handle, size TX40  Torque wrench  Assembly gloves  Assembling jig  Static [...] friction measureing device (in the planning phase) 3. General information, standards and regulations The IBC AeroFix / AeroFlat flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or base rails using clamps. The number of parts varies depending on installation size.. Important information:  Your IBC AeroFix / AeroFlat flat roof system will be delivered complete with all accessories!  Before you begin, please check that all [...] guarantee conditions are stated in the guarantee document.  We advise the use of gloves to avoid injuries.  During the entire assembly time, it must be ensured that at least one copy of the current installation manual is available on the construction site. Other important information and dimensioning standards The entire PV system must be mounted according to the generally recognised technical regulations. Please ensure that you observe the accident prevention regulations of the German",
        "score": 0.6055431,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibcboiler.com/support/TIPortal/Content/Guides_and_manuals/SL/120-276E11_SL_G3_Res_I&O.pdf",
        "title": "[PDF] Installation & Operating manual - IBC Boilers",
        "snippet": "Points out installation, maintenance and operational notes to enhance efficiency, longevity and proper operation of the boiler. Important safety instructions.",
        "score": 0.38311088,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty-IBC-Solar-modules-EU_EN.pdf",
        "title": "[PDF] Warranty Statement - ibc solar",
        "snippet": "As of: 15. October 2024 Page 1 from 5 Warranty Statement (Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Ice-land, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, Turkey, Ukraine, Vatican City, Belarus and also Japan) IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein, Germany P +49 (0)9573/92 24 0 F +49 (0)9573/92 24 111 (hereinafter referred to as ´IBC SOLAR´) as the [...] time of the warranty event. Only the Beneficiary shall be entitled to assert any warranty event. That Warranty applies to a Module IBC SOLAR delivered as from January 1st, 2024, until the concerned Module forms part of the photovoltaic system in which it had been initially installed. Any Module that was removed and reinstalled is not covered by that Warranty, unless it was removed and reinstalled as part of repair work (in terms of section 5.). Note: This Warranty excludes the junction box [...] SOLAR. As of: 15. October 2024 Page 2 from 5 3. Product Warranty IBC SOLAR grants a Product Warranty for quality in material and processing of the Module. For glass foil modules (Example: IBC MonoSol xxx MS10-HC-N): In the event a defect due to material or manufacturing fault(s) occurs within the first fifteen (15) years and that certain defect impairs Module's functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4.",
        "score": 0.77199864,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/IBC_Systemwarranty_EN.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "components in the system shall be 15 years („Term of Warranty“) and commences from the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts at the latest six (6) months after delivery by IBC to its buyer. Scope Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Iceland, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, [...] page 1 of 5 TERMS AND CONDITION OF WARRANTY (Version 1.10 / Last Update: July 2025) System consisting of IBC AeroFix / IBC AeroFlat / IBC TopFix 200 / IBC WallFix mounting systems and IBC Module / IBC MonoSol solar modules. Guarantor: IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0)9573/ 92 24 0 Fax +49 (0)9573/ 92 24 111 hereinafter referred to as „IBC“. A. General warranty conditions Beneficiary IBC provides the end customer (hereinafter „Customer“) a non-transferable [...] the solar modules used in the system Product Warranty IBC SOLAR grants a Product Warranty for the quality in material and processing of the Module. In the event a defect due to material or manufacturing faul(s) occurs within the first fifteen (15) years and that certain defect impairs Module’s functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. (“Product Warranty Event”), IBC SOLAR will rectify that certain",
        "score": 0.7646988,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty_IBC_SOLAR_AeroFix_TopFix200.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "Term of Warranty The term of warranty (”Warranty Period“) given to the Customer by IBC for the assembly systems IBC AeroFix or TopFix 200, as applicable, shall be 10 years and commences with the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts latest six (6) months after delivery by IBC to their buyer. Warranty conditions and warranty For the duration of the Warranty Period, IBC guarantees Customer that each of the assembly [...] Version 17.01, last update: July 2017 1 IBC AeroFix / TopFix 200 IBC SOLAR AG, Am Hochgericht 10, 96231 Bad Staffelstein, Germany Tel. +49 (0)9573/ 92 24 0; Fax +49 (0)9573/ 92 24 111 hereinafter referred to as “IBC”, provides for each of the assembly systems IBC AeroFix and TopFix 200 the following worldwide product warranty (“Warranty”): Product warranty The legal rights of rectification, withdrawal, reduction or compensation in the event of defects in the assembly system IBC AeroFix or TopFix [...] The courts of Coburg, Germany shall be the exclusive jurisdiction for all disputes arising of or in connection with this Warranty.",
        "score": 0.76152116,
        "bucket": "other"
      },
      {
        "url": "https://www.theboilerguys.com/wp-content/uploads/2019/02/T-Series-Warranty.pdf",
        "title": "[PDF] T SERIES IBC Technologies LIMITED WARRANTY INFORMATION ...",
        "snippet": "Page 1 WARRANTY STATEMENT - T SERIES IBC Technologies LIMITED WARRANTY INFORMATION IBC warranty obligations are limited to the terms set forth below: IBC warrants to the original purchaser that this product will be free of manufacturing defects in material and workmanship for a period of one (1) year from the original purchase date, or eighteen (18) months from IBC’s original invoice, whichever expires first. The original purchase date as used herein shall mean the date stated in the vendor’s [...] the product fail to perform according to the specifications set forth by IBC during the warranty period, IBC will repair or replace, free of charge, the products that it finds defective. If you wish to make a warranty claim, please complete this form. Incomplete forms will not be processed. To make multiple claims, please fill out one form for each individual unit. Name: Company: Address: Telephone: Fax: Product Information: Model Name: Comments: Serial Number: (indicate source/symptoms of [...] this product. This limited warranty shall not extend to anyone other than the original purchaser of the product. MAKING A WARRANTY CLAIM To file a claim under this warranty, the purchaser must do the following during the warranty period: Before returning the product to IBC for warranty service, the purchaser must complete the Warranty Claims Form (attached) and fax it to IBC USA at (920) 783-8340 or CANADA at (604)877-0295). Upon preliminary assessment of the claim, IBC will send the purchaser",
        "score": 0.6554468,
        "bucket": "other"
      },
      {
        "url": "https://www.ibcboiler.com/wp-content/uploads/warranty/IBC-Warranty-HC-DC.pdf",
        "title": "[PDF] 10 YEAR LIMITED WARRANTY – HC & DC SERIES BOILERS",
        "snippet": "Legal Rights No other party is authorized to make any other warranties on IBC’s behalf. No other warranty expressed or implied (including warranty of merchantability and warranty of fitness for a particular purpose) is made. This warranty does not extend to liability for incidentals, special or consequential damage. All disputes, claims or demands arising from or relating to the Warranty, or from the terms and conditions herein contained and all claims, demands, rights or liabilities arising [...] “FIVE YEAR LIMITED WARRANTY – All Parts” Within five years of the original installation of the boiler and registration of the installation with IBC; the Five Year Limited Warranty covers repair or replacement of all parts found to suffer from manufacturing defect.\nPage 1 of 2 1. [...] Summary of Coverage IBC Technologies Inc., warrants each boiler to be free from defects in material and workmanship, and will provide redress when such defects are proven, in accordance with the following terms, conditions and periods;  HC & DC Series Warrranty 120-228B Mixed residential / non-residential / multi-family residential or changed to any of these from single-family residential.",
        "score": 0.6072213,
        "bucket": "other"
      },
      {
        "url": "https://www.iccsafe.org/wp-content/uploads/2022-IBC-Structural.pdf",
        "title": "2022-IBC-Structural.pdf",
        "snippet": "For SI: 1 ounce per square foot = 0.305 kg/m , 1 pound per square foot = 4.882 kg/m , 1 inch = 25.4 mm, 1 pound = 0.454 kg. [...] For SI: 1 ounce per square foot = 0.305 kg/m , 1 pound per square foot = 4.882 kg/m , 1 inch = 25.4 mm, 1 pound = 0.454 kg. [...] and do not have spaces nor gaps or are not perforated to drain, they shall be sloped to drain.",
        "score": 0.40641484,
        "bucket": "other"
      },
      {
        "url": "https://pdh-pro.com/wp-content/uploads/2018/11/ST-02-501.pdf",
        "title": "International Building Code - Soils And Foundations",
        "snippet": "2. An assessment of potential consequences of any liq-uefaction and soil strength loss, including estimation of differential settlement, lateral movement or reduc-tion in foundation soil-bearing capacity, and shall address mitigation measures. Such measures shall be given consideration in the design of the structure and can include but are not limited to ground stabilization, selection of appropriate foundation type and depths, selection of appropriate structural systems to accom-modate [...] 5-0 #4 at 48″ o.c.\n#4 at 48″ o.c.\n#5 at 48″ o.c.\n6-0 #4 at 48″ o.c.\n#5 at 48″ o.c.\n#6 at 48″ o.c.\n7-0 #5 at 48″ o.c.\n#6 at 48″ o.c.\n#7 at 48″ o.c.\n8-8 #6 at 48″ o.c.\n#7 at 48″ o.c.\n#8 at 48″ o.c.\n9-4 4-0 (or less) #4 at 48″ o.c.\n#4 at 48″ o.c.\n#4 at 48″ o.c.\n5-0 #4 at 48″ o.c.\n#4 at 48″ o.c.\n#5 at 48″ o.c.\n6-0 #4 at 48″ o.c.\n#5 at 48″ o.c.\n#6 at 48″ o.c.\n7-0 #5 at 48″ o.c.\n#6 at 48″ o.c.\n#7 at 48″ o.c.\n8-0 #6 at 48″ o.c.\n#7 at 48″ o.c.\n#8 at 48″ o.c.\n9-4 #7 at 48″ o.c.\n#8 at 48″ o.c. [...] 5-0 #4 at 56″ o.c.\n#4 at 56″ o.c.\n#4 at 56″ o.c.\n6-0 #4 at 56″ o.c.\n#4 at 56″ o.c.\n#5 at 56″ o.c.\n7-0 #4 at 56″ o.c.\n#5 at 56″ o.c.\n#6 at 56″ o.c.\n8-8 #5 at 56″ o.c.\n#7 at 56″ o.c.\n#8 at 56″ o.c.\n9-4 4-0 (or less) #4 at 56″ o.c.\n#4 at 56″ o.c.\n#4 at 56″ o.c.\n5-0 #4 at 56″ o.c.\n#4 at 56″ o.c.\n#4 at 56″ o.c.\n6-0 #4 at 56″ o.c.\n#5 at 56″ o.c.\n#5 at 56″ o.c.\n7-0 #4 at 56″ o.c.\n#5 at 56″ o.c.\n#6 at 56″ o.c.\n8-0 #5 at 56″ o.c.\n#6 at 56″ o.c.\n#7 at 56″ o.c.\n9-4 #6 at 56″ o.c.\n#7 at 56″ o.c.",
        "score": 0.105367124,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ibc-solar",
    "product": "IBC RailFix",
    "candidates": [
      {
        "url": "http://ust.su/upload/iblock/519/Radiant%20product%20catalogue.pdf",
        "title": "[PDF] radiant",
        "snippet": "For shingle roof mounting system. Flashing attachment is an all-in-one waterproof flashing and mount to anchor photovoltaic racking systems, solar thermal.",
        "score": 0.05886858,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.worldradiohistory.com/Archive-Monitoring-TImes/2000s/Monitoring-Times-2008-06.pdf",
        "title": "[PDF] Also in this issue: - World Radio History",
        "snippet": "Disclaimer: While Monitoring Times makes an effort to ensure the information it publishes is accurate, it cannot be held liable for the.",
        "score": 0.01981188,
        "bucket": "datasheets"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_IBC_TopFix200_EN_V_19_01.pdf",
        "title": "[PDF] Installation manual - IBC SOLAR Fachpartnerportal",
        "snippet": "agent  Lint-free paper towels  Cleaning fleece for badly contaminated roofs 40 Version 19.02, as of: 05-Apr-2019  The listed tools and auxiliary agents are required exclusively for installation and processing of the trapezoidal sheet metal panels. Information about tools for module and carrier rail mounting is provided in section 1 in these installation instructions. 4.9.3 Dimensioning The mounting system is dimensioned in our very own PV Manager software, taking into account local [...] for correct fit and material compatibility. Please also take into account the manufacturer's specifications for the corresponding roofing, as well as the specifications of the corresponding general building approval Z-14.4-560! Figure 107: Kalzip® clamp with universal connector 62 Version 19.02, as of: 05-Apr-2019 05. Fitting carrier rails  Insert the pre-assembled securing screw (M10 connection piece for roof hook profile) through the roof hook slot. Rotate by 90° and insert into the mounting [...] atmospheric conditions (corrosivity categories C1-C3 according to EN ISO 12944-2 and surrounding temperatures of -30°C to +50°C). Take additional, suitable anti-corrosion protection measures in the event of other assembly locations (e.g. contact with grit, direct vicinity to the coast, acidic or alkaline environments). The maximum allowed roof inclination for the mounting system is 75°. It is limited by the permissible inclination of the modules. Modifications that are not permitted and",
        "score": 0.69968605,
        "bucket": "installation"
      },
      {
        "url": "https://www.gelia.se/external-assets/Documents/36/95/AssetDocument60853695.pdf",
        "title": "[PDF] Installation guide - Gelia",
        "snippet": "the installation instructions of the IBC mounting products. Please do not damage the modules whilst doing this and ensure a proper connection between clamp and module. ▪ Only use corrosion-free screws, nuts and washers during assembly. ▪ Sufficient lightning protection is recommended, particularly on exposed sites. Integration into any existing lightning protection must follow the relevant guidelines. ▪ Only mount solar modules upright with the socket facing upwards or transversely. ▪ On the [...] foreign objects or structural elements, particularly if the module is mechanically loaded. ▪ IBC SOLAR AG permits several different assembly procedures. For detailed information on the permitted assembly procedures with the permitted clamping areas, please refer to the diagrams on page 14! ▪ When using the assembly holes, please make sure that you use the assembly holes in the clamping areas as standard. Assembly holes outside the clamping areas are for attaching additional items e.g. when [...] there is high snow loads. ▪ If you want to use assembly procedures that are not described in the diagrams please contact IBC SOLAR AG for approval. Otherwise your guarantee and module certification will become invalid. ▪ Alongside the instructions in the installation manual, please always follow the installation instructions from the elevated installation manufacturer. In cases where the instructions from this manufacturer are stricter than the ones in this installation manual, they take",
        "score": 0.6747586,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_AeroFix-AeroFlat_EN_V_19_01.pdf",
        "title": "[PDF] Installation instructions - IBC AeroFix / AeroFlat",
        "snippet": "friction measureing device (in the planning phase) 3. General information, standards and regulations The IBC AeroFix / AeroFlat flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or base rails using clamps. The number of parts varies depending on installation size.. Important information:  Your IBC AeroFix / AeroFlat flat roof system will be delivered complete with all accessories!  Before you begin, please check that all [...] load on the modules is exceed in corner clamping. The snow load rail is inserted in the mountuing supports and is fixed with clips on the module. The clips do not replace the module clamp. The installation instructions and maximum allowed loads of the respective solar module manufacturers must be exactly kept. Fig. 44 Snow load rail in the \"support bottom\" Fig. 45 Snow load rail in the \"support top\" 35 Version 19.01, 21-Jun-2019 Important information: The snow load rail can only be installed [...] still have questions after reading them, please contact your IBC partner, who will be happy to assist you. We wish you a sunny day! Your team IBC SOLAR AG 4 Version 19.01, 21-Jun-2019 2. Tool list  Cordless screwdriver with various bits (Torx 40, SW8 socket, SW15 socket,...)  Bit holder 300 mm  Pencil  Tape measure  Folding rule  Plumb line  Angle grinder with diamond grinding wheel  Torx screwdriver with T-handle, size TX40  Torque wrench  Assembly gloves  Assembling jig  Static",
        "score": 0.65252984,
        "bucket": "installation"
      },
      {
        "url": "https://cdn.exiteme.com/exitetogo/www.neosolar-ng.com/userfiles/files/2004200013_IBC%20MonoSol%20310%20VL4_installation%20manual_EN.pdf",
        "title": "[PDF] Installation guide",
        "snippet": "the valid IBC AeroFix installation manual. Module type Long side Short side AeroFix AeroFix+ IBC Snow Load Rail G2 AeroFix+ 3´rd IBC AeroFix mounting rail PolySol MS 1650x992x40 permitted (max 5400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) PolySol GX/GX4 1654x989x40 permitted (max 5400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) permitted (max 2400Pa) PolySol CS5 1956x992x40 permitted (max 5400Pa) permitted (max [...] loads should be calculated separately. If necessary, measures should be taken to prevent damage. Max. 5,4 kN/m²  The solar modules can be attached using clamps or alternatively directly on the assembly holes (position of assembly holes as shown on data sheet). If using assembly clamps, a surface pressure of 8.5−9.5 N/mm² must be maintained. We recommend using a clamp with 80 mm × 8 mm contact surface (IBC mounting clamp). The clamp screws (M8 A2-70) should be tightened to approx. 15 Nm. Please [...] clamping areas, please refer to the diagrams on page 14!  When using the assembly holes, please make sure that you use the assembly holes in the clamping areas as standard. Assembly holes outside the clamping areas are for attaching additional items e.g. when there is high snow loads.  If you want to use assembly procedures that are not described in the diagrams please contact IBC SOLAR AG for approval. Otherwise your guarantee and module certification will become invalid.  Alongside the",
        "score": 0.6388584,
        "bucket": "installation"
      },
      {
        "url": "https://www.e-nummersok.se/infoDocs/MAN/MAN_34887_5288922.pdf",
        "title": "[PDF] IBC AeroFix G3",
        "snippet": "in the version valid at the time of assembly that you received from your IBC SOLAR trade partner. Guarantee assumes assembly is in accordance with applicable assembly instructions. We reserve the right to make modifications which will improve our product.  For building height >35 m, project-specific testing and ballasting by IBC is required!  Regular weight mounting system including module (20 kg), without additional ballast  If the edge distance is <0.6m, the ballast may increase. 13 Version [...] measureing device (in the planning phase) 3. General information, standards and regulations The IBC AeroFix G3 flat roof system is for mounting solar modules onto flat roofs and pitched roofs. The modules are attached on supports or base rails using clamps. The number of parts varies depending on installation size.. Important information:  Your IBC AeroFix G3 flat roof system will be delivered complete with all accessories!  Before you begin, please check that all parts are included by using [...] Version 21.01, 25-Aug-2021  We advise the use of gloves to avoid injuries.  During the entire assembly time, it must be ensured that at least one copy of the current installation manual is available on the construction site. Other important information and dimensioning standards The entire PV system must be mounted according to the generally recognised technical regulations. Please ensure that you observe the accident prevention regulations of the German employer‘s liability insurance",
        "score": 0.61779,
        "bucket": "installation"
      },
      {
        "url": "https://www.rehau.com/downloads/497804/radiantheatingsystemsdesignguide-855601-rehau.pdf",
        "title": "[PDF] rehau radiant heating systems - design guide",
        "snippet": "4.7.4 Pipe Rails. RAILFIX™ Rails allow for rapid installation by securing the pipe prior to pouring the slab or overpour in a wet construction method. The.",
        "score": 0.42076674,
        "bucket": "installation"
      },
      {
        "url": "https://enphase.com/sites/default/files/2021-05/USVI-RA5RooftopSolarPanelAttachment_finalv3_508.pdf",
        "title": "[PDF] USVI-RA5 Rooftop Solar Panel Attachment - Enphase",
        "snippet": "addresses seismic issues. UL Standard for Flat-Plate Photovoltaic Modules and Panels (UL 1703 2002): This Standard primarily addresses issues other than wind; however, it does address uplift resistance of PV panels. It is referenced in the 2015 and 2018 editions of the IBC. UL Standard for Mounting Systems, Mounting Devises, Clamping/Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels (UL 2703, 2015): This standard primarily addresses wind uplift and other [...] issues associated with PV panel mounting systems. It is referenced in the 2015 and 2018 editions of the IBC. FM Global Approval Standard for Roof-Mounted Rigid Photovoltaic Module Systems (FM 4478, 2016): This document requires laboratory uplift testing of the PV system; however, the test method does not evaluate a system's resistance to long duration dynamic loading (such as induced by hurricanes). FM 4478 requires the installation to be in accordance with FM Global Property Loss Prevention [...] (ICC). 2012. Acceptance Criteria for Modular Framing Systems Used to Support Photovoltaic (PV) Modules. ICC AC 428.  International Code Council (ICC). 2018. 2018 IBC: International Building Code. ICC IBC.  International Code Council (ICC). 2018. 2018 IBC: International Residential Code. ICC IRC.  National Roofing Contractors Association. 2018. NRCA Guidelines for Rooftop-Mounted Photovoltaic Systems, Edition 2.  Structural Engineers Association of California. 2012. Structural Seismic",
        "score": 0.3659556,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty_IBC_SOLAR_AeroFix_TopFix200.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "Term of Warranty The term of warranty (”Warranty Period“) given to the Customer by IBC for the assembly systems IBC AeroFix or TopFix 200, as applicable, shall be 10 years and commences with the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts latest six (6) months after delivery by IBC to their buyer. Warranty conditions and warranty For the duration of the Warranty Period, IBC guarantees Customer that each of the assembly [...] Version 17.01, last update: July 2017 1 IBC AeroFix / TopFix 200 IBC SOLAR AG, Am Hochgericht 10, 96231 Bad Staffelstein, Germany Tel. +49 (0)9573/ 92 24 0; Fax +49 (0)9573/ 92 24 111 hereinafter referred to as “IBC”, provides for each of the assembly systems IBC AeroFix and TopFix 200 the following worldwide product warranty (“Warranty”): Product warranty The legal rights of rectification, withdrawal, reduction or compensation in the event of defects in the assembly system IBC AeroFix or TopFix [...] Warranty Claims The entity entitled to warranty must submit a warranty claim to the respective retailer or installer of the assembly systems IBC AeroFix or TopFix 200, as the case may be, and enclose the original invoice to identify the delivery date immediately after discovering the warranty case, however, at the latest three months after the entity entitled to warranty has become aware of the facts that justify a warranty claim or if the entity did not become aware of the facts due to gross",
        "score": 0.77650476,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty-IBC-Solar-modules-EU_EN.pdf",
        "title": "[PDF] Warranty Statement - ibc solar",
        "snippet": "As of: 15. October 2024 Page 1 from 5 Warranty Statement (Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Ice-land, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, Turkey, Ukraine, Vatican City, Belarus and also Japan) IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein, Germany P +49 (0)9573/92 24 0 F +49 (0)9573/92 24 111 (hereinafter referred to as ´IBC SOLAR´) as the [...] SOLAR. As of: 15. October 2024 Page 2 from 5 3. Product Warranty IBC SOLAR grants a Product Warranty for quality in material and processing of the Module. For glass foil modules (Example: IBC MonoSol xxx MS10-HC-N): In the event a defect due to material or manufacturing fault(s) occurs within the first fifteen (15) years and that certain defect impairs Module's functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. [...] time of the warranty event. Only the Beneficiary shall be entitled to assert any warranty event. That Warranty applies to a Module IBC SOLAR delivered as from January 1st, 2024, until the concerned Module forms part of the photovoltaic system in which it had been initially installed. Any Module that was removed and reinstalled is not covered by that Warranty, unless it was removed and reinstalled as part of repair work (in terms of section 5.). Note: This Warranty excludes the junction box",
        "score": 0.767638,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/IBC_Systemwarranty_EN.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "components in the system shall be 15 years („Term of Warranty“) and commences from the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts at the latest six (6) months after delivery by IBC to its buyer. Scope Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Iceland, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, [...] page 1 of 5 TERMS AND CONDITION OF WARRANTY (Version 1.10 / Last Update: July 2025) System consisting of IBC AeroFix / IBC AeroFlat / IBC TopFix 200 / IBC WallFix mounting systems and IBC Module / IBC MonoSol solar modules. Guarantor: IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0)9573/ 92 24 0 Fax +49 (0)9573/ 92 24 111 hereinafter referred to as „IBC“. A. General warranty conditions Beneficiary IBC provides the end customer (hereinafter „Customer“) a non-transferable [...] the solar modules used in the system Product Warranty IBC SOLAR grants a Product Warranty for the quality in material and processing of the Module. In the event a defect due to material or manufacturing faul(s) occurs within the first fifteen (15) years and that certain defect impairs Module’s functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. (“Product Warranty Event”), IBC SOLAR will rectify that certain",
        "score": 0.76173395,
        "bucket": "other"
      },
      {
        "url": "https://www.theboilerguys.com/wp-content/uploads/2019/02/T-Series-Warranty.pdf",
        "title": "[PDF] T SERIES IBC Technologies LIMITED WARRANTY INFORMATION ...",
        "snippet": "Page 1 WARRANTY STATEMENT - T SERIES IBC Technologies LIMITED WARRANTY INFORMATION IBC warranty obligations are limited to the terms set forth below: IBC warrants to the original purchaser that this product will be free of manufacturing defects in material and workmanship for a period of one (1) year from the original purchase date, or eighteen (18) months from IBC’s original invoice, whichever expires first. The original purchase date as used herein shall mean the date stated in the vendor’s [...] the product fail to perform according to the specifications set forth by IBC during the warranty period, IBC will repair or replace, free of charge, the products that it finds defective. If you wish to make a warranty claim, please complete this form. Incomplete forms will not be processed. To make multiple claims, please fill out one form for each individual unit. Name: Company: Address: Telephone: Fax: Product Information: Model Name: Comments: Serial Number: (indicate source/symptoms of [...] this product. This limited warranty shall not extend to anyone other than the original purchaser of the product. MAKING A WARRANTY CLAIM To file a claim under this warranty, the purchaser must do the following during the warranty period: Before returning the product to IBC for warranty service, the purchaser must complete the Warranty Claims Form (attached) and fax it to IBC USA at (920) 783-8340 or CANADA at (604)877-0295). Upon preliminary assessment of the claim, IBC will send the purchaser",
        "score": 0.65412235,
        "bucket": "other"
      },
      {
        "url": "https://www.ibcboiler.com/wp-content/uploads/warranty/IBC-Warranty-HC-DC.pdf",
        "title": "[PDF] 10 YEAR LIMITED WARRANTY – HC & DC SERIES BOILERS",
        "snippet": "Legal Rights No other party is authorized to make any other warranties on IBC’s behalf. No other warranty expressed or implied (including warranty of merchantability and warranty of fitness for a particular purpose) is made. This warranty does not extend to liability for incidentals, special or consequential damage. All disputes, claims or demands arising from or relating to the Warranty, or from the terms and conditions herein contained and all claims, demands, rights or liabilities arising [...] “FIVE YEAR LIMITED WARRANTY – All Parts” Within five years of the original installation of the boiler and registration of the installation with IBC; the Five Year Limited Warranty covers repair or replacement of all parts found to suffer from manufacturing defect.\nPage 1 of 2 1. [...] Procedure for Warranty Service For warranty service, have your licenced service contractor contact an IBC-authorized distributor with the following information: model and serial numbers, site address and date of installation together with a description of the claim. All alleged defective parts must be returned through authorized trade channels and replacement parts will if warranty conditions are met, will be provided by IBC through such authorized wholesaler or relevant representative. No",
        "score": 0.6219319,
        "bucket": "other"
      },
      {
        "url": "https://www.iccsafe.org/wp-content/uploads/2022-IBC-Structural.pdf",
        "title": "[PDF] 2022-IBC-Structural.pdf - International Code Council",
        "snippet": "metal or plastic caps. Metal caps shall have a thickness of not less than 32-gage sheet metal. Power-driven metal caps shall have a minimum thickness of 0.010 inch. Minimum thickness of the outside edge of plastic caps shall be 0.035 inch. The cap nail shank shall be not less than 0.083 inch. The cap nail shank shall have a length sufficient to penetrate through the roof sheathing or not less than / inch into the roof sheathing.Self-adhering polymer modified bitumen underlayment shall be [...] and do not have spaces nor gaps or are not perforated to drain, they shall be sloped to drain. [...] a test may be viewed at .",
        "score": 0.32739994,
        "bucket": "other"
      },
      {
        "url": "https://www.energy.gov/sites/default/files/2021-09/Solar%20Futures%20Study.pdf",
        "title": "[PDF] Solar Futures Study - Department of Energy",
        "snippet": "conditioning IAS integrated agricultural systems IBC interdigitated back contact IBR inverter-based resource IEA International Energy Agency ILR inverter-loading ratio IRP integrated resource planning IT information technology ITRPV International Technology Roadmap for Photovoltaics LCA life cycle analysis LCOE levelized cost of energy LCOS levelized cost of storage LDV light-duty vehicle Li-ion lithium-ion LMI low- and medium-income MDV medium-duty vehicle MISO Midcontinent Independent System [...] grid dominated by IBRs will require new approaches to maintain system reliability and exploit the ability of IBRs to respond quickly to system changes. New approaches may also be required for high-solar grids to maintain resilience (defined as the ability of grids to respond to critical events such as natural disasters). Small-scale solar, especially coupled with storage, can enhance resilience by allowing buildings or microgrids to power critical loads during grid outages. In addition, [...] electricity end uses in buildings, industry, and—increasingly—transportation. Solar is also uniquely diurnal: it relies on daily and seasonal patterns of the rising and setting sun. Although the daily (e.g., related to cloud cover) and seasonal variability of solar poses challenges, the reliably diurnal nature of this variability means that grid operations and electricity demand can be proactively managed to maximize use of low-cost, zero-carbon solar energy. 3 Unless otherwise noted, all",
        "score": 0.11347172,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ibc-solar",
    "product": "IBC Universal",
    "candidates": [
      {
        "url": "https://www.ibc-solar.se/fileadmin/redaktion/za/PV_Installers/Datasheets/EN-Datasheet_global-IBC_MonoSol_300_ZX4.pdf",
        "title": "[PDF] EEEASILY - IBC Solar",
        "snippet": "TECHNICAL DATA. Operating conditions: Max. System Voltage (V). 1000. Application Class. A. Reverse Current Ir (A). 15. Current value string fuse (A). 15. Fuse",
        "score": 0.7493996,
        "bucket": "datasheets"
      },
      {
        "url": "https://assets.ctfassets.net/9pi13bto1z9e/NT2m4VvrkLv4SZmqHBxQR/09ed2933f83257582f13788973cb0041/121009-Maysun_IBC_MS_430W_BC-54HB.pdf",
        "title": "[PDF] 22.8% 0 ~ +5W",
        "snippet": "Higher conversion efficiency generation.\nBetter appearance Low temperature coefficient IBC solar panels feature a low temperature coefficient, which allows for better performance in hot climates. [...] Mono IBC 182mm 108 Cells MS(410-440)BC-54HB Full Black On-grid residential 410/415/420/425/430/435/440WP MAYSUNSOLAR. COM APPLICATIONS >> roof-tops On-grid commercial/ industrial roof-tops Advanced Solar Technology IBC - Full Black The most advanced technology The most advanced technology for mass-produced photovoltaic modules,cell technology is far advanced The short circuit current density of IBC cells is 5-8% higher than that of ordinary cells. No bus bars on the front to reduce optical loss [...] There is no bus bars on the front, tight cell layout, overall unity, making a beautiful and elegant appearance. MAXIMUM EFFICIENCY 22.8% POSITIVE POWER TOLERANCE 0 ~ +5W 100% — 98.5% 80% 90% — — 70% 1 5 10 15 20 25 88.9% 80% Standard Performance Warranty IBC PV modules have a wider application scenario and are especially suitable for building More application scenarios applied PV. Higher reliability Compared to PV modules made by front welding, the reliability and stability of IBC modules are",
        "score": 0.62358373,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.iccsafe.org/wp-content/uploads/2022-IBC-Structural.pdf",
        "title": "[PDF] 2022-IBC-Structural.pdf - International Code Council",
        "snippet": "ASTM D8257 ASTM D1970 Wood shakes R905.8 ASTM D226 Type I or II ASTM D4869 Type I, II, III or IV ASTM D8257 ASTM D1970 ASTM D226 Type II ASTM D4869 Type III or IV ASTM D8257 ASTM D1970 Metal panels R905.10 Manufacturer’s instructions ASTM D226 Type II ASTM D4869 Type III or IV ASTM D8257 ASTM D1970 Photovoltaic shingles R905.16 ASTM D4869 Type I, II, III or IV ASTM D6757 ASTM D8257 ASTM D1970 ASTM D4869 Type III or IV ASTM D8257 ASTM D1970 For SI: 1 mile per hour = 0.447 m/s. TABLE R905.1.1(2) [...] metal or plastic caps. Metal caps shall have a thickness of not less than 32-gage sheet metal. Power-driven metal caps shall have a minimum thickness of 0.010 inch. Minimum thickness of the outside edge of plastic caps shall be 0.035 inch. The cap nail shank shall be not less than 0.083 inch. The cap nail shank shall have a length sufficient to penetrate through the roof sheathing or not less than / inch into the roof sheathing.Self-adhering polymer modified bitumen underlayment shall be [...] For SI: 1 ounce per square foot = 0.305 kg/m , 1 pound per square foot = 4.882 kg/m , 1 inch = 25.4 mm, 1 pound = 0.454 kg.",
        "score": 0.46614134,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.iccsafe.org/wp-content/uploads/Energy-Storage-Systems-Book_FINAL.pdf",
        "title": "[PDF] ENERGY STORAGE SYSTEMS - International Code Council",
        "snippet": "and performance-related provisions. It is founded on broad-based principles that make possible the use of new materials and new building designs. The IBC is available for adoption and use by jurisdictions internationally. Its use within a governmental jurisdiction is intended to be accomplished through adoption by reference, in accordance with proceed­ ings established by the jurisdiction’s laws. [...] IBC is kept up to date through the open code develop­ ment process of the International Code Council® (ICC®). The provisions of the 2018 edition, along with those code changes approved in the most recent code development cycle, make up the 2021 edition. The International Code Council (ICC), publisher of the IBC, was established in 1994 and is a nonprofit association that provides a wide range of building safety solutions including product evaluation, accreditation, certification, codification [...] and training. The ICC develops model codes and standards used worldwide to construct safe, sustainable, affordable and resilient structures. The ICC’s mission is to provide the highest-quality codes, standards, products and services for all concerned with the safety and performance of the built envi­ ronment. The IBC is one of 15 International Codes® (I-Codes®) published by the ICC. This compre­ hensive building code establishes minimum regulations for building systems through pre­ scriptive",
        "score": 0.40528452,
        "bucket": "datasheets"
      },
      {
        "url": "https://static.longi.com/Back_Contact_BC_Solar_Technology_Development_White_Paper_ff1a12170f.pdf",
        "title": "[PDF] Back Contact(BC) Solar Technology Development White Paper - Longi",
        "snippet": "Apart from high eﬃciency, having both polarity contacts on the rear allows other features that contribute to improved ﬁeld performance from IBC technology. One is a controlled reverse breakdown voltage that limits the power dissipation in the cell if it becomes reverse biassed, preventing thermal failure of the cell or of its surrounding encapsulation. Also the direct back-to-back interconnection of IBC cells increases reliability since avoiding issues with the traditional front-to-back [...] High eﬃciency, however, is the feature that I believe will make IBC the dominant photovoltaic technology within the next 5 years. IBC has a clear eﬃciency advantage over TOPCon in short-circuit current (Isc), by avoiding top surface contact shading, in open-circuit voltage (Voc) by replacing the B-diﬀused top contact by either a HJT or TOPCon p-type passivated contact, and in ﬁll factor (FF) by this higher voltage giving the ability to access Auger-enhanced values [Ⅴ]. The advantage over HJT is [...] Recommendation Preface Dr. Christos Monokroussos Global Segment Coordinator for Solar of TÜV Rheinland Group “ Solar cells with both polarity contacts on the back, now almost universally known as interdigitated back contact (IBC) cells, have a much longer history than any of the other contending silicon (Si) technologies. White and Schwartz [Ⅰ] are credited with ﬁrst suggesting the IBC approach for Ge p-i-n diodes in 1964 for use in thermophotovoltaics. Lambert and Schwartz [Ⅱ] reported the",
        "score": 0.38186535,
        "bucket": "datasheets"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_IBC_TopFix200_EN_V_19_01.pdf",
        "title": "[PDF] Installation manual - IBC SOLAR Fachpartnerportal",
        "snippet": "Figure 57: Mounting plate duo with connecting element RH-profile 39 Version 19.02, as of: 05-Apr-2019 4.9 Mounting with trapezoidal sheet metal clamps 4.9.1 Introduction IBC SOLAR AG trapezoidal sheet metal mounting systems in combination with the IBC TopFix 200 mounting system is a fast, universal and structurally tested solution for attaching solar modules onto trapezoidal sheet metal roofs. It will be secured either by rivets or self drilling screws. Please note:  The minimum trapezoidal [...] a RH-profile connecting element is required in accordance with Figure 57. For fixing the profiles TF50+ and TF50m, on the other hand, a universal connector and additional screws for fixing the universal connector are required in accordance with Figure 56. The mounting plate duo can be used for trapezoidal sheet or corrugated eternit roof coverings. The maximum high-beading space must be 330 mm. Component length mounting plate duo: 370 mm Figure 56: Mounting plate Duo with universal connector [...] > 10 Pre-drilling diameter [mm] 6.8 7 7.2 7.4 Figure 55: Steel substructure pre-drilling diameter  Screw the solar fastener into the steel substructure to safeguard it demonstrates secure static properties.  Tighten the lower nut on the machine thread to press the rubber seal against the outer roofing, thus sealing the hole.  Carefully press down the seal. Risk of cracks and deformation!  For stress reasons, the universal connector must always be mounted in the direction of the roof ridge.",
        "score": 0.75464433,
        "bucket": "installation"
      },
      {
        "url": "https://shop.ibc-solar.com/userdata/files/files/Installation_manual_AeroFix-AeroFlat_EN_V_19_01.pdf",
        "title": "[PDF] Installation instructions - IBC AeroFix / AeroFlat",
        "snippet": "guarantee conditions are stated in the guarantee document.  We advise the use of gloves to avoid injuries.  During the entire assembly time, it must be ensured that at least one copy of the current installation manual is available on the construction site. Other important information and dimensioning standards The entire PV system must be mounted according to the generally recognised technical regulations. Please ensure that you observe the accident prevention regulations of the German [...] 13.2. Maintenance instructions The IBC AeroFix / AeroFlat mounting system is largely maintenance-free thanks to the materials used. In addition to the electrical inspections prescribed for the entire PV system, we recommend an annual and event-dependent (heavy storm, hail etc.) inspections of the mounting system into account the points of the maintenance log. Disassemly of the mounting system is carried out in the reverse order of assemly steps. If it becomes necessary to clean the modules, [...] 1630-1700 1630-1700 1630-1700 1500-2100 Weight (kg/m²) 7 8 11 11 Linear load (kg/m)  13 14 18 18 Center-to-center distance (m) 1.8 1.6 2.3 2 x Module width + 0,27 Minimum module field size zone H zone F and G none 2x3 or 3x2 none 2x3 or 3x2 none 2x3 or 3x2 none 2x3 or 3x2 Maximum layout (thermal separation) 15 x 15 15 x 15 14 x 15 14 x 14 Minimum distance to roof edge (m) no no no 0,3 Material Aluminium stainless steel Aluminium stainless steel Aluminium stainless steel Aluminium stainless",
        "score": 0.6549173,
        "bucket": "installation"
      },
      {
        "url": "https://www.e-nummersok.se/infoDocs/MAN/MAN_34887_5288922.pdf",
        "title": "[PDF] IBC AeroFix G3",
        "snippet": "installation. If you still have questions after reading them, please contact your IBC partner, who will be happy to assist you. We wish you a sunny day! Your team IBC SOLAR AG 4 Version 21.01, 25-Aug-2021 2. Tool list  Cordless screwdriver with various bits (Torx 40, SW10 socket)  Pencil  Tape measure  Folding rule  Plumb line  Angle grinder with diamond grinding wheel  Torx screwdriver with T-handle, size SW10, TX40  Torque wrench  Assembly gloves  Assembling jig  Static friction [...] Version 21.01, 25-Aug-2021  We advise the use of gloves to avoid injuries.  During the entire assembly time, it must be ensured that at least one copy of the current installation manual is available on the construction site. Other important information and dimensioning standards The entire PV system must be mounted according to the generally recognised technical regulations. Please ensure that you observe the accident prevention regulations of the German employer‘s liability insurance [...] module size (m) 2,3 / 2,4 / 2,55 2,35 / 2,45 / 2,6 3,4 / 3,5 / 3,6 / 3,7 / 3,8 / 3,9 / 4,0 / 4,1 / 4,2 / 4,3 / 4,4 / 4,5 Minimum module field size (Module) 2x3 oder 3x2 Maximum layout (m) (thermal separation) 20 x 20 Minimum distance to roof edge (m) none Material Aluminium, stainless steel, rubber-granulate Max. building height (m)  35 Approx. space reqirement m²/kWp (1,775 m x 1,038 m Modul) 5,5 5,6 5,6 Tab. 2 Technical data Product guarantee in accordance with complete guarantee conditions",
        "score": 0.6533265,
        "bucket": "installation"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty_IBC_SOLAR_AeroFix_TopFix200.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "Version 17.01, last update: July 2017 1 IBC AeroFix / TopFix 200 IBC SOLAR AG, Am Hochgericht 10, 96231 Bad Staffelstein, Germany Tel. +49 (0)9573/ 92 24 0; Fax +49 (0)9573/ 92 24 111 hereinafter referred to as “IBC”, provides for each of the assembly systems IBC AeroFix and TopFix 200 the following worldwide product warranty (“Warranty”): Product warranty The legal rights of rectification, withdrawal, reduction or compensation in the event of defects in the assembly system IBC AeroFix or TopFix [...] Term of Warranty The term of warranty (”Warranty Period“) given to the Customer by IBC for the assembly systems IBC AeroFix or TopFix 200, as applicable, shall be 10 years and commences with the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts latest six (6) months after delivery by IBC to their buyer. Warranty conditions and warranty For the duration of the Warranty Period, IBC guarantees Customer that each of the assembly [...] The courts of Coburg, Germany shall be the exclusive jurisdiction for all disputes arising of or in connection with this Warranty.",
        "score": 0.784336,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/Warranty-IBC-Solar-modules-EU_EN.pdf",
        "title": "[PDF] Warranty Statement - ibc solar",
        "snippet": "As of: 15. October 2024 Page 1 from 5 Warranty Statement (Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Ice-land, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, Turkey, Ukraine, Vatican City, Belarus and also Japan) IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein, Germany P +49 (0)9573/92 24 0 F +49 (0)9573/92 24 111 (hereinafter referred to as ´IBC SOLAR´) as the [...] SOLAR. As of: 15. October 2024 Page 2 from 5 3. Product Warranty IBC SOLAR grants a Product Warranty for quality in material and processing of the Module. For glass foil modules (Example: IBC MonoSol xxx MS10-HC-N): In the event a defect due to material or manufacturing fault(s) occurs within the first fifteen (15) years and that certain defect impairs Module's functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. [...] time of the warranty event. Only the Beneficiary shall be entitled to assert any warranty event. That Warranty applies to a Module IBC SOLAR delivered as from January 1st, 2024, until the concerned Module forms part of the photovoltaic system in which it had been initially installed. Any Module that was removed and reinstalled is not covered by that Warranty, unless it was removed and reinstalled as part of repair work (in terms of section 5.). Note: This Warranty excludes the junction box",
        "score": 0.76279575,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Installers/Products/IBC_Systemwarranty_EN.pdf",
        "title": "[PDF] Terms and conditions of warranty - IBC Solar",
        "snippet": "the solar modules used in the system Product Warranty IBC SOLAR grants a Product Warranty for the quality in material and processing of the Module. In the event a defect due to material or manufacturing faul(s) occurs within the first fifteen (15) years and that certain defect impairs Module’s functionality more than trivial and does not simultaneously constitute claim(s) relating to the Power Warranty as defined in Section 4. (“Product Warranty Event”), IBC SOLAR will rectify that certain [...] components in the system shall be 15 years („Term of Warranty“) and commences from the date of the invoice issued by the installer or seller to the first Customer. In any case, the warranty period starts at the latest six (6) months after delivery by IBC to its buyer. Scope Valid within the EU, Albania, Andorra, Armenia, Azerbaijan, Bosnia and Herzegovina, Georgia, Iceland, Kazakhstan, Kosovo, Liechtenstein, Macedonia, Moldova, Monaco, Montenegro, Norway, San Marino, Switzerland, Serbia, [...] page 1 of 5 TERMS AND CONDITION OF WARRANTY (Version 1.10 / Last Update: July 2025) System consisting of IBC AeroFix / IBC AeroFlat / IBC TopFix 200 / IBC WallFix mounting systems and IBC Module / IBC MonoSol solar modules. Guarantor: IBC SOLAR AG Am Hochgericht 10 96231 Bad Staffelstein Phone +49 (0)9573/ 92 24 0 Fax +49 (0)9573/ 92 24 111 hereinafter referred to as „IBC“. A. General warranty conditions Beneficiary IBC provides the end customer (hereinafter „Customer“) a non-transferable",
        "score": 0.7602419,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Corporate/IBC_SOLAR_GTC.pdf",
        "title": "[PDF] General Terms and Conditions of IBC SOLAR AG",
        "snippet": "have agreed not to deliver as new goods. 8. Liability for damage due to fault 8.1 Costs arising within the scope of subsequent performance, reversal, reimbursement of expenses or other claims for reimbursement of warranty costs, in particular installation and removal costs, test, validation, transport, travel, labour and material costs shall be reimbursed up to a maximum of the total value of the respective underlying order. We shall be liable for claims for damages of any kind, in particular [...] popular uprisings, rebellions, civil wars, sabotage, fires, floods, droughts, monsoons, hurricanes, tornadoes, typhoons, cyclones, lightning, thunderstorms, landslides, land erosion, earthquakes, volcanic activities, famines, explosions, scientifically unexplained phenomena or other natural disasters, epidemic, pandemics, quarantine measures due to epidemic or pandemics, state decrees or measures taken by a public authority/a state or any prohibitions, operational disruptions of any kind, [...] products and twelve (12) months for all other products, with this period commencing on delivery of the goods or, if acceptance is required, on acceptance. This shall not apply to goods that have been used for a building structure in accordance with their normal use and which use caused its defectiveness; in this case, the limitation period shall not commence until five (5) years after delivery. 7.9 The Customer shall not be entitled to the aforementioned claims in relation to goods which we",
        "score": 0.6643884,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.com/fileadmin/redaktion/int/Corporate/Press/Downloads/IBC-SOLAR-Company-Profile-EN.pdf",
        "title": "[PDF] IBC SOLAR Company Profile (PDF)",
        "snippet": "The company IBC SOLAR is a leading full-service provider of energy solutions and services in the field of photovoltaics and storage. The company offers complete photovoltaic systems and covers the entire product range from planning to the turnkey handover of photovoltaic systems. IBC SOLAR was founded in 1982 in Bad Staffelstein by physicist and entrepreneur Udo Möhrstedt and is now a pioneer of the energy revolution, with regional companies and sales offices worldwide. The Group currently has [...] around 500 employees. Active in three market segments To date, IBC SOLAR has implemented photovoltaic systems worldwide with a total capacity of more than 11 gigawatts. The range includes energy solutions in the three market segments of Residential, Commercial & Industrial as well as Solar Parks. IBC SOLAR works closely with a network of Premium Partners who ensure the competent and high-quality installation of the systems. Successful in the distribution and project business fields With its [...] of complete systems in which components can be smartly controlled and coordinated. IBC SOLAR not only installs products from well-known manufacturers, but also provides its own high-performance, high-quality solutions. In the project field, the company develops, implements and markets turnkey energy solutions worldwide. These solutions range from large photovoltaic systems for commercial and industrial customers to solar parks in the megawatt field, which are transferred directly to plant",
        "score": 0.6396691,
        "bucket": "other"
      },
      {
        "url": "https://www.ibc-solar.co.za/fileadmin/redaktion/za/PV_Installers/Documents/Installation_manual_IBC_TopFix200_EN_V_15_02.pdf",
        "title": "[PDF] Installation manual",
        "snippet": "Version 15.02, as of: 07/21/2015 4.9 Mounting with trapezoidal sheet metal clamps 4.9.1 Introduction IBC SOLAR AG trapezoidal sheet metal mounting in combination with the IBC TopFix 200 mounting system is a fast, universal and structurally tested solution for attaching solar modules onto trapezoidal sheet metal roofs. Please note: \u0001 The minimum trapezoidal sheet metal or aluminium thickness must be 0.5 mm. \u0001 The enclosed special 4.8×15 blind rivets with flat, round head are certified for a [...] sheet metal thickness of between 0.5 mm and 1.9 mm. \u0001 Do not fall below the raised bead support width of 15 mm. \u0001 The maximum width b of the raised bead must not exceed 40 mm. \u0001 Because additional loads are created by the PV system in connection with the IBC mounting system and fixing points (fixed-points) and wind suction, the installer (contractor) has to check the statics of the load capacity of the roofing and the substructure, which normally requires the services of a structural engineer. [...] the required length of the solar fastener to the height of the roof structure. Use IBC SOLAR AG's very own \"PV Manager\" planning software to ensure you select the right solar fastener. Please note: Comply with the following requirements regarding the roof profile type: \u0001 The nominal sheet metal profile panel thickness around the fasteners is ≥ 0.4 mm for steel and ≥ 0.5 mm for aluminium. \u0001 The nominal width of the outer layer of the sandwich element around the fasteners is ≥ 0.4 mm. \u0001 The",
        "score": 0.5843666,
        "bucket": "other"
      },
      {
        "url": "https://www.ibcboiler.com/wp-content/uploads/warranty/IBC-Warranty-T-Series.pdf",
        "title": "[PDF] LIMITED WARRANTY",
        "snippet": "Damages to the product that occur during shipment. 4. Damages caused by improper or faulty installation. 5. Products exposed to corrosive elements harmful to the structural integrity and durability of the product. 6. Products installed outside of Canada and the United States. IBC shall not be liable for any direct, special, incidental, or consequential damages caused by the use, misuse, or inability to use this product. IBC is under no legal obligations to rectify, including but not limited to, [...] (1) year from the original purchase date, or eighteen (18) months from IBC’s original invoice, whichever expires first. The original purchase date as used herein shall mean the date stated in the vendor’s original invoice. IBC will, at its option, repair or replace this product without charge if it is found to be defective during the limited warranty period specified above. If IBC chooses, at its discretion, to replace any product for which there is a valid warranty claim, IBC shall replace the [...] product with the same model or, if such model is not available, with a model which is, in IBC’s reasonable judgment, the nearest compatible model available at the time of replacement. Note that each purchaser is limited to one (1) product replacement during the warranty period of the original claim. NOT UNDER COVERAGE BY THIS WARRANTY This limited warranty covers defects encountered in normal use of the product while operating according to the specifications set forth by IBC. The warranty is",
        "score": 0.5835125,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ja-solar",
    "product": "JAM54S40 440W",
    "candidates": [
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0506/fd0a71ee4bba916.pdf",
        "title": "[PDF] JAM54S40 LR 455W EN",
        "snippet": "The JAM54S40 LR is a 455W n-type half-cell module with 26% efficiency, 108 cells, 15-year warranty, and 0.4% annual degradation over 30 years.",
        "score": 0.5402697,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0328/18240062617b58.pdf",
        "title": "[PDF] JAM54D40 420-445 GB",
        "snippet": "DEEP BLUE 4.0 Pro. Version No. : Global-EN-20240314A. 445W GB. Series. Higher power generation better LCOE n-type with very Lower LID.",
        "score": 0.34733838,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/0129/20190129030921131.pdf",
        "title": "[PDF] JA SOLAR PV MODULES INSTALLATION MANUAL",
        "snippet": "according to these instructions may void the warranty. 5.2.2.1 Modules Installed with Mounting Holes Modules should be bolted to support structures through mounting holes located in the frame’s back flanges. Refer to what is shown in Figure 6 (Mounting Details). Figure 6 Mounting Details For your reference, please use the components specified in below: 1. Bolt 2. Washer Material: Stainless Steel Material: Stainless Steel Size and Length: M816mm Size: M8 3. Spring Washer 4. Nut Material: [...] authority for guidelines and requirements for building or structural fire safety. JA solar modules have been listed as Class A according to IEC 61730-2 standard. For roof installations, modules should be mounted over a fire resistant covering suitable for this application, with adequate ventilation between the modules backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of building. Improper installation may create hazards in the event of a fire. [...] and/or performance of the modules. Please adopt appropriate measures to ensure the performance and safety of the modules when they are installed or operated in the areas where produces heavy snow, extremely cold, strong wind, or near the island or desert where is prone to produce salt fog, or near water. JA Solar modules have passed the IEC 61701 salt-mist, but galvanic corrosion can occur between the aluminum frame of the modules and mounting or grounding hardware if such hardware is comprised",
        "score": 0.7447496,
        "bucket": "installation"
      },
      {
        "url": "https://jasolar.com/uploadfile/2023/1106/20231106044823141.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "JA SOLAR. JA SOLAR PV MODULES INSTALLATION MANUAL. JA SOLAR TECHNOLOGY CO ... JAM54S40 GR Series. +5400/-2400 | +2400/-2400 +5400/-2400. +1600. N/A. +2400.",
        "score": 0.7445268,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1130/20221130100440209.pdf",
        "title": "[PDF] JA Solar MODULE PRODUCT Limited Warranty",
        "snippet": "and in accordance with the JA Solar module installation manual, product technical specifications and ... JAM54S40-XXX/GR/1500V. 410-440.",
        "score": 0.7413937,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0108/8d54f07291ef4fb.pdf",
        "title": "[PDF] JA Solar PV Single-glass Modules Installation Manual",
        "snippet": "+5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM78S30 GRSeries +5400/-2400 +5400/-2400 +5400/-2400 N/A N/A ±2400 JAM54S40 GR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S30 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S40 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S41 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S42 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S43 LR Series [...] types Power range[W] Dimension(LxWxH)[mm] JAM54S30-xxx/MR 390-420 1722 x 1134 x 30 JAM66S30-xxx/MR 480-510 2093 x 1134 x 30 JAM72S30-xXX/MR 525-560 2278 x 1134 x 30 JAM72S30-xxx/LR 560-580 2333 x 1134 x 30 JAM54S30-xxx/LR 420-435 1762 x 1134 x 30 JAM54S40-xxx/LR 420-460 1762 x 1134 x 30 JAM54S41-xxx/LR 420-445 1762 x 1134 x 30 JAM60S40-xxx/LR 475-510 1953 x 1134 x 30 JAM72S40-xxx/LR 560-615 2333 x 1134 x 30 JAM72S42-xxx/LR 600-655 2465 x 1134 x 30 JAM66S42-xxx/MR 550-600 2278 x 1134 x 30 [...] you must know before handling and installing JA Solar modules. This Manual also contains safety information you need to be familiar with. All the information described in this Manual is the intellectual property of JA Solar and is based on the technologies and experience that have been acquired and accumulated by JA Solar. This Manual does not constitute a warranty, expressed or implied. JA Solar does not assume responsibility and expressly disclaims liability for loss, damage, or expense",
        "score": 0.7311551,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0331/049eee3ed8ee930.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This Installation Manual contains essential information for electrical and mechanical installation that you must know before handling,.",
        "score": 0.5996498,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0122/b85ded457befd01.pdf",
        "title": "[PDF] JA Solar PV Bifacial Double-glass Modules Installation Manual",
        "snippet": "This Installation Manual contains essential information for electrical and mechanical installation that you must know before handling and",
        "score": 0.5274388,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0725/70451cc6e284557.pdf",
        "title": "[PDF] JA SOLAR PRODUCT BROCHURE",
        "snippet": "Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) 445 39.10 32.65 14.40 13.63 22.3 450 39.30 32.82 14.48 13.71 22.5 455 39.50 33.00 14.56 13.79 22.8 0~+3% +0.045%/°C -0.250%/°C -0.290%/°C JAM54S40 445/LR JAM54S40 450/LR JAM54S40 455/LR ELECTRICAL PARAMETERS AT STC JAM54S40 n型单玻光伏组件 SUPERIOR WARRANTY n-type Monofacial Module Linear Performance [...] 2.0mm/2.0mm 36pcs/Pallet， 720pcs/40HQ Container 585 52.16 44.22 13.89 13.23 22.6 590 52.37 44.43 13.94 13.28 22.8 595 52.58 44.64 13.99 13.33 23.0 0~+3% +0.046%/°C -0.260%/°C -0.290%/°C TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) [...] 610 48.10 39.77 16.05 15.34 22.6 615 48.30 39.96 16.10 15.39 22.8 620 48.50 40.21 16.13 15.42 23.0 0~+3% +0.045%/°C -0.250%/°C -0.290%/°C TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage",
        "score": 0.7823471,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0108/e4fe503657ec1.pdf",
        "title": "[PDF] JAM54S40 LR 460W EN",
        "snippet": "Current-Voltage Curve JAM54S40-440/LR. -460/LR. Rated Maximum Power(Pmax) [W] ... JA Solar reserves the right of final interpretation. Version No.: Aus-EN",
        "score": 0.7352811,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0807/f93000c02f65796.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "525-560 12 JAM72S30-XXX/LR 560-580 12 JAM54S30-XXX/LR 415-435 12 JAM54S40-XXX/LR 420-450 15 JAM60S40-XXX/LR 475-500 15 JAM72S40-XXX/LR 560-600 12 JAM66D45-XXX/LB 600-610 12 JAM66D42-XXX/MB 580-585 12 JAM72D42-XXX/LB 625-635 12 JAM72D40-XXX/LB 590-595 12 JAM54D40-XXX/LB 440-445 12 JAM54D41-XXX/LB 440 12 JAM72D30-XXX/MB 545 12 JAM72D40-XXX/MB 570-575 12 JAM72D40-XXX/GB 560-580 12 [...] Limited Warranty: 3.1 Limited Product Warranty: Subject to the terms and conditions of this Limited Warranty, JA Solar warrants to the Customer for 1) a period of one hundred and eighty (180) calendar months of JAM54D4X-XXX/MB; JAM54D4X-XXX/GB; JAM54D4X-XXX/LB; JAM54S4X-XXX/LR; JAM54S4X-XXX/MR; JAM60S4X-XXX/LR or 2) a period of one hundred and forty-four (144) calendar months of all other models，the relevant models are listed in Annex (last page of document) Following the Warranty Start Date [...] type mono-crystalline single glass Modules (whose product types are: JAM54S4X-XXX/LR; JAM54S4X-XXX/MR; JAM60S4X-XXX/LR ): the Degradation Rate shall not exceed 1% in the first year beginning from the Warranty Start Date; and an additional 0.4% each year thereafter from the beginning of the second year until that date which is thirty (30) years following the Warranty Start Date; at which time the Peak Power Output shall be not less than 87.4% of the Nominal Power Output; 4) For n type",
        "score": 0.72768575,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518102313951.pdf",
        "title": "[PDF] Limited Warranty for PV Modules",
        "snippet": "this Limited Product Warranty and shall not extend beyond the period set forth herein. This Limited Product Warranty does not warranty a specific power output at or during any time frame, which shall be exclusively covered under Section 2 of this Warranty hereinafter (“Limited Peak Power Warranty”) 2. Limited Peak Power Warranty– Limited Remedy JA Solar warrants that for a period of thirty years starting from the Warranty Commencement Date, loss of power output against the minimum “Peak Power [...] modules dispatch from the JA Solar factory, whichever occurs earlier (the “Warranty Commencement Date”). 1. .Limited Product Warranty – Twelve Year Repair or Replacement JA Solar warrants that the MODULES together with the factory-assembled DC connectors and cables are free from any defects in materials and workmanship under normal application, usage, installation and service conditions for a period of one hundred and forty four (144) months from the Warranty Commencement Date. If MODULES [...] A/0 1 / 5 Limited Warranty for PV Double-Glass Modules JA Solar Holdings Co., Ltd., and on behalf of ALL its DIRECTLY AND indirectly owned and controlled subsidiary, INCLUDING BUT NOT LIMITED TO Shanghai JA Solar Technology Co., Ltd.-(hereinafter jointly referred to as “JA Solar”) warrants its Photovoltaic Solar modules‟ (MODULES) performance starting from the date of sale to the first customer installing (for their own use) the modules (“Customer”) or starting at the latest 6 months after",
        "score": 0.6796259,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ja-solar",
    "product": "JAM60S20 480W",
    "candidates": [
      {
        "url": "https://www.jasolar.com/uploadfile/2020/0619/20200619041705631.pdf",
        "title": "[PDF] 166 JAM60S20 365-390 MR",
        "snippet": "Shanghai JA Solar Technology Co., Ltd. Page 2. JAM60S20 365-390/MR/1500V ... Measurement tolerance at STC: Pmax ±3 %, Voc ±2% and Isc ±4%. 3600Pa, 1.5. 1600Pa,",
        "score": 0.7722049,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0511/20220511060331180.pdf",
        "title": "[PDF] JAM60S20 365-390 MR",
        "snippet": "Power Tolerance. 0~+5W. Temperature Coefficient of Isc(a_Isc). +0.044%/°C. Temperature Coefficient of Voc(ẞ_Voc). -0.272%/°C. Temperature",
        "score": 0.7680558,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/1031/20191031104157948.pdf",
        "title": "JaSolar www.jasolar.com Specifications subject to technical changes and tests.",
        "snippet": "Specifications subject to technical changes and tests · JA Solar reserves the right of final interpretation",
        "score": 0.45784017,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/0129/20190129030921131.pdf",
        "title": "[PDF] JA SOLAR PV MODULES INSTALLATION MANUAL",
        "snippet": "according to these instructions may void the warranty. 5.2.2.1 Modules Installed with Mounting Holes Modules should be bolted to support structures through mounting holes located in the frame’s back flanges. Refer to what is shown in Figure 6 (Mounting Details). Figure 6 Mounting Details For your reference, please use the components specified in below: 1. Bolt 2. Washer Material: Stainless Steel Material: Stainless Steel Size and Length: M816mm Size: M8 3. Spring Washer 4. Nut Material: [...] authority for guidelines and requirements for building or structural fire safety. JA solar modules have been listed as Class A according to IEC 61730-2 standard. For roof installations, modules should be mounted over a fire resistant covering suitable for this application, with adequate ventilation between the modules backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of building. Improper installation may create hazards in the event of a fire. [...] and/or performance of the modules. Please adopt appropriate measures to ensure the performance and safety of the modules when they are installed or operated in the areas where produces heavy snow, extremely cold, strong wind, or near the island or desert where is prone to produce salt fog, or near water. JA Solar modules have passed the IEC 61701 salt-mist, but galvanic corrosion can occur between the aluminum frame of the modules and mounting or grounding hardware if such hardware is comprised",
        "score": 0.7295395,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0218/20220218094931164.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This Installation Manual contains essential information for electrical and mechanical installation that you must know before handling,.",
        "score": 0.6793707,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0108/8d54f07291ef4fb.pdf",
        "title": "[PDF] JA Solar PV Single-glass Modules Installation Manual",
        "snippet": "team. Please make sure the modules are properly installed and keep the warranty valid. 5.2 Installation methods Modules can be installed on the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the modules according to these instructions, please in advance consult JA Solar and must be approved by JA solar, otherwise may damage modules and void the warranty. 5.2.1 Modules installed with mounting hole Modules should be [...] +5400/-2400 N/A N/A N/A JAM76S11 PR(B)Series +5400/-2400 N/A +5400/-2400 N/A N/A N/A JAM66S10 MRSeries +5400/-2400 N/A +5400/-2400 ±2000 N/A N/A JAM60S20 MR Series +5400/-2400 N/A +5400/-2400 ±1800 N/A N/A JAM72S10 MRSeries （40mm 边框） ±2400 N/A +5400/-2400 ±1800 ±2400 5400/2400 JAM72S10 MRSeries （35mm边框） ±2400 N/A +5400/-2400 ±1800 ±2400 3600/2400 JAM78S10 MR Series ±2400 N/A +5400/-2400 ±1800 N/A N/A JAM72S17 GR Series +5400/-2400 N/A +5400/-2400 ±1800 N/A N/A JAM72S20 MR Series ±2400 N/A [...] Module as it will result in galvanic corrosion. IEC 60950-1 standard recommends metal combinations not exceed an electrochemical potential difference of 0.6 Volts. Modules can be mounted in landscape or portrait orientation. Photovoltaic modules should be installed in accordance with JA Solar's installation manuals or recommended installation methods. Tracker installation should get the compatibility approval from JA Solar modules. Other installation methods, please contact JA Solar’s technical",
        "score": 0.66699636,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518084532923.pdf",
        "title": "[PDF] FOR JA Solar PHOTOVOLTAIC MODULES 2 INTRODUCTION",
        "snippet": "examples and recommendation. If not mounting the Modules according to these instructions, please in advance consult JA Solar and must be approved by JA solar, otherwise may damage Modules and void the warranty. 6.2.1 Modules be installed with clamps Module can be installed by specified clamps as shown in Figure 1 Module need metal clamp to be fixed on the racks JA Solar recommend you use clamp as below Specifications or clamps approved by system installer（recommend supplier Jiangyin haida） [...] direct contact of dissimilar metals with the aluminum frame of the Modules that will result in galvanic corrosion. An addendum to UL Standard 1703 “Flat Plate Photovoltaic Modules and Panels” recommends metal combinations not exceed an electrochemical potential difference of 0.6 Volts. JA Solar Modules can be mounted in landscape or portrait orientation. 6.2 Installation methods Modules can be installed to the racks by clamps or hooks. Modules must be installed according to the following [...] supporting system must be tested by the third-party organization with the analysis ability of Static Mechanical, according to the local national or international standards such as DIN1055 or equivalent standards. The Modules mounting structure must be made of durable, corrosion-resistant and UV-resistant material. Modules must be securely attached to the mounting structure. In regions with heavy snowfall in winter, select the height of the mounting system. So that the lowest edge of the Modules",
        "score": 0.6615081,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0122/b85ded457befd01.pdf",
        "title": "[PDF] JA Solar PV Bifacial Double-glass Modules Installation Manual",
        "snippet": "can be used or not. 4 Installation Condition 4.1 Installation Position and Working Environment JA Solar modules are intended for use in terrestrial applications, no outer space use. Do not use mirrors or other magnifiers to concentrate sunlight onto the modules. Modules must be mounted on appropriate mounting structures positioned on suitable buildings, the ground, or other structures suitable for modules (e.g. carports, building facades or PV trackers). Modules must not be installed in [...] used in the module is 2.0mm. 4. For the maximum loads that do not appear in the table for certain installation methods, and for the other installation methods that doesn’t appear in the table, please contact JA Solar for more details. Figure 3 Installation Position and Corresponding Load Relation 6 Electrical Installation Inner four holes, mounting rails parallel the long frame Inner four holes, mounting rails cross the long frame Clamps, mounting rails parallel the long frame S=1/4L±50 Clamps, [...] ventilation between the module backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of the building. Improper installation may create hazards in the event of a fire. Use appropriate components such as fuses, circuit breaker and grounding connector as requires by local authority. Do not use modules where flammable gasses may be generated. JA modules have not been tested for explosion protection. Please consult local regulations whether the modules",
        "score": 0.6580885,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2021/1126/20211126040831544.pdf",
        "title": "[PDF] JA Solar PV Single-glass Modules Installation Manual - 晶澳太阳能",
        "snippet": "This Installation Manual contains essential information for electrical and mechanical installation that you must know before handling and installing JA Solar",
        "score": 0.5631623,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0725/70451cc6e284557.pdf",
        "title": "[PDF] JA SOLAR PRODUCT BROCHURE",
        "snippet": "610 48.10 39.77 16.05 15.34 22.6 615 48.30 39.96 16.10 15.39 22.8 620 48.50 40.21 16.13 15.42 23.0 0~+3% +0.045%/°C -0.250%/°C -0.290%/°C TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage [...] Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature [...] 2.0mm/2.0mm 36pcs/Pallet， 720pcs/40HQ Container 585 52.16 44.22 13.89 13.23 22.6 590 52.37 44.43 13.94 13.28 22.8 595 52.58 44.64 13.99 13.33 23.0 0~+3% +0.046%/°C -0.260%/°C -0.290%/°C TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp)",
        "score": 0.7173491,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0807/f93000c02f65796.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "(hereinafter referred to as \"Limited Product Warranty Period”) that the Modules (together with the factory-assembled DC connectors and cables); when installed; used; and serviced under normal operating conditions and in accordance with the JA Solar module installation manual; product technical specifications and maintenance manual (which; if not provided in the supply contract; can be downloaded from JA Solar' official website at www.jasolar.com) will: be free from any defects in design; [...] Limited Warranty: 3.1 Limited Product Warranty: Subject to the terms and conditions of this Limited Warranty, JA Solar warrants to the Customer for 1) a period of one hundred and eighty (180) calendar months of JAM54D4X-XXX/MB; JAM54D4X-XXX/GB; JAM54D4X-XXX/LB; JAM54S4X-XXX/LR; JAM54S4X-XXX/MR; JAM60S4X-XXX/LR or 2) a period of one hundred and forty-four (144) calendar months of all other models，the relevant models are listed in Annex (last page of document) Following the Warranty Start Date [...] 晶澳太阳能组件产品有限质保书 Q/JASO-QAM-125-Aus A/11-Aus Limited Warranty for JA Solar Brand Crystalline Solar PV Modules This Limited Warranty for JA Solar Brand Crystalline Solar PV Modules (hereinafter referred to as “Limited Warranty”) is issued by JA Solar Technology Co., Ltd. (JA SOLAR TECHNOLOGY CO., LTD.)., which is headquartered at Building No.8, Nuode Center, Automobile Museum East Road, Fengtai District, Beijing, China (100160), or its legal successors or assigns (hereinafter collectively referred",
        "score": 0.67988104,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518102313951.pdf",
        "title": "[PDF] Limited Warranty for PV Modules",
        "snippet": "this Limited Product Warranty and shall not extend beyond the period set forth herein. This Limited Product Warranty does not warranty a specific power output at or during any time frame, which shall be exclusively covered under Section 2 of this Warranty hereinafter (“Limited Peak Power Warranty”) 2. Limited Peak Power Warranty– Limited Remedy JA Solar warrants that for a period of thirty years starting from the Warranty Commencement Date, loss of power output against the minimum “Peak Power [...] modules dispatch from the JA Solar factory, whichever occurs earlier (the “Warranty Commencement Date”). 1. .Limited Product Warranty – Twelve Year Repair or Replacement JA Solar warrants that the MODULES together with the factory-assembled DC connectors and cables are free from any defects in materials and workmanship under normal application, usage, installation and service conditions for a period of one hundred and forty four (144) months from the Warranty Commencement Date. If MODULES [...] A/0 1 / 5 Limited Warranty for PV Double-Glass Modules JA Solar Holdings Co., Ltd., and on behalf of ALL its DIRECTLY AND indirectly owned and controlled subsidiary, INCLUDING BUT NOT LIMITED TO Shanghai JA Solar Technology Co., Ltd.-(hereinafter jointly referred to as “JA Solar”) warrants its Photovoltaic Solar modules‟ (MODULES) performance starting from the date of sale to the first customer installing (for their own use) the modules (“Customer”) or starting at the latest 6 months after",
        "score": 0.6783488,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1130/20221130100440209.pdf",
        "title": "[PDF] JA Solar MODULE PRODUCT Limited Warranty",
        "snippet": "4.1 Time Limit for Warranty Claims All claims under the Limited Product Warranty must be submitted in writing to JA Solar within the Limited",
        "score": 0.5405607,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ja-solar",
    "product": "JAM72D40 550W Bifacial",
    "candidates": [
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0725/70451cc6e284557.pdf",
        "title": "[PDF] JA SOLAR PRODUCT BROCHURE",
        "snippet": "(Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) ELECTRICAL PARAMETERS AT STC JAM72D40 595/LB JAM72D40 600/LB JAM72D40 605/LB ELECTRICAL PARAMETERS AT STC JAM66D45 610/LB JAM66D45 615/LB JAM66D45 620/LB JAM72D40 n-type Double Glass Bifacial Modules JAM66D45 n-type Double Glass Bifacial Modules 13 [...] SUPERIOR WARRANTY Standard Module Linear Performance Warranty n-type Bifacial Double Glass Module Linear Performance Warranty 87.4% +6.3% 83.1% 99% 1 5 10 15 20 25 30 100% TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) ELECTRICAL PARAMETERS [...] ELECTRICAL PARAMETERS AT STC JAM72D40 585/MB JAM72D40 590/MB JAM72D40 595/MB JAM72D40 n-type Double Glass Bifacial Modules SUPERIOR WARRANTY 87.4% +6.3% 83.1% 99% 1 5 10 15 20 25 30 Standard Module Linear Performance Warranty n-type Bifacial Double Glass Module Linear Performance Warranty 100% MECHANICAL PARAMETERS Cell Weight Dimensions Cable Cross Section Size No. of cells Junction Box Connector Cable Length(Including Connector) Front Class/Back Glass Packaging Conﬁguration Mono 32.5kg",
        "score": 0.7680558,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1124/20221124101212393.pdf",
        "title": "[PDF] JAM72D40 555-580 GB 16BB",
        "snippet": "n-type Bifacial Double Glass Module ... Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation",
        "score": 0.7520312,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0328/e3e29ac9ef3be81.pdf",
        "title": "[PDF] JAM72D40 570-590 GB 新电参数",
        "snippet": "n-type Bifacial Double Glass ... Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation.",
        "score": 0.72465646,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0328/2aa9356c9bf80de.pdf",
        "title": "[PDF] JAM72D40 MB 595W EN",
        "snippet": "Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation. Version No.: Global-EN-20240326A.",
        "score": 0.6551821,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0122/b85ded457befd01.pdf",
        "title": "[PDF] JA Solar PV Bifacial Double-glass Modules Installation Manual",
        "snippet": "JAM72D40-xxx/MB/1500V 555-590 2278×1134×30 JAM78D40-xxx/MB/1500V 600-635 2465×1134×35 JAM54D40-xxx/MB/1500V 405-440 1722x1134x30 JAM54D40-xxx/LB/1500V 430-455 1762x1134x30 JA Solar PV Bifacial Double-glass Modules Installation Manual Q/JASO-PMO-015 A/12 JAM54D41-xxx/LB/1500V 430-455 1762x1134x30 JAM72D30-xxx/LB/1500V 555-580 2333x1134x30 JAM72D40-xxx/LB/1500V 575-605 2333x1134x30 JAM72D42-xxx/LB/1500V 605-640 2465x1134x35 JAM66D42-xxx/MB/1500V 540-600 2278x1134x30 JAM66D45-xxx/LB/1500V 585-620 [...] 3600/1600 N/A N/A JAM72D40 MB （30mm frame） 1600/1600 3600/1600 1600/1600 3600/1600 N/A N/A JAM78D40 GB （30mm frame） 1600/1600 3600/1600 1600/1600 3600/1600 3600/1600 1600/1600 JAM78D40 MB （30mm frame） 1600/1600 3600/1600 1600/1600 3600/1600 3600/1600 1600/1600 JAM72D30 LB （30mm frame） N/A 3600/1600 N/A 3600/1600 N/A N/A JAM72D40 LB （30mm frame） N/A 3600/1600 N/A 3600/1600 N/A N/A JAM66D42 MB (30mm frame) N/A 3600/1600 N/A 3600/1600 N/A N/A JAM66D45 LB (30mm frame) N/A 3600/1600 N/A 3600/1600 [...] 晶澳太阳能科技股份有限公司 JA Solar PV Bifacial Double-glass Modules Installation Manual 晶澳太阳能科技股份有限公司 发布 CONTENTS 1 Introduction .................................................................................................................................................... 2 2 Codes and Regulations .................................................................................................................................... 2 3 General",
        "score": 0.7559439,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0218/20220218094918677.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "JA Solar modules can be mounted in landscape or portrait orientation. For the bifacial modules, in order to maintain the energy yield of module",
        "score": 0.7208996,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/0129/20190129030921131.pdf",
        "title": "[PDF] JA SOLAR PV MODULES INSTALLATION MANUAL",
        "snippet": "Solar modules can be mounted in landscape or portrait orientation. For the bifacial modules, in order to maintain the energy yield of module rear side, the distance between the bottom of modules and the roof or ground surface shall be at least 1m. 5.2 Installation Methods Modules can be installed to the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the Modules according to these instructions, please in advance consult [...] Version4 Jan.23rd, 2019 JA Solar JA PV Module Installation Manual JA SOLAR PV MODULES INSTALLATION MANUAL Double glass module and bifacial PERC mono glass-glass module IMPORTANT SAFETY INSTRUCTIONS This manual contains important safety instructions for the Solar Photovoltaic Modules (hereafter referred to as “Modules”) of JA Solar Holdings Co., Ltd. (hereafter referred to as “JA Solar). Installers should follow all safety precautions described in this guide as well as local codes when installing [...] according to these instructions may void the warranty. 5.2.2.1 Modules Installed with Mounting Holes Modules should be bolted to support structures through mounting holes located in the frame’s back flanges. Refer to what is shown in Figure 6 (Mounting Details). Figure 6 Mounting Details For your reference, please use the components specified in below: 1. Bolt 2. Washer Material: Stainless Steel Material: Stainless Steel Size and Length: M816mm Size: M8 3. Spring Washer 4. Nut Material:",
        "score": 0.7156829,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0218/20220218094931164.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This manual contains essential information for electrical and mechanical installation of JA Solar modules, and safety information. Qualified",
        "score": 0.6829338,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1130/20221130100440209.pdf",
        "title": "[PDF] JA Solar MODULE PRODUCT Limited Warranty",
        "snippet": "The warranty covers defects in design, materials, workmanship, or manufacturing for 144 months, starting from the earlier of delivery or 6",
        "score": 0.66777676,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0807/f93000c02f65796.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "525-560 12 JAM72S30-XXX/LR 560-580 12 JAM54S30-XXX/LR 415-435 12 JAM54S40-XXX/LR 420-450 15 JAM60S40-XXX/LR 475-500 15 JAM72S40-XXX/LR 560-600 12 JAM66D45-XXX/LB 600-610 12 JAM66D42-XXX/MB 580-585 12 JAM72D42-XXX/LB 625-635 12 JAM72D40-XXX/LB 590-595 12 JAM54D40-XXX/LB 440-445 12 JAM54D41-XXX/LB 440 12 JAM72D30-XXX/MB 545 12 JAM72D40-XXX/MB 570-575 12 JAM72D40-XXX/GB 560-580 12 [...] warranty commitment is the Yearly Degradation Rate from the Warranty Start Date; the Degradation Rate for less than one year shall be calculated as a whole year. Degradation Rate = 100%(Nominal Power Output - the Average of Peak Power Output)/Nominal Power Output For the avoidance of doubt; notwithstanding anything to the contrary herein; the Limited Peak Power Warranty for bifacial double glass series Modules shall apply only to the front-side power output of such Modules. 3.3 Exclusions: The [...] drastic changes in such environments; including but not limited to extreme heat; acidic rainfall (including snow); blowing sand; corrosiveness; salty air (e.g. marine environment); contaminated air; soil or groundwater; abnormal levels of oxidation; mold; or any nearby fire; explosion; smoke; or charring. 10) Damage caused by force majeure such as natural disasters; including but not limited to lightning; hail; frost; snow; storms; tidal waves; floods; extreme temperatures; earthquakes;",
        "score": 0.66203266,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518102313951.pdf",
        "title": "[PDF] Limited Warranty for PV Modules",
        "snippet": "A/0 1 / 5 Limited Warranty for PV Double-Glass Modules JA Solar Holdings Co., Ltd., and on behalf of ALL its DIRECTLY AND indirectly owned and controlled subsidiary, INCLUDING BUT NOT LIMITED TO Shanghai JA Solar Technology Co., Ltd.-(hereinafter jointly referred to as “JA Solar”) warrants its Photovoltaic Solar modules‟ (MODULES) performance starting from the date of sale to the first customer installing (for their own use) the modules (“Customer”) or starting at the latest 6 months after [...] this Limited Product Warranty and shall not extend beyond the period set forth herein. This Limited Product Warranty does not warranty a specific power output at or during any time frame, which shall be exclusively covered under Section 2 of this Warranty hereinafter (“Limited Peak Power Warranty”) 2. Limited Peak Power Warranty– Limited Remedy JA Solar warrants that for a period of thirty years starting from the Warranty Commencement Date, loss of power output against the minimum “Peak Power [...] modules dispatch from the JA Solar factory, whichever occurs earlier (the “Warranty Commencement Date”). 1. .Limited Product Warranty – Twelve Year Repair or Replacement JA Solar warrants that the MODULES together with the factory-assembled DC connectors and cables are free from any defects in materials and workmanship under normal application, usage, installation and service conditions for a period of one hundred and forty four (144) months from the Warranty Commencement Date. If MODULES",
        "score": 0.5920305,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/1120/7e772d24304d804.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "Subject to the terms and conditions of this Limited Warranty, JA Solar warrants to the Customer for a period of. 15 years of JAM54D4X-XXX/MB; JAM54D4X-XXX/GB;",
        "score": 0.4671622,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ja-solar",
    "product": "JAM72S30 535W",
    "candidates": [
      {
        "url": "https://www.jasolar.com/uploadfile/2021/0706/20210706053524693.pdf",
        "title": "[PDF] JAM72S30 525-550 MR",
        "snippet": "Shanghai JA Solar Technology Co., Ltd. Page 2. 3600Pa, 1.5. 1600Pa, 1.5. JAM72S30. -525/MR/1500V. JAM72S30. -530/MR/1500V. JAM72S30. -535/MR/1500V. JAM72S30.",
        "score": 0.79769903,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2021/1117/20211117110512505.pdf",
        "title": "[PDF] JAM72S30 530-555 MR",
        "snippet": "JA SOLAR. +1.7%. • ISO 14001: 2015 Gestão do meio ambiente. • ISO 45001: 2018 ... -530/MR -535/MR -540/MR -545/MR -550/MR -555/MR. Potência Máxima(Pmax) [W].",
        "score": 0.74541736,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0511/20220511060835815.pdf",
        "title": "[PDF] JAM72S30 530-555 MR新边框35-33-17 2278",
        "snippet": "Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation. JA SOLAR. Page 2. 2278+2. JA SOLAR.",
        "score": 0.73981786,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2021/0706/20210706053235549.pdf",
        "title": "[PDF] JAM72S30 525-550/MR/1000V",
        "snippet": "JAM72S30 525-550/MR/1000V is a genuine MC4 module made in China/Vietnam, with measurement tolerance at STC: Pmax ±3 %, Voc ±3% and Isc ±4%.",
        "score": 0.69870013,
        "bucket": "datasheets"
      },
      {
        "url": "https://jasolar.com/uploadfile/2023/0309/20230309024138456.pdf",
        "title": "[PDF] C E R T I F I C A T E",
        "snippet": "JAM72S31-xxx/MR/1000V, xxx= 510 to 545 in steps of 5; JAM66S31-xxx/MR/1000V, xxx= 470 to 500 in steps of 5; JAM60S31-xxx/MR/1000V, xxx= 425 to 450 in steps of 5; JAM54S31-xxx/MR/1000V, xxx= 385 to 405 in steps of 5; JAM76S11-xxx/PR(B)/1000V, xxx= 395 to 415 in steps of 5; JAM78S30-xxx/GR/1000V, xxx= 575 to 610 in steps of 5; JAM72S30-xxx/GR/1000V, xxx= 535 to 560 in steps of 5; JAM66S30-xxx/GR/1000V, xxx= 500 to 510 in steps of 5; JAM60S30-xxx/GR/1000V, xxx= 445 to 470 in steps of 5; [...] JAM72S31-xxx/MR/1500V, xxx= 510 to 545 in steps of 5; JAM66S31-xxx/MR/1500V, xxx= 470 to 500 in steps of 5; JAM60S31-xxx/MR/1500V, xxx= 425 to 450 in steps of 5; JAM54S31-xxx/MR/1500V, xxx= 385 to 405 in steps of 5; JAM76S11-xxx/PR(B)/1500V, xxx= 395 to 415 in steps of 5; JAM78S30-xxx/GR/1500V, xxx= 575 to 610 in steps of 5; JAM72S30-xxx/GR/1500V, xxx= 535 to 560 in steps of 5; JAM66S30-xxx/GR/1500V, xxx= 500 to 510 in steps of 5; JAM60S30-xxx/GR/1500V, xxx= 445 to 470 in steps of 5; [...] JAM66S31-xxx/MR, xxx= 470 to 500 in steps of 5; JAM60S31-xxx/MR, xxx= 425 to 450 in steps of 5; JAM54S31-xxx/MR, xxx= 385 to 405 in steps of 5; JAM76S11-xxx/PR(B), xxx= 395 to 415 in steps of 5; JAM78S30-xxx/GR, xxx= 575 to 610 in steps of 5; JAM72S30-xxx/GR, xxx= 535 to 560 in steps of 5; JAM66S30-xxx/GR, xxx= 500 to 510 in steps of 5; JAM60S30-xxx/GR, xxx= 445 to 470 in steps of 5; JAM54S30-xxx/GR, xxx= 400 to 420 in steps of 5; JAM78S31-xxx/GR, xxx= 570 to 590 in steps of 5; JAM72S31-xxx/GR,",
        "score": 0.63804686,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0328/b090b73bdbab0d2.pdf",
        "title": "[PDF] JAM72S30 LR 585W EN",
        "snippet": "Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation. Version No.: Global-EN-20240326A.",
        "score": 0.6122407,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2021/0706/20210706053456650.pdf",
        "title": "[PDF] JAM72D30 525-550 MB",
        "snippet": "Shanghai JA Solar Technology Co., Ltd. Page 2. 1600Pa, 1.5. JAM72D30 525-550/MB/1500V. Genuine MC4-EVO2. QC 4.10-35/45. Country of Manufacturer. China/Vietnam.",
        "score": 0.48177138,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/0129/20190129030921131.pdf",
        "title": "[PDF] JA SOLAR PV MODULES INSTALLATION MANUAL",
        "snippet": "according to these instructions may void the warranty. 5.2.2.1 Modules Installed with Mounting Holes Modules should be bolted to support structures through mounting holes located in the frame’s back flanges. Refer to what is shown in Figure 6 (Mounting Details). Figure 6 Mounting Details For your reference, please use the components specified in below: 1. Bolt 2. Washer Material: Stainless Steel Material: Stainless Steel Size and Length: M816mm Size: M8 3. Spring Washer 4. Nut Material: [...] authority for guidelines and requirements for building or structural fire safety. JA solar modules have been listed as Class A according to IEC 61730-2 standard. For roof installations, modules should be mounted over a fire resistant covering suitable for this application, with adequate ventilation between the modules backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of building. Improper installation may create hazards in the event of a fire. [...] and/or performance of the modules. Please adopt appropriate measures to ensure the performance and safety of the modules when they are installed or operated in the areas where produces heavy snow, extremely cold, strong wind, or near the island or desert where is prone to produce salt fog, or near water. JA Solar modules have passed the IEC 61701 salt-mist, but galvanic corrosion can occur between the aluminum frame of the modules and mounting or grounding hardware if such hardware is comprised",
        "score": 0.7440808,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0108/8d54f07291ef4fb.pdf",
        "title": "[PDF] JA Solar PV Single-glass Modules Installation Manual",
        "snippet": "72S42LR:550±50mm; Mounting by clamps on the short frame H=1/4W±50 Mounting by 400mm spaced holes  Clamps, mounting rails parallel the long frame 66：400mm≤S≤500mm； 72：450mm≤S≤550mm； 78：500mm≤S≤600mm； JAM72S30 MR Series （30mm frame） +5400/-2400 +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM72S30 MB Series （30mm frame） +5400/-2400 +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM66S30 MR Series (30mm frame) +5400/-2400 +5400/-2400 +5400/-2400 ±1200 N/A ±2400 JAM72S30 GR Series (30mmframe) +5400/-2400 [...] team. Please make sure the modules are properly installed and keep the warranty valid. 5.2 Installation methods Modules can be installed on the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the modules according to these instructions, please in advance consult JA Solar and must be approved by JA solar, otherwise may damage modules and void the warranty. 5.2.1 Modules installed with mounting hole Modules should be [...] Module as it will result in galvanic corrosion. IEC 60950-1 standard recommends metal combinations not exceed an electrochemical potential difference of 0.6 Volts. Modules can be mounted in landscape or portrait orientation. Photovoltaic modules should be installed in accordance with JA Solar's installation manuals or recommended installation methods. Tracker installation should get the compatibility approval from JA Solar modules. Other installation methods, please contact JA Solar’s technical",
        "score": 0.73023266,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0122/b85ded457befd01.pdf",
        "title": "[PDF] JA Solar PV Bifacial Double-glass Modules Installation Manual",
        "snippet": "can be used or not. 4 Installation Condition 4.1 Installation Position and Working Environment JA Solar modules are intended for use in terrestrial applications, no outer space use. Do not use mirrors or other magnifiers to concentrate sunlight onto the modules. Modules must be mounted on appropriate mounting structures positioned on suitable buildings, the ground, or other structures suitable for modules (e.g. carports, building facades or PV trackers). Modules must not be installed in [...] Solar modules can be mounted in landscape or portrait orientation. For the bifacial modules, in order to maintain the energy yield of module rear side, the distance between the bottom of modules and the roof or ground surface is recommended be at least 1m. 5.2 Installation methods Modules can be installed to the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the Modules according to these instructions, please in [...] ventilation between the module backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of the building. Improper installation may create hazards in the event of a fire. Use appropriate components such as fuses, circuit breaker and grounding connector as requires by local authority. Do not use modules where flammable gasses may be generated. JA modules have not been tested for explosion protection. Please consult local regulations whether the modules",
        "score": 0.6690754,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0218/20220218094931164.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This manual contains essential information for electrical and mechanical installation of JA Solar modules, and safety information. Qualified",
        "score": 0.6271529,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0331/049eee3ed8ee930.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This manual contains essential electrical and mechanical installation information, safety instructions, and requires qualified personnel. Do",
        "score": 0.6213807,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1130/20221130100440209.pdf",
        "title": "[PDF] JA Solar MODULE PRODUCT Limited Warranty",
        "snippet": "and in accordance with the JA Solar module installation manual, product technical specifications and maintenance manual (which, if not",
        "score": 0.59401023,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0807/f93000c02f65796.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "Province.PEOPLE'S REPUBLIC OF CHINA Email: services@jasolar.com Web: www.jasolar.com Beijing JA Solar PV Technology Co., Lta. Add: Building 8, Nuode Center, East Auto Museum Road, Fengtai District, Beijing 100160, China Tel: +86 10 6361 1888 Fax:+8610 6361 1999 Postcode: 100160 Email: services@jasolar.com Website: www.jasolar.com 晶澳太阳能组件产品有限质保书 Q/JASO-QAM-125-Aus A/11-Aus Annex: MODEL NUMBER POWER RANGE Limited Warranty JAM54S30-XXX/MR 390-420 12 JAM66S30-XXX/MR 480-510 12 JAM72S30-XXX/MR [...] 525-560 12 JAM72S30-XXX/LR 560-580 12 JAM54S30-XXX/LR 415-435 12 JAM54S40-XXX/LR 420-450 15 JAM60S40-XXX/LR 475-500 15 JAM72S40-XXX/LR 560-600 12 JAM66D45-XXX/LB 600-610 12 JAM66D42-XXX/MB 580-585 12 JAM72D42-XXX/LB 625-635 12 JAM72D40-XXX/LB 590-595 12 JAM54D40-XXX/LB 440-445 12 JAM54D41-XXX/LB 440 12 JAM72D30-XXX/MB 545 12 JAM72D40-XXX/MB 570-575 12 JAM72D40-XXX/GB 560-580 12 [...] Power Output; For p type mono-crystalline single glass Modules (whose product types are: JAMXXS20-XXX/XX； JAMXXS21-XXX/XX ；JAMXXS30-XXX/XX ；JAMXXS31-XXX/XX ；JAM72S17-XXX/GR): the Degradation Rate shall not exceed 2% in the first year beginning from the Warranty Start Date; and an additional 0.55% each year thereafter from the beginning of the second year until that date which is twenty-five (25) years following the Warranty Start Date; at which time the Peak Power Output shall be not less than",
        "score": 0.7348247,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0725/70451cc6e284557.pdf",
        "title": "[PDF] JA SOLAR PRODUCT BROCHURE",
        "snippet": "Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) ELECTRICAL PARAMETERS AT STC JAM72S30 575/LR JAM72S30 580/LR JAM72S30 585/LR JAM72S30 p-type Monofacial Modules SUPERIOR WARRANTY 84.8% +1.7% 83.1% 98% 97.5% 1 5 10 15 20 25 Standard Module Linear Performance Warranty New Linear Performance Warranty 100% 21 JA [...] 610 48.10 39.77 16.05 15.34 22.6 615 48.30 39.96 16.10 15.39 22.8 620 48.50 40.21 16.13 15.42 23.0 0~+3% +0.045%/°C -0.250%/°C -0.290%/°C TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage (Voc)[V] Maximum Power Voltage(Vmp)[v] Short Circuit Current(Isc)[A] Maximum Power Current(Imp)[A] Module Efﬁciency[%] Power T olerance T emperature Coefﬁcient of Isc（α-Isc) T emperature Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) TYPE Rate Maximum Power(Pmax)[W] Open Circuit Voltage [...] Coefﬁcient of Voc（β-Voc) T emperature Coefﬁcient of Pmax（γ-Pmp) 545 49.75 41.80 13.93 13.04 21.1 550 49.90 41.96 14.00 13.11 21.3 555 50.02 42.11 14.07 13.18 21.5 ELECTRICAL PARAMETERS AT STC JAM72S30 545/MR JAM72S30 550/MR JAM72S30 555/MR ELECTRICAL PARAMETERS AT STC JAM72D30 545/MB JAM72D30 550/MB JAM72D30 555/MB 0~+5W +0.045%/°C -0.275%/°C -0.350%/°C JAM72D30 p-type Double Glass Bifacial Modules JAM72S30 p-type Monofacial Modules 23 JA Solar Product Brochure 22 JA Solar Product Brochure",
        "score": 0.7274535,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518102313951.pdf",
        "title": "[PDF] Limited Warranty for PV Modules",
        "snippet": "this Limited Product Warranty and shall not extend beyond the period set forth herein. This Limited Product Warranty does not warranty a specific power output at or during any time frame, which shall be exclusively covered under Section 2 of this Warranty hereinafter (“Limited Peak Power Warranty”) 2. Limited Peak Power Warranty– Limited Remedy JA Solar warrants that for a period of thirty years starting from the Warranty Commencement Date, loss of power output against the minimum “Peak Power [...] A/0 1 / 5 Limited Warranty for PV Double-Glass Modules JA Solar Holdings Co., Ltd., and on behalf of ALL its DIRECTLY AND indirectly owned and controlled subsidiary, INCLUDING BUT NOT LIMITED TO Shanghai JA Solar Technology Co., Ltd.-(hereinafter jointly referred to as “JA Solar”) warrants its Photovoltaic Solar modules‟ (MODULES) performance starting from the date of sale to the first customer installing (for their own use) the modules (“Customer”) or starting at the latest 6 months after [...] modules dispatch from the JA Solar factory, whichever occurs earlier (the “Warranty Commencement Date”). 1. .Limited Product Warranty – Twelve Year Repair or Replacement JA Solar warrants that the MODULES together with the factory-assembled DC connectors and cables are free from any defects in materials and workmanship under normal application, usage, installation and service conditions for a period of one hundred and forty four (144) months from the Warranty Commencement Date. If MODULES",
        "score": 0.69622743,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0923/20220923042141101.pdf",
        "title": "[PDF] JAM72S30 540-565 GR 30框72pro",
        "snippet": "Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation. JA SOLAR. Page 2. 2278±2. JA SOLAR.",
        "score": 0.67192334,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "ja-solar",
    "product": "JAM78S30 580W",
    "candidates": [
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0224/20220224053234854.pdf",
        "title": "[PDF] JAM78S30 580-605 MR",
        "snippet": "Specifications subject to technical changes and tests. JA Solar reserves the right of final interpretation. JA SOLAR. Page 2. 2465±2. JA SOLAR.",
        "score": 0.82795376,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0513/20220513051007792.pdf",
        "title": "[PDF] JAM78S30 580-605 MR",
        "snippet": "Assembled with 11BB PERC cells, the half-cell configuration of the modules offers the advantages of higher power output, better temperature-dependent",
        "score": 0.6947383,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/1130/20221130100440209.pdf",
        "title": "[PDF] JA Solar MODULE PRODUCT Limited Warranty",
        "snippet": "and in accordance with the JA Solar module installation manual, product technical specifications and ... JAM78S30-XXXMR/1500V. 580-605.",
        "score": 0.77261686,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2019/0129/20190129030921131.pdf",
        "title": "JA SOLAR PV MODULES INSTALLATION MANUAL",
        "snippet": "according to these instructions may void the warranty. 5.2.2.1 Modules Installed with Mounting Holes Modules should be bolted to support structures through mounting holes located in the frame’s back flanges. Refer to what is shown in Figure 6 (Mounting Details). Figure 6 Mounting Details For your reference, please use the components specified in below: 1. Bolt 2. Washer Material: Stainless Steel Material: Stainless Steel Size and Length: M816mm Size: M8 3. Spring Washer 4. Nut Material: [...] authority for guidelines and requirements for building or structural fire safety. JA solar modules have been listed as Class A according to IEC 61730-2 standard. For roof installations, modules should be mounted over a fire resistant covering suitable for this application, with adequate ventilation between the modules backsheet and the mounting surface. Roof constructions and installations may affect the fire safety of building. Improper installation may create hazards in the event of a fire. [...] Solar modules can be mounted in landscape or portrait orientation. For the bifacial modules, in order to maintain the energy yield of module rear side, the distance between the bottom of modules and the roof or ground surface shall be at least 1m. 5.2 Installation Methods Modules can be installed to the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the Modules according to these instructions, please in advance consult",
        "score": 0.69274646,
        "bucket": "installation"
      },
      {
        "url": "https://jasolar.com/uploadfile/2023/0309/20230309024138456.pdf",
        "title": "[PDF] C E R T I F I C A T E",
        "snippet": "JAM78S30-xxx/MR/1500V, xxx= 580 to 605 in steps of 5; JAM72S30-xxx/MR/1500V, xxx=510 to 555 in steps of 5; JAM66S30-xxx/MR/1500V, xxx=470 to 505 in steps of 5; JAM60S30-xxx/MR/1500V, xxx=435 to 460 in steps of 5; JAM54S30-xxx/MR/1500V, xxx= 390 to 425 in steps of 5; JAM60S21-xxx/MR/1500V, xxx= 355 to 390 in steps of 5; JAM50S40-xxx/MR/1500V, xxx= 490 to 500 in steps of 5; JAM72S20-xxx/MB/1500V, xxx= 450 to 465 in steps of 5; JAM60S20-xxx/MB/1500V, xxx= 375 to 390 in steps of 5; [...] JAM78S30-xxx/MR/1000V, xxx= 580 to 605 in steps of 5; JAM72S30-xxx/MR/1000V, xxx=510 to 555 in steps of 5; JAM66S30-xxx/MR/1000V, xxx=470 to 505 in steps of 5; JAM60S30-xxx/MR/1000V, xxx=435 to 460 in steps of 5; JAM54S30-xxx/MR/1000V, xxx= 390 to 425 in steps of 5; JAM60S21-xxx/MR/1000V, xxx= 355 to 390 in steps of 5; JAM50S40-xxx/MR/1000V, xxx= 490 to 500 in steps of 5; JAM72S20-xxx/MB/1000V, xxx= 450 to 465 in steps of 5; JAM60S20-xxx/MB/1000V, xxx= 375 to 390 in steps of 5; [...] xxx= 380 to 390 in steps of 5; JAM60S17-xxx/PR, xxx= 315 to 325 in steps of 5; JAM72S17-xxx/MR, xxx= 390 to 430 in steps of 5; JAM60S17-xxx/MR, xxx= 315 to 355 in steps of 5; JAM72S10-xxx/MB, xxx= 395 to 415 in steps of 5; JAM60S10-xxx/MB, xxx= 330 to 345 in steps of 5; JAM72S20-xxx/MR, xxx= 430 to 470 in steps of 5; JAM60S20-xxx/MR, xxx= 355 to 390 in steps of 5; JAM78S10-xxx/MR-J, xxx= 435 to 465 in steps of 5; JAM78S30-xxx/MR, xxx= 580 to 605 in steps of 5; JAM72S30-xxx/MR, xxx=510 to 555 in",
        "score": 0.685971,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0218/20220218094931164.pdf",
        "title": "[PDF] JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This Installation Manual contains essential information for electrical and mechanical installation that you must know before handling,.",
        "score": 0.6821721,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0108/8d54f07291ef4fb.pdf",
        "title": "[PDF] JA Solar PV Single-glass Modules Installation Manual",
        "snippet": "team. Please make sure the modules are properly installed and keep the warranty valid. 5.2 Installation methods Modules can be installed on the racks by clamps or hooks. Modules must be installed according to the following examples and recommendation. If not mounting the modules according to these instructions, please in advance consult JA Solar and must be approved by JA solar, otherwise may damage modules and void the warranty. 5.2.1 Modules installed with mounting hole Modules should be [...] +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM72S40 GR Series (30mm frame) +5400/-2400 +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM78S30 MRSeries (30mmframe) +5400/-2400 N/A +5400/-2400 N/A N/A ±2400 JAM78S30 GR Series (30mmframe) +5400/-2400 N/A +5400/-2400 N/A N/A ±2400 JAM72S30 LR Series (30mmframe) +5400/-2400 +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM72S40 MR Series (30mmframe) +5400/-2400 +5400/-2400 +5400/-2400 ±1000 ±1800 ±2400 JAM72S40 LR Series (30mmframe) +5400/-2400 +5400/-2400 [...] +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM78S30 GRSeries +5400/-2400 +5400/-2400 +5400/-2400 N/A N/A ±2400 JAM54S40 GR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S30 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S40 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S41 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S42 LR Series +5400/-2400 +2400/-2400 +5400/-2400 ±1600 N/A ±2400 JAM54S43 LR Series",
        "score": 0.67192334,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2025/0331/049eee3ed8ee930.pdf",
        "title": "JA Solar PV MODULES INSTALLATION MANUAL",
        "snippet": "This manual contains essential electrical and mechanical installation information, safety instructions, and requires qualified personnel. Do",
        "score": 0.57894874,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2021/0706/20210706053524693.pdf",
        "title": "[PDF] JAM72S30 525-550 MR",
        "snippet": "Shanghai JA Solar Technology Co., Ltd. Measurement tolerance at STC: Pmax ±3 %, Voc ±3% and Isc ±4%.",
        "score": 0.3478034,
        "bucket": "installation"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/fujian/2024/0807/f93000c02f65796.pdf",
        "title": "[PDF] Limited Warranty for JA Solar Brand Crystalline Solar PV Modules",
        "snippet": "(hereinafter referred to as \"Limited Product Warranty Period”) that the Modules (together with the factory-assembled DC connectors and cables); when installed; used; and serviced under normal operating conditions and in accordance with the JA Solar module installation manual; product technical specifications and maintenance manual (which; if not provided in the supply contract; can be downloaded from JA Solar' official website at www.jasolar.com) will: be free from any defects in design; [...] 晶澳太阳能组件产品有限质保书 Q/JASO-QAM-125-Aus A/11-Aus Limited Warranty for JA Solar Brand Crystalline Solar PV Modules This Limited Warranty for JA Solar Brand Crystalline Solar PV Modules (hereinafter referred to as “Limited Warranty”) is issued by JA Solar Technology Co., Ltd. (JA SOLAR TECHNOLOGY CO., LTD.)., which is headquartered at Building No.8, Nuode Center, Automobile Museum East Road, Fengtai District, Beijing, China (100160), or its legal successors or assigns (hereinafter collectively referred [...] drastic changes in such environments; including but not limited to extreme heat; acidic rainfall (including snow); blowing sand; corrosiveness; salty air (e.g. marine environment); contaminated air; soil or groundwater; abnormal levels of oxidation; mold; or any nearby fire; explosion; smoke; or charring. 10) Damage caused by force majeure such as natural disasters; including but not limited to lightning; hail; frost; snow; storms; tidal waves; floods; extreme temperatures; earthquakes;",
        "score": 0.683948,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2018/0518/20180518102313951.pdf",
        "title": "[PDF] Limited Warranty for PV Modules",
        "snippet": "this Limited Product Warranty and shall not extend beyond the period set forth herein. This Limited Product Warranty does not warranty a specific power output at or during any time frame, which shall be exclusively covered under Section 2 of this Warranty hereinafter (“Limited Peak Power Warranty”) 2. Limited Peak Power Warranty– Limited Remedy JA Solar warrants that for a period of thirty years starting from the Warranty Commencement Date, loss of power output against the minimum “Peak Power [...] A/0 1 / 5 Limited Warranty for PV Double-Glass Modules JA Solar Holdings Co., Ltd., and on behalf of ALL its DIRECTLY AND indirectly owned and controlled subsidiary, INCLUDING BUT NOT LIMITED TO Shanghai JA Solar Technology Co., Ltd.-(hereinafter jointly referred to as “JA Solar”) warrants its Photovoltaic Solar modules‟ (MODULES) performance starting from the date of sale to the first customer installing (for their own use) the modules (“Customer”) or starting at the latest 6 months after [...] modules dispatch from the JA Solar factory, whichever occurs earlier (the “Warranty Commencement Date”). 1. .Limited Product Warranty – Twelve Year Repair or Replacement JA Solar warrants that the MODULES together with the factory-assembled DC connectors and cables are free from any defects in materials and workmanship under normal application, usage, installation and service conditions for a period of one hundred and forty four (144) months from the Warranty Commencement Date. If MODULES",
        "score": 0.68191797,
        "bucket": "other"
      },
      {
        "url": "https://www.jasolar.com/uploadfile/2022/0923/20220923042219981.pdf",
        "title": "[PDF] JAM78S30 585-610 GR 35框78Pro",
        "snippet": "The JAM78S30 585-610 GR 35 module is a 610W half-cell module with 11BB PERC cells, 12-year warranty, 0.55% annual degradation over 25 years,",
        "score": 0.5674818,
        "bucket": "other"
      }
    ]
  }
]