[
  {
    "manufacturer": "sunpro-solar",
    "product": "Sunpro Solar P360",
    "candidates": [
      {
        "url": "https://www.enfsolar.com/Product/pdf/Crystalline/5b908b567df7e.pdf",
        "title": "[PDF] Untitled - SUNPRO - ENF Solar",
        "snippet": "Product Specification. Dimensions and Structure. Electrical Specification(STC). 350W 355W. 360W. 365W 370W. Max.power pm[W]. 350. 355. 360. 365. 370. 992. Power",
        "score": 0.70750624,
        "bucket": "datasheets"
      },
      {
        "url": "https://sunpowerglobal.com/au/sites/default/files/2019-12/sp_MAX2-360-350-340-COM_ds_en_au_a4_mc4_532419A.v3.pdf",
        "title": "[PDF] | 360 W - TCL SunPower Global",
        "snippet": "(Voc) 70.6 V 70.3 V 70.0 V Short-Circuit Current (Isc) 6.50 A 6.48 A 6.46 A Max. System Voltage 1000 V IEC Maximum Series Fuse 20 A Power Temp Coef. −0.35% / oC Voltage Temp Coef. −197.6 mV / oC Current Temp Coef. 2.6 mA / oC Tests And Certifications Standard Tests 8 IEC 61215, IEC 61730 Quality Management Certs ISO 9001:2015, ISO 14001:2015 EHS Compliance RoHS (Pending), OHSAS 18001:2007, lead free, REACH SVHC-163 (Pending) Sustainability Cradle to Cradle CertifiedTM (Pending) Ammonia Test IEC [...] 550 kg/m² front Frame Class 2 silver anodized A. Cable Length: 1200 mm +/-10 mm B. LONG SIDE: 32 mm SHORT SIDE: 24 mm FRAME PROFILE 1690 mm 1046 mm 40 mm 40 mm (A) (B) Please read the safety and installation guide. Electrical Data SPR-MAX2-360-COM SPR-MAX2-350-COM SPR-MAX2-340-COM Nominal Power (Pnom) 7 360 W 350 W 340 W Power Tolerance +5/0% +5/0% +5/0% Panel Efficiency 20.4% 19.8% 19.2% Rated Voltage (Vmpp) 59.1 V 57.9 V 56.6 V Rated Current (Impp) 6.09 A 6.05 A 6.00 A Open-Circuit Voltage [...] Materials and Resources credit categories. 7 Standard Test Conditions (1000 W/m² irradiance, AM 1.5, 25° C). NREL calibration Standard: SOMS current, LACCS FF and Voltage. 8 Class C fire rating per IEC 61730. 9 Safety factor 1.5 included. Designed in USA Made in Malaysia (Cells) Modules Assembled in Mexico Visit www.sunpower.com.au for more information. Specifications included in this datasheet are subject to change without notice. ©2019 SunPower Corporation. All rights reserved. SUNPOWER, the",
        "score": 0.6894943,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.austraenergy.com.au/wp-content/uploads/2023/03/Sunpro_SPxxx-120M_360-390W_Datasheet-c.pdf",
        "title": "[PDF] Sunpro SPxxx-120M (360-390W) Datasheet - Austra Energy",
        "snippet": "The leading solar cell cutting process and multi busbar design with. SUNPRO Technology. HIGH EFFICIENCY. Efficiency can reach. 21.41%. Excellent low light.",
        "score": 0.6711479,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.suparule.co.za/CATen-2019-web.pdf",
        "title": "[PDF] Energy-efficient, comfortable, versatile Catalogue 2019",
        "snippet": "... solar support. - Legionella protection program. - Screed drying program ... P360-100 UP GR. 1030601. 7612748005112. 186. theMova P360-100 UP WH. 1030600.",
        "score": 0.5342973,
        "bucket": "datasheets"
      },
      {
        "url": "https://sunprosolar.hu/wp-content/uploads/2022/11/Bifacial-SunPro-Dawn-M6-Mono-PERC-halfcut-datasheets.pdf",
        "title": "[PDF] M6 HIEFF TWIN MONO - Sunpro Power",
        "snippet": "Higher yield per surface area, lower BOS costs, higher power classes, and an effciency rate of up to 20.86%. PRODUCT WITH HIEFF BY. SUNPRO TECHNOLOGY. SUNPRO",
        "score": 0.40028095,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.kvk-electro.com.ua/fileadmin/kaplina/Theben/Catalogues/Theben_catalogue_KNX_2022_EN.pdf",
        "title": "[PDF] Smart automation, intelligently networked",
        "snippet": "The iON 108 KNX room controller with LCD and integ- rated room thermostat features a Bluetooth interface to make it easier to use. All tac- tile sensors come",
        "score": 0.04539074,
        "bucket": "datasheets"
      },
      {
        "url": "https://device.report/m/d462716116cb4c8bd9e3c148b9863942ee41abcf2fc54f8c849d1e19adec6e07.pdf",
        "title": "[PDF] Our entire story starts in 1921 with the introduction of the first swivel ...",
        "snippet": "The first ELPA automatic time switch with pendulum and mercury tube contact goes into mass production. This marks the beginning of an in-.",
        "score": 0.025028326,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/installationintroductionsingleglass.pdf",
        "title": "[PDF] S 尚SUNPRO PV MODULES INSTALLATION MANUAL 尚博太阳能 ...",
        "snippet": "备注：该工作环境温度为安装地点月平均最高温度和最低温度。太阳能光伏组件所能承受的机械载荷是由安装 方式来决定的，机械负载压力：设计压力为3600（前）/1600（后），安全系数为1.5。 Notes: - The mechanical load bearing is dependent upon the mounting methods used and failure to follow the instructions of this manual may result in different capabilities to withstand snow and wind loads. The system installer must ensure that the installation methods used meet these requirements and any local codes and regulations. [...] 该组件具有C级防火等级(加拿大)或模块防火性能类型4(美利坚合众国)，必须安装在具有适当防火性能的屋顶 上。 Sunpro Power Modules can be mounted in landscape and portrait orientation however the impact of dirt shading the solar cells can be minimized by orienting the product in portrait.\nSunpro Power 组件可以横向和纵向安装，但是通过纵向放置产品可以最大限度地减少灰尘遮蔽太阳能电池的 影响。 Avoid using a mounting method that will block the drainage holes in the module frame. [...] 两块相邻组件之间的最小间隙不能小于10mm。 The module frame drain holes cannot be blocked in any situation during installation or use.\n安装或使用过程中，排水孔在任何情况下都不能堵塞。 To maximize mounting longevity, Zhejiang Sunpro strongly recommends the use of corrosion proof (stainless steel) attachment hardware.",
        "score": 0.7380092,
        "bucket": "installation"
      },
      {
        "url": "https://saegroup.com.au/wp-content/uploads/Powerwave-Installation-Guidev2.pdf",
        "title": "[PDF] regular modules installation manual - SAE Group",
        "snippet": "this class, and adequate ventilation must be ensured between the back of the module and the installation surface. A safe working area also must be left between the edge of the roof and the external edge of the Solar array. In the case of residential installations on the ground, modules must be installed following local regulations, e.g. using fence. Sunpro Power Modules can be mounted in landscape and portrait orientation however the impact of dirt shading the solar cells can be minimized by [...] an optimized tilt angle to maximize the energy output. For detailed information on the best installation angle, please refer to standard Solar photovoltaic installation guides or consult a reputable Solar installer or systems integrator. Dust building up on the surface of the modules can impair module performance.YuHuan Sunpro Solar recommends installing the modules with a tilt angle of at least 10°, making it easier for dust to be washed off by rain. Any faults caused by and/or attributable to [...] Maximum Power Voltage (Vmp) 36.1 36.3 36.5 36.7 37 37.2 37.4 37.6 Maximum Power Current (Imp) 8.87 8.96 9.05 9.13 9.19 9.28 9.36 9.45 Open Circuit Voltage (Voc) 43.2±2% 43.4±2% 43.6±2% 43.8±2% 44.1±2% 44.3±2% 44.5±2% 44.7±2% Short Circuit Current (Isc) 8.87±4% 8.964% 9.054% 9.134% 9.194% 9.284% 9.364% 9.454% Maximum Series Fuse 25 25 25 25 25 25 25 25 Rated Power (Pmp) 360 365 370 375 485 490 495 500 Power Sorting 0~+4.99W 0~+4.99W 0~+4.99W 0~+4.99W 0~+4.99W 0~+4.99W 0~+4.99W 0~+4.99W Power",
        "score": 0.6638657,
        "bucket": "installation"
      },
      {
        "url": "https://www.newntide.com/wp-content/uploads/2024/11/Sunpro-Series-Installation-Users-Manual.pdf",
        "title": "[PDF] Installation & User's Manual - newntide",
        "snippet": "Installation & User’s Manual Sunpro Series Monoblock Unit IMPORTANT NOTE: Thank you very much for purchasing our product. Before using your unit, please read this manual carefully and keep it for future reference. [...] 3 Pull out the top cover upwards 2.Remove The Front Service Panel 1 Remove the six screws in the upper and lower parts of the front service plate.\n2 Push the front service panel upwards.\n3 And then take off the panel as shown.\n3.Remove The Air Guide Panel 1 Remove the eleven screws from the side of the air guide panel.\n2 Remove the left panel by pushing the air guide panel upwards.\n4.Remove The Back Net 1 Remove the six screws of the back net.\n2 Remove the back net. [...] 3 Pull out the top cover upwards 2.Remove The Front Service Panel 1 Remove the four screws in the upper and lower parts of the front service plate.\n2 Push the front service panel upwards.\n3 And then take off the panel as shown.\n3.Remove The Air Guide Panel 1 Remove the nine screws of the air guide panel.\n2 Pull out the panel upward to remove.\n4.Remove The Back Net 1 Remove the eight screws of the back net.\n2 Remove the back net.\n5.Remove The Left Panel 1 Remove the six screws in the left panel.",
        "score": 0.6388584,
        "bucket": "installation"
      },
      {
        "url": "https://www.austraenergy.com.au/wp-content/uploads/2023/08/Sunpro_PV_Install_Manual_Single_Glass-v08-2023.pdf",
        "title": "[PDF] SUNPRO PV MODULES INSTALLATION MANUAL - Austra Energy",
        "snippet": "This general manual applies to the installation, maintenance and use of the single glass Solar modules manufactured by Zhejiang Sunpro Power Technology co.",
        "score": 0.63234437,
        "bucket": "installation"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2023/11/10/spxxx-120m365-385w%E9%BB%91%E6%A1%86.pdf",
        "title": "[PDF] SPxxx-120M black frame (365-385W) - Sunpro Power",
        "snippet": "The leading solar cell cutting process and multi busbar design with. SUNPRO Technology. Snow load 5400Pa. Wind load 2400Pa. Linear output power",
        "score": 0.48352703,
        "bucket": "installation"
      },
      {
        "url": "https://www.goled.cz/wp-content/uploads/2024/08/cerny-monokrystalicky-solarni-panel-410wp-tuv-licence-1.pdf",
        "title": "[PDF] TEST REPORT IEC 61215-series:2016 Terrestrial photovoltaic (PV ...",
        "snippet": "Installation manual. Version: SP202001. Drawings mechanical. Refer to Annex 2: 704062011501-00 part 2 of 2. Circuit diagram. Refer to Annex 2: 704062011501-00.",
        "score": 0.40042162,
        "bucket": "installation"
      },
      {
        "url": "https://img.bretts.com.au/Sunpro-electric-collector.pdf",
        "title": "[PDF] Solar Collector Installation Guide and Parts List - Bretts",
        "snippet": "Carefully remove all packaging and transit protection from the heater before installation. Dispose of the packaging responsibly using re-cycling facilities.",
        "score": 0.23012334,
        "bucket": "installation"
      },
      {
        "url": "http://spo.hawaii.gov/wp-content/uploads/2014/01/2011-EPG-FINAL_WEB.pdf",
        "title": "[PDF] ENVIRONMENTAL PRODUCT GUIDE for Hawaiʻi 2011",
        "snippet": "• TOXICITY This column gives information about the presence or absence of hazardous chemicals (ex.: mercury-free), such as formaldehydes, lead, PVC, and others, as well as compliance with California Proposition 65 (CAL Prop 65) • LIFESPAN AND WARRANTY The more durable a product is, the lower the replacement rate and the higher the amount of waste diverted from landfills. A long warranty confirms the quality and durability properties of the product. • ENVIRONMENTALLY PREFERABLE FEATURES - [...] attributes.  products/  National Fenestration Rating Council (NFRC) Windows, doors, skylights, and at­ tachment products • Energy performance (compliance with ASHRAE 90.1 and IECC):U-factor, Solar Heat Gain, etc Independent rating and label­ ing system for the energy performance of fenestration products.  search/Searchdefault.aspx  THIRD-PARTY CERTIFICATION PROGRAMS - Table 1. for Products (cont.) Return to Table Of Contents 20 Logo Name (bullets indicate label cat­ egories) Target Group [...] on their performance.  LEED: Leadership in Energy and Environmental Design • LEED Certified • LEED Silver • LEED Gold • LEED Platinum New and existing commercial and in­ stitutional buildings, homes • U.S Green Building Council (USGBC), 1998 • Canada Green Build­ ing Council Being now in its 3rd version, LEEDv3. It is probably the best known classification system for building and comunities design. LEED was adapted by the Canada Green Building Council to LEED Canada-NC v1.0 in 2003, which was",
        "score": 0.21172671,
        "bucket": "installation"
      },
      {
        "url": "https://www.sec.gov/Archives/edgar/data/1419612/000117891325001374/zk2533031.pdf",
        "title": "[PDF] SOLAREDGE TECHNOLOGIES, INC. - SEC.gov",
        "snippet": "System owners receive credit for the energy that the solar installation generates to offset energy usage at times when the solar installation is",
        "score": 0.18515061,
        "bucket": "installation"
      },
      {
        "url": "https://gzhls.at/blob/ldb/a/2/e/3/09c3e5ec85e8cba2afbde88c3146e08149b4.pdf",
        "title": "[PDF] SPxxx-120M (360-390W)",
        "snippet": "Tier1 Lloyd's Syndicate 1910 SUNPRO Standard tiered warranty Industry Standard SUNPRO Standard(Additional value from 25-year warranty 25 Yr quality guarantee | 25 Yr power warranty ) YEARS 25 ISO14001 ISO9001 ISO45001 10 5 0 20 25 60% 70% 80% 90% 83.8% 91.9% 98% 100% 15 12 1 Year 370W Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Module Efficiency(%) Max system voltage Maximum Series Fuse Rating 375W 380W 385W DC 1500V(TUV) [...] www.sunpropower.com 2400Pa WARRANTY & GUARANTEE Linear output power guarantee 12 years: 91.9% power output 25 years: 83.8% power output HIGH EFFICIENCY Efficiency can reach 21.41%. Excellent low light performance. Higher power output under the conditions of haze, overcast, etc. [...] ISO 9001, ISO14001, ISO45001 TUV, CE, WEEE, INMETRO FIRE CERTIFICATE C1 and snow loads(5400 Pascal) -3%~+3% Junction box Warranties 25 years product warranty and 25 years 83 IP 68 .8% of power Temperature Characteristics Temp.Coeff.of Isc(TK Isc) Temp.Coeff.of Voc(TK Voc) Temp.Coeff.of Pmax(TK Pmax) Operating temperature Normal operating cell temperature 0.046%/ ℃ -0.26%/℃ -0.35%/℃ -40~+85℃ 45±2℃ Packing Configuration Container Pieces per pallet Pallets per container Pieces per container 40'HQ",
        "score": 0.76659125,
        "bucket": "other"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/warrantydocumentsingleglass.pdf",
        "title": "[PDF] Limited Warranty for PV Modules - Sunpro Power",
        "snippet": "application, installation, use and service conditions. If MODULES fail to conform to this warranty, then for a period ending 360 months from date of sale as shown in the invoice to the direct customer of Sunpro Power either repair or replace the product, or refund the purchase price as paid by the CUSTOMER. The repair or replacement or refund remedy shall be the sole and exclusive remedy provided under the “Limited Product Warranty” and shall not extend beyond the 360 months period set forth [...] Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. [...] have no responsibility or liability whatsoever for damage or injury to persons or property, or for other loss or injury resulting from any cause whatsoever arising out of or related to the MODULES, including, without limitation, any defects in the MODULE, or from use or installation. Under no circumstances shall Sunpro Power be liable for incidental, consequential or special damages, howsoever caused. Loss of use, Loss of profits, loss of production, loss of revenues are therefore specifically",
        "score": 0.75831425,
        "bucket": "other"
      },
      {
        "url": "https://sunpowerglobal.com/int/sites/default/files/2019-11/sp_X22_360_345_ds_UK_A4_MC4_527767.pdf",
        "title": "[PDF] SunPower® Residential Panel",
        "snippet": "Short-Circuit Current (Isc) 6.48 A 6.39 A Max. System Voltage 1000 V IEC & 600 V UL Maximum Series Fuse 15 A Power Temp Coef. −0.29% / o C Voltage Temp Coef. −167.4 mV / o C Current Temp Coef. 2.9 mA / o C Tests And Certifications Standard Tests 8 IEC 61215, IEC 61730, UL1703 (Type 2 Fire Rating) Quality Management Certs ISO 9001:2015, ISO 14001:2015 EHS Compliance RoHS, OHSAS 18001:2007, lead free, Recycle Scheme, REACH SVHC-163 Sustainability Cradle to Cradle CertifiedTM Silver. \"Declare.\" [...] listed. Ammonia Test IEC 62716 Desert Test 10.1109/PVSC.2013.6744437 Salt Spray Test IEC 61701 (maximum severity) PID Test 1000 V: IEC 62804, PVEL 600 hr duration Available Listings TUV, UL, MCS, FSEC, CEC 1 SunPower 360 W compared to a Conventional Panel on same-sized arrays (260 W, 16% efficient, approx. 1.6 m²), 4% more energy per watt (based on PVSyst pan files), 0.75%/yr slower degradation (Campeau, Z. et al. \"SunPower Module Degradation Rate,\" SunPower white paper, 2013). 2 Based on [...] front & back Snow: 5400 Pa, 550 kg/m² front Frame Class 1 black anodized (highest AAMA rating) FRAME PROFILE 1559 mm 46 mm 32 mm LONG SIDE 22 mm SHORT SIDE 46 mm 1046 mm (A) (A) Cable Length: 1000 mm +/-10 mm Please read the safety and installation guide. Electrical Data SPR-X22-360 SPR-X21-345 Nominal Power (Pnom) 7 360 W 345 W Power Tolerance +5/0% +5/0% Panel Efficiency 22.1% 21.2% Rated Voltage (Vmpp) 59.1 V 57.3 V Rated Current (Impp) 6.09 A 6.02 A Open-Circuit Voltage (Voc) 69.5 V 68.2 V",
        "score": 0.38338786,
        "bucket": "other"
      },
      {
        "url": "https://livingbuilding.gatech.edu/sites/default/files/2022-04/Sunpower%20Datasheet%20514617.pdf",
        "title": "[PDF] SunPower® X-Series Commercial Solar Panels | X22-360-COM",
        "snippet": "without notice. SunPower® X-Series Residential Solar Panels | X21-255 SunPower® X-Series Commercial Solar Panels | X22-360-COM [...] categories)9 Ammonia Test IEC 62716 Desert Test 10.1109/PVSC.2013.6744437 Salt Spray Test IEC 61701 (maximum severity) PID Test 1000V: IEC62804, PVEL 600hr duration Available Listings UL, TUV, CEC REFERENCES: 1 SunPower 360W compared to a Conventional Panel on same sized arrays (260W, 16% efficient, approx. 1.6 m2), 4% more energy per watt (based on 3pty module characterization and PVSim), 0.75%/yr slower degradation (Campeau, Z. et al. \"SunPower Module Degradation Rate,\" SunPower white paper, [...] Voltage (Vmpp) 59.1 V Rated Current (Impp) 6.09 A Open-Circuit Voltage (Voc) 69.5 V Short-Circuit Current (Isc) 6.48 A Max. System Voltage 1000 V UL & 1000 V IEC Maximum Series Fuse 15 A Power Temp Coef. −0.29% / o C Voltage Temp Coef. −167.4 mV / o C Current Temp Coef. 2.9 mA / o C Operating Condition And Mechanical Data Temperature −40° F to +185° F (−40° C to +85° C) Impact Resistance 1 inch (25 mm) diameter hail at 52 mph (23 m/s) Appearance Class B Solar Cells 96 Monocrystalline Maxeon Gen",
        "score": 0.35333946,
        "bucket": "other"
      },
      {
        "url": "https://es-media-prod.s3.amazonaws.com/media/components/panels/spec-sheets/Sunpower%20SPR-X22-360%20Datasheet.pdf",
        "title": "[PDF] SunPower® X-Series Residential Solar Panels | X22-360 - AWS",
        "snippet": "details, see extended datasheet: www.sunpower.com/datasheets. SunPower® X-Series Residential Solar Panels | X22-360 [...] 1558 mm [61.3 in] 1046 mm [41.2 in] 46 mm [1.8 in] 46 mm Please read the safety and installation guide. Electrical Data SPR-X22-360 Nominal Power (Pnom)11 360 W Power Tolerance +5/-0% Avg. Panel Efficiency12 22.2% Rated Voltage (Vmpp) 60.6 V Rated Current (Impp) 5.94 A Open-Circuit Voltage (Voc) 69.5 V Short-Circuit Current (Isc) 6.48 A Max. System Voltage 600 V UL & 1000 V IEC Maximum Series Fuse 15 A Power Temp Coef. –0.30% / o C Voltage Temp Coef. -167.4 mV / o C Current Temp Coef. 3.5 mA / [...] Panels Tests And Certifications Standard Tests13 UL1703 (Type 2 Fire Rating), IEC 61215, IEC 61730 Quality Certs ISO 9001:2008, ISO 14001:2004 EHS Compliance RoHS, OHSAS 18001:2007, lead free, REACH SVHC-163, PV Cycle Sustainability Cradle to Cradle (eligible for LEED points)14 Ammonia Test IEC 62716 Desert Test 10.1109/PVSC.2013.6744437 Salt Spray Test IEC 61701 (maximum severity) PID Test Potential-Induced Degradation free: 1000 V9 Available Listings UL, TUV, JET, CEC Operating Condition And",
        "score": 0.32178012,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "sunpro-solar",
    "product": "Sunpro Solar P400",
    "candidates": [
      {
        "url": "https://knowledge-center.solaredge.com/sites/kc/files/se-p-series-add-on-power-optimizer-datasheet-na.pdf",
        "title": "[PDF] POWER OPTIMIZER - Knowledge Center",
        "snippet": "P300 (for 60-cell modules) P400 (for 72 & 96-cell modules) P405 (for thin film modules) INPUT Rated Input DC Power(1) 300 400 405 W Absolute Maximum Input Voltage (Voc at lowest temperature) 48 80 125 Vdc MPPT Operating Range 8 - 48 8 - 80 12.5 - 105 Vdc Maximum Short Circuit Current (Isc) 10 Adc Maximum DC Input Current 12.5 Adc Maximum Efficiency 99.5 % Weighted Efficiency 98.8 % Overvoltage Category II OUTPUT DURING OPERATION (POWER OPTIMIZER CONNECTED TO OPERATING SOLAREDGE INVERTER) [...] series 128 x 152 x 27.5 / 5 x 5.97 x 1.08 128 x 152 x 35 / 5 x 5.97 x 1.37 128 x 152 x 48 / 5 x 5.97 x 1.89 mm / in Weight (including cables) Pxxx-2 series 950 / 2.1 gr / lb Pxxx-5 series 770 / 1.7 930 / 2.05 930 / 2.05 gr / lb Input Connector MC4 Compatible Output Wire Type / Connector Double Insulated; MC4 Compatible Output Wire Length 0.95 / 3.0 1.2 / 3.9 m / ft Operating Temperature Range -40 - +85 / -40 - +185 ˚C / ˚F Protection Rating Pxxx-2 series IP65 / NEMA4 Pxxx-5 series IP68 / NEMA6P [...] Maximum Output Current 15 Adc Maximum Output Voltage 60 85 Vdc OUTPUT DURING STANDBY (POWER OPTIMIZER DISCONNECTED FROM SOLAREDGE INVERTER OR SOLAREDGE INVERTER OFF) Safety Output Voltage per Power Optimizer 1 Vdc STANDARD COMPLIANCE EMC FCC Part15 Class B, IEC61000-6-2, IEC61000-6-3 Safety IEC62109-1 (class II safety), UL1741 RoHS Yes INSTALLATION SPECIFICATIONS Maximum Allowed System Voltage 1000 Vdc Dimensions (W x L x H) Pxxx-2 series 141 x 212 x 40.5 / 5.55 x 8.34 x 1.59 mm / in Pxxx-5",
        "score": 0.75464433,
        "bucket": "datasheets"
      },
      {
        "url": "https://knowledge-center.solaredge.com/sites/kc/files/se-P5-series-add-on-power-optimizer-datasheet-na.pdf",
        "title": "[PDF] Power Optimizer - Knowledge Center",
        "snippet": "respective owners. Date: April 24, 2023 DS-000044-NAM. Subject to change without notice. Power Optimizer For North America P400 / P401 / P485 / P505 Optimizer model (typical module compatibility) P400 (for 72 & 96-cell modules) P401 (for high power 60 and 72-cell modules) P485 (for high-voltage modules) P505 (for higher current modules) INPUT Rated Input DC Power(1) 400 430 485 505 W Absolute Maximum Input Voltage (Voc at lowest temperature) 80 60 125(2) 83(2) Vdc MPPT Operating Range 8 – 80 8 [...] Length (Power Optimizers) P400, P401 8 10 18 P485, P505 6 8 14 Maximum String Length (Power Optimizers) 25 25 50 Maximum Power per String 5700(7) (6000 with SE7600-US – SE11400-US) 5250(7) 6000(8) 12750(9) W Parallel Strings of Different Lengths or Orientations Yes (6) It is not allowed to mix P485/P505 with P400/P401 in one string. (7) A string with more than 30 optimizers does not meet NEC rapid shutdown requirements, safety voltage will be above the 30V requirement. (8) For the 208V grid, it [...] – 60 12.5 – 105 12.5 – 83 Vdc Maximum Short Circuit Current (Isc) 10.1 12.5 11 14 Adc Maximum Efficiency 99.5 % Weighted Efficiency 98.8 % Overvoltage Category II OUTPUT DURING OPERATION (POWER OPTIMIZER CONNECTED TO OPERATING SOLAREDGE INVERTER) Maximum Output Current 15 Adc Maximum Output Voltage 60 80 Vdc OUTPUT DURING STANDBY (POWER OPTIMIZER DISCONNECTED FROM SOLAREDGE INVERTER OR INVERTER OFF) Safety Output Voltage per Power Optimizer 1 ± 0.1 Vdc STANDARD COMPLIANCE EMC FCC Part 15 Class",
        "score": 0.7507177,
        "bucket": "datasheets"
      },
      {
        "url": "https://priwatt.de/wordpress/wp-content/uploads/2023/11/Datasheet-SUNPRO-SPDGxxx-N108M10%EF%BC%88410-440W.pdf?srsltid=AfmBOoqy7Sf-LaiXg-KkvPCC08YhpNwT1CUUhqUobE0IahBh_9A7Qlz7",
        "title": "[PDF] Datasheet-SUNPRO-SPDGxxx-N108M10（410-440W.pdf - Priwatt",
        "snippet": "ASSOCIATION ISO 9001 ISO 14001 OHSAS 18001 SA 8000 ISO 45001 62716 58042 410~440W I-V CHARACTERISTICS AT DIFFERENT IRRADIATION DIMENSIONS AND STRUCTURE Electrical parameters at standard test conditions (STC:AM=1.5, 1000W/m² ,Cells Temperature25 ) Electrical parameters at NMOT test conditions (Irradiance 800W/m²,Ambient Temperature 20 ,AM 1.5,Wind Speed 1m/s) Electrical Characteristics with 15% Rear Side Power Gain Mechanical Data Temperature Characteristics Packing Configuration Tests, [...] voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Typical type Dimensions Weight Glass Output cables Connectors Cell type Number of cells Temp.Coeff.of Isc(TK Isc) Temp.Coeff.of Voc(TK Voc) Temp.Coeff.of Pmax(TK Pmax) Operating temperature Normal operating cell temperature Container Pieces per pallet Pallets per container Pieces per container [...] Certifications and Warranties Length: + 2mm Width:+ 2mm Thickness:+ 1mm Hole pitch:+ 2mm ADD.: QINGGANG TECHNOLOGICAL IND. ZONE, YUHUAN CITY, ZHEJIANG PROVINCE, CHINA TEL: +86 0576-80730906 E-MAIL: info@sunpropower.com WEBSITE: www.sunpropower.com Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Module Efficiency(%) Max system voltage Maximum Series Fuse Rating Typical type Front power Pmax/W Total power Pmax/W Max power",
        "score": 0.6445166,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.researchgate.net/profile/Priyanka-Singh-20/publication/260429240_Enhanced_sun_protection_of_nano-sized_metal_oxide_particles_over_conventional_metal_oxide_particles_An_In-vitro_comparative_study/links/5ad096124585154f3f485537/Enhanced-sun-protection-of-nano-sized-metal-oxide-particles-over-conventional-metal-oxide-particles-An-In-vitro-comparative-study.pdf",
        "title": "[PDF] Enhanced sun protection of nanosized metal oxide particles over ...",
        "snippet": "Sunscreens used for the protection of human skin against the harmful effects of solar radiation must contain certain amounts of. UV-absorbing substances.",
        "score": 0.13279572,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.austraenergy.com.au/wp-content/uploads/2023/08/Sunpro_PV_Install_Manual_Single_Glass-v08-2023.pdf",
        "title": "Sunpro PV Modules Installation Manual (Single Glass) [Eng/Chi]",
        "snippet": "This general manual applies to the installation, maintenance and use of the single glass Solar modules manufactured by Zhejiang Sunpro Power Technology co.,Ltd (hereinafter referred to as “Zhejiang Sunpro ”).",
        "score": 0.69672287,
        "bucket": "installation"
      },
      {
        "url": "https://email.rekor.ai/hubfs/Solar%20Pro%20Solar%20Kit%20Installation%20Guide%20v1.0-1.pdf",
        "title": "[PDF] Solar Pro Solar Kit Installation Guide - Rekor",
        "snippet": "– 25° +15° 25 – 15° +5° 10 – 0° 15° Solar Pro Solar Kit Installation Guide Version 1.0 3 3 Solar Panel Hardware Mounting Instructions 3.1 Parts List Solar Pro Solar Kit Installation Guide Version 1.0 4 3.2 Side of Pole Mounts Hardware Note: • Apply anti-seize to all hardware to prevent galling • 1 ft-lb = 12 in-lb = 1.36 Nm • Use 5/16” hardware - > Mount assembly • Use 1/4\" hardware -> Mounting module to rails • Use 3/8” bolts -> Tilt leg spring nuts (if applicable) Solar Pro Solar Kit [...] installation instructions. There are several steps to this installation: • Calculate the Tilt and Azimuth according to the latitude and longitude (before installation). • Install the solar panels. • Install the antenna on the enclosure. • Install the enclosure: o Set the DIP switches and install the solar controller dongle on the control panel. o Install the Master Edge. o Mount the enclosure on the pole (using a spacing jig, if needed). o Install the batteries in the enclosure. • Connect the [...] connections are tight. Solar Pro Solar Kit Installation Guide Version 1.0 12 10. Mount the solar modules to the rails using the 1/4” hardware provided. 11. Solar Pro Solar Kit Installation Guide Version 1.0 13 4 Enclosure Setup 4.1 Control Panel Mounting The control panel is mounted on a mounting plate with a load panel mounted on a din rail. Solar Pro Solar Kit Installation Guide Version 1.0 14 1. Remove the second set of supplied nuts from the mounting studs located on the back top wall of",
        "score": 0.69573146,
        "bucket": "installation"
      },
      {
        "url": "https://kupfve.s22.cdn-upgates.com/b/b62b87f970830b-mnl-sunpro-manual-en.pdf",
        "title": "INSTALLATION MANUAL",
        "snippet": " Sunpro power modules are certified for operating in Class A installations at voltages below 1000Vdc. This maximum voltage should not be exceeded at any time and, as the voltage of the module increases, above data sheet values, at operating temperatures below 25°C, then these need to be taken into account when designing a PV system.\n Do NOT use water to extinguish fires of an electrical origin. [...]  Sunpro power recommends using the following grounding ways： a）Using Schleter for grounding. Connecting modules to the support structure according to the picture below. (Grounding accessories need pass the UL467 standard test.) Recommended torque is 20.5Nm For more information, please contact the supplier Schletter（http：//www.solar.schletter.de） Sharp point 10 b）The traditional way of grounding（Grounding accessories need pass the UL467 standard test and UL E34440/E6207 test.） For fully [...]  Sunpro power Modules have passed the test of PV modules salt mist corrosion ,and can be safely installed in corrosive salt areas within proximity of the ocean or sulfurous areas.\n Sunpro power Modules have passed the test of PV modules ammonia corrosion ,and can be safely installed in ammonia-heavy environments, such as farm houses.",
        "score": 0.6826801,
        "bucket": "installation"
      },
      {
        "url": "https://www.suntech-power.com/wp-content/uploads/download/Installation-Guide/Installation-Manual_GLOBAL.pdf",
        "title": "Installation-Manual_GLOBAL - Suntech Power",
        "snippet": "This installation manual contains important electrical and mechanical installation information as well as safety information that you must be familiar with, providing important safety instructions for the installation , use and maintenance of solar modules.",
        "score": 0.5134007,
        "bucket": "installation"
      },
      {
        "url": "https://www.newntide.com/wp-content/uploads/2024/11/Sunpro-Series-Installation-Users-Manual.pdf",
        "title": "[PDF] Installation & User's Manual - newntide",
        "snippet": "2 It must be installed on the ground, fixed ideally on a level concrete floor. Ensure that the floor is sufficiently stable and can support the weight of the unit.\n3 A water drainage device must be provided close to the unit in order to protect the area 26 where it is installed.\n4 If necessary, the unit may be raised by using suitable mounting pads designed to support its weight. [...] Max. Heating Capacity (kW) 11.04 13.50 16.81 22.29 Power Input (kW) 2.43 3.06 3.94 5.16 COP 4.54 4.41 4.27 4.32 Electric Heater Rated Input (kW) 3/6/9(optional) 3/6/9(optional) Max. Power Input (kW) 6.8(3.8+3) 9.8(3.8+6) 12.8(3.8+9) 7.7(4.7+3) 10.7(4.7+6) 13.7(4.7+9) 9.6(6.6+3) 12.6(6.6+6) 15.6(6.6+9) 9.6(6.6+3) 12.6(6.6+6) 15.6(6.6+9) Max. Running Current (A) 19.2(5.5+13.7) 14.6(5.5+9.1) 19.2(5.5+13.7) 21.5(7.8+13.7) 16.9(7.8+9.1) 21.5(7.8+13.7) 25.2(11.5+13.7) 20.6(11.5+9.1) 25.2(11.5+13.7) [...] Max. Heating Capacity (kW) 1.73~6.06 Power Input (kW) 0.28~1.31 COP 6.18~4.63 [Space Heating] Ambient Temp. (DB/WB): 7°C/6°C, Water Temp. (Inlet/Outlet): 50°C/55°C.\nMax. Heating Capacity (kW) 1.12~5.29 Power Input (kW) 0.26~2.03 COP 4.31~2.61 [Space Cooling] Ambient Temp. (DB/WB): 35°C / -, Water Temp. (Inlet/Outlet): 12°C/7°C.\nMax. Cooling Capacity (kW) 0.97~4.86 Power Input (kW) 0.21~1.76 EER 4.62~2.76 [Hot Water] Ambient Temp. (DB/WB): 20°C/15°C, Water Temp. from 15°C to 55°C.",
        "score": 0.47753036,
        "bucket": "installation"
      },
      {
        "url": "https://energydepot.com.au/wp-content/uploads/2021/03/Sunpower-Installation-manual.pdf",
        "title": "Energydepot Sunpower-Installation-manual.pdf - Energy Depot",
        "snippet": "low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 400 mm 700 mm 1058 mm 1300 mm 4X Ø4.2 mm Ground Holes 8X 10mm(L) x 7mm(W) R3.5mm Mounting Holes 8X 14mm(L) x 9mm(W) R4.5mm SLOTS 35mm 400 mm 539 mm 1058 mm 1423 mm 954 mm 2066 mm 998 mm 35 4X Ø4.2 mm Ground Holes Mounting Holes 4X Ø6.7 mm Mounting Holes 12X Ø6.8 mm 4X 5.0 mm (W) x 15.0 mm [...] 1000 W/m2, AM 1.5, 25° C Suitable for ungrounded, positive, or negative grounded DC systems Field Wiring: Cu wiring only, min. 12 AWG/4 mm2, insulated for 90° C min. WARNING SEVERE ELECTRICAL HAZARD • Solar module has full voltage even in very low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 954 mm 961 mm 2067 mm 300 mm 400 mm 539 mm [...] AWG/4 mm2, insulated for 90° C min. WARNING SEVERE ELECTRICAL HAZARD • Solar module has full voltage even in very low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 954 mm 961 mm 2067 mm 400 mm 539 mm 1058 mm 1200 mm 1423 mm 1606 mm 4X Ø 4.2mm Ground Holes 18X Ø 6.8mm Mounting Holes 4X 5.0mm (W) x 15.0mm (L) SLOT 32mm 40 mm 24 mm 40 mm 4x",
        "score": 0.4671622,
        "bucket": "installation"
      },
      {
        "url": "https://img.bretts.com.au/Sunpro-electric-collector.pdf",
        "title": "[PDF] Solar Collector Installation Guide and Parts List - Bretts",
        "snippet": "Step 8 • Repeat the process for the second collector. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken.\nStep 9 • Now position the top mounting rail and repeat the above steps for that rail.\n• Join the top connections with the brass compression fittings supplied. [...] Description Illustration PK5007 PK5008 PK5010 PK5014 PK5015 SFT4 PK5016 PK5017 PK5018 H3350 Union 1\" Conetite × ½\" Conetite 1 1 1 1 1 1 1 H3351 Union 1\" Conetite × 1\" Conetite 2 2 2 2 2 H3353 End Stop 1\" Conetite 2 2 2 2 2 2 2 4-Way Manifold Assembly 1 1 1 1 1 1 1 H60-1063 Automatic Air Vent Valve (200°C) 1 1 1 1 1 1 1 AFV60F Anti Frost Protection Valve 1 H3692 Manual 1 1 1 1 1 1 1 1 H3322 Mounting Rail Joiner 3rd Rail 2 H60-4006 Collector Strap 4 2 4 4 4 H60-6008 Collector Clamp (Z) Bracket 8 [...] • Ensure collector strap is located on truss vertically.\n• Repeat this process for the collector strap at the other end of the mounting rail.\nStep 5 • Once the bottom rail has been secured, the collector can now be lifted on to the roof. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken.",
        "score": 0.3804832,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaredge.com/sites/default/files/se-single-and-three-phase-inverter-quick-installation-guide-na.pdf",
        "title": "SolarEdge 1 SolarEdge Quick Installation Guide – North America",
        "snippet": "Ethernet connection (CAT5/6), ZigBee, GSM, Cellular 4.5-7 mm 2 (PG 13.5) All three RS485 2.5-5 mm Cable Specifications  Ethernet:  Cable type – a shielded Ethernet cable (Cat5/5E STP) may be used  Maximum distance between the inverter and the router – 100 m/ 330 ft.  RS485:  Cable type: Min. 3-wire shielded twisted pair (a shielded Ethernet cable (Cat5/5E STP) may be used)  Wire cross-section area: 0.2- 1 mm²/ 24-18 AWG (a CAT5 cable may be used)  Maximum nodes: 32  Maximum distance [...] single phase inverter 3-7.6 kW The inverter is supplied with a mounting bracket. 5 Install the mounting bracket on the wall with the flat side of the bracket is at the bottom. 6 Hang the inverter on the bracket: Align the two indentations in the inverter enclosure with the two triangular mounting tabs of the bracket, and lower the inverter until it rests on the bracket evenly.Secure the inverter to the bracket using the two supplied 5mm screws. NOTE: When mounting the inverter on an uneven [...] LCD indique que la tension DC est sécurisée (<50V) ou attendre cinq minutes avant d’ouvrir le couvercle ou de déconnecter les strings. Setting up Communication Two communication glands are used for connection of the various inverter communication options. Each gland has three openings. The table below describes the functionality of each opening. Unused openings should remain sealed. Gland# Opening Functionality Cable Size (diameter) 1(PG 16) One small External antenna cable 2-4 mm Two large",
        "score": 0.36683974,
        "bucket": "installation"
      },
      {
        "url": "https://www.spiedigitallibrary.org/journals/journal-of-biomedical-optics/volume-19/issue-11/115005/Film-thickness-frequency-distribution-of-different-vehicles-determines-sunscreen-efficacy/10.1117/1.JBO.19.11.115005.pdf",
        "title": "Film thickness frequency distribution of different vehicles determines ...",
        "snippet": "Abstract. Sun protection factor (SPF) frequently differs between sunscreens containing the same composition of ultraviolet (UV) filters that primarily",
        "score": 0.05007463,
        "bucket": "installation"
      },
      {
        "url": "https://moscow.sci-hub.st/2338/925cea08d4535cfe11b1d9fb757e9144/10.1016@j.yrtph.2014.02.014.pdf",
        "title": "[PDF] Photoprotective characteristics of natural antioxidant polyphenols",
        "snippet": "Fourteen natural polyphenols belonging to the classes of stilbenes, flavonoids and hydroxycinnamic acid derivatives, have been investigated in order to",
        "score": 0.030447299,
        "bucket": "installation"
      },
      {
        "url": "https://nwsolar.com/wp-content/uploads/2022/02/power-optimizer-datasheet-na.pdf",
        "title": "[PDF] POWER OPTIMIZER",
        "snippet": "P400 (for 72 & 96-cell modules) P405 (for thin film modules) P505 (for higher current modules) INPUT Rated Input DC Power(1) 320 340 370 400 405 505 W Absolute Maximum Input Voltage (Voc at lowest temperature) 48 60 80 125(2) 83(2) Vdc MPPT Operating Range 8 - 48 8 - 60 8 - 80 12.5 - 105 12.5 - 83 Vdc Maximum Short Circuit Current (Isc) 11 10.1 14 Adc Maximum DC Input Current 13.75 12.63 17.5 Adc Maximum Efficiency 99.5 % Weighted Efficiency 98.8 98.6 % Overvoltage Category II OUTPUT DURING [...] 1,000W (8) For SE30KUS/SE33.3KUS/SE66.6KUS/SE100KUS: It is allowed to install up to 15,000W per string when 3 strings are connected to the inverter (3 strings per unit for SE66.6KUS/SE100KUS) and when the maximum power difference between the strings is up to 2,000W Power Optimizer For North America P320 / P340 / P370 / P400 / P405 / P505 Optimizer model (typical module compatibility) P320 (for 60-cell modules) P340 (for high-power 60-cell modules) P370 (for higher-power 60 and 72-cell modules) [...] / -40 - +185 ˚C / ˚F Protection Rating IP68 / NEMA6P Relative Humidity 0 - 100 % (1) Rated STC power of the module. Module of up to +5% power tolerance allowed (2) NEC 2017 requires max input voltage be not more than 80V (3) For other connector types please contact SolarEdge PV System Design Using a SolarEdge Inverter(4)(5) Single Phase HD-Wave Single phase Three Phase 208V Three Phase 480V Minimum String Length (Power Optimizers) P320, P340, P370, P400 8 10 18 P405 / P505 6 8 14 Maximum String",
        "score": 0.69968605,
        "bucket": "other"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/warrantydocumentsingleglass.pdf",
        "title": "[PDF] Limited Warranty for PV Modules - Sunpro Power",
        "snippet": "application, installation, use and service conditions. If MODULES fail to conform to this warranty, then for a period ending 360 months from date of sale as shown in the invoice to the direct customer of Sunpro Power either repair or replace the product, or refund the purchase price as paid by the CUSTOMER. The repair or replacement or refund remedy shall be the sole and exclusive remedy provided under the “Limited Product Warranty” and shall not extend beyond the 360 months period set forth [...] Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. [...] have no responsibility or liability whatsoever for damage or injury to persons or property, or for other loss or injury resulting from any cause whatsoever arising out of or related to the MODULES, including, without limitation, any defects in the MODULE, or from use or installation. Under no circumstances shall Sunpro Power be liable for incidental, consequential or special damages, howsoever caused. Loss of use, Loss of profits, loss of production, loss of revenues are therefore specifically",
        "score": 0.68874115,
        "bucket": "other"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/datasheet-spdgxxx-n108m10%EF%BC%88410-440w%EF%BC%89fullblack-30mm.pdf",
        "title": "[PDF] SPDGxxx-N108M10 - Sunpro Power",
        "snippet": "ASSOCIATION ISO 9001 ISO 14001 OHSAS 18001 SA 8000 ISO 45001 1234567895555 XXXXXXXXXXXXX XXXXXXXXXXXXX 30±1 1134±1 1722±1 I-V CHARACTERISTICS AT DIFFERENT IRRADIATION DIMENSIONS AND STRUCTURE Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Module Efficiency(%) Bifaciality Coef (φPmax/φVoc/φIsc) 80%/95%/80% Max system voltage Maximum Series Fuse Rating Electrical parameters at standard test conditions (STC:AM=1.5, 1000W/m² ,Cells [...] Withstand extreme wind(2400 Pascal) and snow loads(5400 Pascal) ±3% Junction box Warranties IP 68 30 years product warranty and 30 years 87.4% of power System certs Certifications ISO 9001, ISO14001, ISO45001 OHSAS 18001 , SA 8000 TÜV, CE, CEC,WEEE, INMETRO FIRE CERTIFICA C1 Standard tests IEC 61215, IEC 61730 Connectors 30A DC 1500V (TÜV,UL) 425W 425 31.64 13.44 38.24 14.16 21.76 420W 420 31.49 13.34 38.13 14.07 21.51 415W 415 31.37 13.23 38.04 13.96 21.25 410W 410 31.25 13.12 37.94 13.85 21 [...] Temperature25 ) Typical type Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Typical type Electrical parameters at NMOT test conditions (Irradiance 800W/m²,Ambient Temperature 20 ,AM 1.5,Wind Speed 1m/s) Mechanical Data Dimensions Weight Glass Output cables 1722x1134x30mm 23.3kg 4mm², symmetrical lengths 1100mm Cell type Number of cells N type Mono-Crystalline , 16BB , 182x91mm 108 cells ( Half-Cell ) Temperature Characteristics",
        "score": 0.6194488,
        "bucket": "other"
      },
      {
        "url": "https://priwatt.de/wordpress/wp-content/uploads/2023/11/Datasheet-SUNPRO-SPDGxxx-N108M10%EF%BC%88410-440W.pdf?srsltid=AfmBOorbB7PKaVtUjtlziRSiBt7erETy_825GkAcirpDpEyPbd4dH7a3",
        "title": "[PDF] Datasheet-SUNPRO-SPDGxxx-N108M10（410-440W.pdf - Priwatt",
        "snippet": "Extreme wind and snow loads testing Power tolerance Junction box Warranties System certs Certifications Standard tests Withstand extreme wind(2400 Pascal) and snow loads(5400 Pascal) 0~+5W IP 68 25 years product warranty and 30 years 87.4% of power ISO 9001, ISO14001, ISO45001 TÜV, CE, CEC, UL, WEEE IEC 61215, IEC 61730, IEC 61701, IEC 62716, PPP 58042 0.046%/ -0.25%/ -0.30%/ -40~+85 45±2 40'GP 72 13 936 1722x1134x30mm 25.5kg (F) 2.0mm ultra clear embossed double layer colorless glass (B) 2.0mm [...] SPDG -N108M10 · · Full black Double glass Black frame Sliver frame · · M10 TOPCON MONO SUNPRO Standard tiered warranty 25 Yr quality guarantee | 30 Yr power warranty Common module SUNPRO TOPCon module (Additional value from 30-year warranty) 0 5 10 20 25 30 60% 70% 80% 90% 99% 100% 15 1 Year www.sunpropower.com YEARS Tier1 87.4% 89.4% WITHSTAND STRONG WARRANTY & GUARANTEE Linear output power guarantee 25 years: 89.4% power output 30 years: 87.4% power output Snow load 5400Pa Wind load 2400Pa PID [...] Certifications and Warranties Length: + 2mm Width:+ 2mm Thickness:+ 1mm Hole pitch:+ 2mm ADD.: QINGGANG TECHNOLOGICAL IND. ZONE, YUHUAN CITY, ZHEJIANG PROVINCE, CHINA TEL: +86 0576-80730906 E-MAIL: info@sunpropower.com WEBSITE: www.sunpropower.com Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Module Efficiency(%) Max system voltage Maximum Series Fuse Rating Typical type Front power Pmax/W Total power Pmax/W Max power",
        "score": 0.60386235,
        "bucket": "other"
      },
      {
        "url": "https://priwatt.de/wordpress/wp-content/uploads/2023/11/Datasheet-SUNPRO-SPDGxxx-N108M10%EF%BC%88410-440W.pdf?srsltid=AfmBOoowPjZCNnQE0yfIF7bHBxT_LzSz64uXeaUzR6CaPzlfPkp46oEx",
        "title": "[PDF] Datasheet-SUNPRO-SPDGxxx-N108M10（410-440W.pdf - Priwatt",
        "snippet": "Extreme wind and snow loads testing Power tolerance Junction box Warranties System certs Certifications Standard tests Withstand extreme wind(2400 Pascal) and snow loads(5400 Pascal) 0~+5W IP 68 25 years product warranty and 30 years 87.4% of power ISO 9001, ISO14001, ISO45001 TÜV, CE, CEC, UL, WEEE IEC 61215, IEC 61730, IEC 61701, IEC 62716, PPP 58042 0.046%/ -0.25%/ -0.30%/ -40~+85 45±2 40'GP 72 13 936 1722x1134x30mm 25.5kg (F) 2.0mm ultra clear embossed double layer colorless glass (B) 2.0mm [...] SPDG -N108M10 · · Full black Double glass Black frame Sliver frame · · M10 TOPCON MONO SUNPRO Standard tiered warranty 25 Yr quality guarantee | 30 Yr power warranty Common module SUNPRO TOPCon module (Additional value from 30-year warranty) 0 5 10 20 25 30 60% 70% 80% 90% 99% 100% 15 1 Year www.sunpropower.com YEARS Tier1 87.4% 89.4% WITHSTAND STRONG WARRANTY & GUARANTEE Linear output power guarantee 25 years: 89.4% power output 30 years: 87.4% power output Snow load 5400Pa Wind load 2400Pa PID [...] Certifications and Warranties Length: + 2mm Width:+ 2mm Thickness:+ 1mm Hole pitch:+ 2mm ADD.: QINGGANG TECHNOLOGICAL IND. ZONE, YUHUAN CITY, ZHEJIANG PROVINCE, CHINA TEL: +86 0576-80730906 E-MAIL: info@sunpropower.com WEBSITE: www.sunpropower.com Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Module Efficiency(%) Max system voltage Maximum Series Fuse Rating Typical type Front power Pmax/W Total power Pmax/W Max power",
        "score": 0.60386235,
        "bucket": "other"
      },
      {
        "url": "https://priwatt.de/wordpress/wp-content/uploads/2023/11/Datasheet-SUNPRO-SPDGxxx-N108M10%EF%BC%88410-440W.pdf?srsltid=AfmBOoq98VsJDhvL4gHY1GYaj2RWqK5G47avZImqu_gyzJn2d-hs0Rk3",
        "title": "[PDF] Datasheet-SUNPRO-SPDGxxx-N108M10（410-440W.pdf - Priwatt",
        "snippet": "voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Typical type Dimensions Weight Glass Output cables Connectors Cell type Number of cells Temp.Coeff.of Isc(TK Isc) Temp.Coeff.of Voc(TK Voc) Temp.Coeff.of Pmax(TK Pmax) Operating temperature Normal operating cell temperature Container Pieces per pallet Pallets per container Pieces per container [...] ASSOCIATION ISO 9001 ISO 14001 OHSAS 18001 SA 8000 ISO 45001 62716 58042 410~440W I-V CHARACTERISTICS AT DIFFERENT IRRADIATION DIMENSIONS AND STRUCTURE Electrical parameters at standard test conditions (STC:AM=1.5, 1000W/m² ,Cells Temperature25 ) Electrical parameters at NMOT test conditions (Irradiance 800W/m²,Ambient Temperature 20 ,AM 1.5,Wind Speed 1m/s) Electrical Characteristics with 15% Rear Side Power Gain Mechanical Data Temperature Characteristics Packing Configuration Tests, [...] Efficiency can reach 22.53%. Excellent low light performance. Higher power output under the conditions of haze, overcast, etc.",
        "score": 0.5372119,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "sunpro-solar",
    "product": "Sunpro Solar P500",
    "candidates": [
      {
        "url": "https://www.velux.com/-/media/com/daylight%20and%20architechture%20-%20doga/da26/da26.pdf",
        "title": "[PDF] 1 MA G AZINE B Y VELU X GR OUP A U T UMN 2 016 ISSUE 2 6 10 ...",
        "snippet": "Here, 700 square metres of modu- lar skylights resting on prefabricated concrete roof girders make for a light and lively atmosphere. On the remaining roof.",
        "score": 0.0457987,
        "bucket": "datasheets"
      },
      {
        "url": "https://image.simagic.com/profile/upload/2024/10/18/SIMAGIC_P500_UM_EN.pdf",
        "title": "[PDF] P500 - USER MANUAL - Simagic",
        "snippet": "Please avoid using the pedals without proper mounting, as they may shift during operation and could potentially cause injury USER MANUAL 09 P500 3.1.2 P500 Assembly P500 Dual Pedal Assembly Steps ②Thread the cable through the nearest cable outlet hole.\n①Loosen the four screws on the cover plate and remove the cover plate.\n③Place the brake module in position and tighten the screws. [...] 3.1.3 Connect (USB and separate power supply) Separate Power Supply Port (If using P-HPR, P-SRH, or P-SRB, a separate power supply is required.) USER MANUAL 11 3.2.1 Adjust the pedal face angle P500 3.2.2 Pedal Plate Height Adjustment 3.2 Adjusting the Pedals Loosen the two screws on the side of the pedal to adjust the angle of the pedal face.\nLoosen the two screws on the front of the pedal to adjust the pedal's height and left-right position. [...] Please refrain from making eye contact with the lubrication grease and ensure to thoroughly wash your hands after making any adjustments USER MANUAL 12 P500 3.2.3 Replacing the Springs ①Remove the spring barrel. Place a pry bar at the bottom side of the spring barrel and apply downward force to carefully pry it out.\n②Loosen the top cover, remove the spring, and replace it with a spring that provides the desired feel.",
        "score": 0.79580134,
        "bucket": "installation"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/installationintroductionsingleglass.pdf",
        "title": "[PDF] S 尚SUNPRO PV MODULES INSTALLATION MANUAL 尚博太阳能 ...",
        "snippet": "该组件具有C级防火等级(加拿大)或模块防火性能类型4(美利坚合众国)，必须安装在具有适当防火性能的屋顶 上。 Sunpro Power Modules can be mounted in landscape and portrait orientation however the impact of dirt shading the solar cells can be minimized by orienting the product in portrait.\nSunpro Power 组件可以横向和纵向安装，但是通过纵向放置产品可以最大限度地减少灰尘遮蔽太阳能电池的 影响。 Avoid using a mounting method that will block the drainage holes in the module frame. [...] installed through clamp method.The modules must be installed according to the following examples and recommendations. If a different installation method is desired, please contact Zhejiang Sunpro Solar customer service or technical support team for consultation. Improperly mounted modules maybe damaged. [...] 备注：该工作环境温度为安装地点月平均最高温度和最低温度。太阳能光伏组件所能承受的机械载荷是由安装 方式来决定的，机械负载压力：设计压力为3600（前）/1600（后），安全系数为1.5。 Notes: - The mechanical load bearing is dependent upon the mounting methods used and failure to follow the instructions of this manual may result in different capabilities to withstand snow and wind loads. The system installer must ensure that the installation methods used meet these requirements and any local codes and regulations.",
        "score": 0.7311551,
        "bucket": "installation"
      },
      {
        "url": "https://email.rekor.ai/hubfs/Solar%20Pro%20Solar%20Kit%20Installation%20Guide%20v1.0-1.pdf",
        "title": "[PDF] Solar Pro Solar Kit Installation Guide - Rekor",
        "snippet": "installation instructions. There are several steps to this installation: • Calculate the Tilt and Azimuth according to the latitude and longitude (before installation). • Install the solar panels. • Install the antenna on the enclosure. • Install the enclosure: o Set the DIP switches and install the solar controller dongle on the control panel. o Install the Master Edge. o Mount the enclosure on the pole (using a spacing jig, if needed). o Install the batteries in the enclosure. • Connect the [...] – 25° +15° 25 – 15° +5° 10 – 0° 15° Solar Pro Solar Kit Installation Guide Version 1.0 3 3 Solar Panel Hardware Mounting Instructions 3.1 Parts List Solar Pro Solar Kit Installation Guide Version 1.0 4 3.2 Side of Pole Mounts Hardware Note: • Apply anti-seize to all hardware to prevent galling • 1 ft-lb = 12 in-lb = 1.36 Nm • Use 5/16” hardware - > Mount assembly • Use 1/4\" hardware -> Mounting module to rails • Use 3/8” bolts -> Tilt leg spring nuts (if applicable) Solar Pro Solar Kit [...] connections are tight. Solar Pro Solar Kit Installation Guide Version 1.0 12 10. Mount the solar modules to the rails using the 1/4” hardware provided. 11. Solar Pro Solar Kit Installation Guide Version 1.0 13 4 Enclosure Setup 4.1 Control Panel Mounting The control panel is mounted on a mounting plate with a load panel mounted on a din rail. Solar Pro Solar Kit Installation Guide Version 1.0 14 1. Remove the second set of supplied nuts from the mounting studs located on the back top wall of",
        "score": 0.694241,
        "bucket": "installation"
      },
      {
        "url": "https://www.austraenergy.com.au/wp-content/uploads/2023/08/Sunpro_PV_Install_Manual_Single_Glass-v08-2023.pdf",
        "title": "Sunpro PV Modules Installation Manual (Single Glass) [Eng/Chi]",
        "snippet": "Failure to follow these instructions could result in personal injury or property damage.\n本手册适用于浙江尚博能源科技有限公司(以下简称浙江尚博) 生产的单玻系列太阳能组件的安装、维护和使用。 如果不遵守，将可能导致人员伤亡或财产损失。 Installation and operation of PV modules requires professional skills and should only be performed by qualified professionals. Please read the “Safety and Installation Instructions” carefully before using and operating the modules. [...] 组件可用于公众可能接触的、大于直流30V或240W以上的系统。并且组件通过了UL61730-1和UL61730-2两部 分，满足安全II类的要求。 （1）All installation work must comply with the local codes and the relevant international electrical standards.\n所有的安装工作必须完全遵守当地法规和相应的国际电气标准。 （2）Zhejiang Sunpro recommends that PV module installation is conducted by personnel who have been professionally trained in PV system installation. Operation by personnel who are not familiar with the relevant safety procedures will be very dangerous. [...] installed through clamp method.The modules must be installed according to the following examples and recommendations. If a different installation method is desired, please contact Zhejiang Sunpro Solar customer service or technical support team for consultation. Improperly mounted modules maybe damaged.",
        "score": 0.69249696,
        "bucket": "installation"
      },
      {
        "url": "https://kupfve.s22.cdn-upgates.com/b/b62b87f970830b-mnl-sunpro-manual-en.pdf",
        "title": "INSTALLATION MANUAL",
        "snippet": " Sunpro power modules are certified for operating in Class A installations at voltages below 1000Vdc. This maximum voltage should not be exceeded at any time and, as the voltage of the module increases, above data sheet values, at operating temperatures below 25°C, then these need to be taken into account when designing a PV system.\n Do NOT use water to extinguish fires of an electrical origin. [...]  Sunpro power recommends using the following grounding ways： a）Using Schleter for grounding. Connecting modules to the support structure according to the picture below. (Grounding accessories need pass the UL467 standard test.) Recommended torque is 20.5Nm For more information, please contact the supplier Schletter（http：//www.solar.schletter.de） Sharp point 10 b）The traditional way of grounding（Grounding accessories need pass the UL467 standard test and UL E34440/E6207 test.） For fully [...]  Sunpro power Modules have passed the test of PV modules salt mist corrosion ,and can be safely installed in corrosive salt areas within proximity of the ocean or sulfurous areas.\n Sunpro power Modules have passed the test of PV modules ammonia corrosion ,and can be safely installed in ammonia-heavy environments, such as farm houses.",
        "score": 0.6824261,
        "bucket": "installation"
      },
      {
        "url": "https://sunpropower.com/wp-content/uploads/2023/08/Installation-Manual-Zhejiang-Sunpro-Power-Technology-Single-Glass.pdf",
        "title": "Sunpropower SUNPRO PV MODULES INSTALLATION MANUAL",
        "snippet": "Zhejiang Sunpro Power Technology Co., Ltd. is mainly engaged in R&D, production and sales of Custom Solar PV Panel Module Manufacturers Suppliers Factory.",
        "score": 0.60750073,
        "bucket": "installation"
      },
      {
        "url": "https://energydepot.com.au/wp-content/uploads/2021/03/Sunpower-Installation-manual.pdf",
        "title": "Energydepot Sunpower-Installation-manual.pdf - Energy Depot",
        "snippet": "reserved. Specifications included in this manual are subject to change without notice. Table 1.4: Mounting Zone Load Ratings for Performance Modules (Pending IEC Certification) Applicable Products Mounting Zone Distance from corner (mm) Wind (up & down) / Snow(down) (units in Pa)3 Mounting Method P3 UPP (2066 x 1160 x 35mm) A 183‐283 1600/2400 Clamp B 466‐566 1600/36004 D 783‐ 833 1600/1600 E 300‐400 1600/1600 F 465‐565 1600/2400 Frame Holes2 303 1600/3600 Bolt 504 603 803 P5 UPP (2384 x 1092 x [...] systems Field Wiring: Cu wiring only, min. 12 AWG/4 mm 2, insulated for 90° C min. WARNING SEVERE ELECTRICAL HAZARD • Solar module has full voltage even in very low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 274 mm 1160 mm 4X Ø4.2 mm Ground Holes 8X 14mm(L) x 9mm(W) R4.5mm Mounting Holes 1118 mm 2022 mm 35 mm 35 mm 35 mm 35 mm 1092 mm [...] 1000 W/m2, AM 1.5, 25° C Suitable for ungrounded, positive, or negative grounded DC systems Field Wiring: Cu wiring only, min. 12 AWG/4 mm2, insulated for 90° C min. WARNING SEVERE ELECTRICAL HAZARD • Solar module has full voltage even in very low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 954 mm 961 mm 2067 mm 300 mm 400 mm 539 mm",
        "score": 0.4221955,
        "bucket": "installation"
      },
      {
        "url": "https://cms2files.revize.com/desmoines/document_center/Development%20Services/2021%20Building%20Permit%20Reports/September%202021-All%20Building%20Permits.pdf",
        "title": "[PDF] City of Des Moines Permits Building Permits Issued September 2021 ...",
        "snippet": "$1,500 Victor Piagentini, Associated Engineering Company of Iowa FENC-2021-000158 1863 PLEASANT VIEW CIR DES MOINES, IA 9/7/2021 169' of 6' solid wood fence install $7,160 Ashton Donels, DES MOINES STEEL FENCE BLDR-2021-000498 326 VIRGINIA AVE DES MOINES, IA 9/8/2021 Install 12 Roof Mounted Solar Panels with Panel Upgrade : install a new 200/100A interior panel land a 30A solar breaker in the interior main panel// electrical permit must be filed separately $19,011 Sunpro Solar, Marc Jones [...] solar installation on detached structure// electrical permit to be filed separately $20,000 Ryanne Prochnow, Purelight Power BLDR-2021-000477 4135 51ST ST DES MOINES, IA 9/8/2021 Install 9 Roof Mounted Solar Panels// file electrical permit separately $26,469 Sunpro Solar, Marc Jones Construction LLC, DBA, Sunpro Solar BLDR-2021-000469 2725 59TH ST DES MOINES, IA 9/8/2021 3.60/2.95 kW roof-mounted solar installation on main dwelling// electrical permit to be filed separately $10,000 Ryanne [...] $1,605 Ashton Donels, DES MOINES STEEL FENCE BLDC-2021-000089 401 E COURT AVE DES MOINES, IA 9/13/2021 Tenant Improvement project of a yoga/fitness studio $450,000 Jeff Shaffer, BNIM BLDR-2021-000491 4470 SE 16TH ST DES MOINES, IA 9/8/2021 Installing 37 Roof Mounted Solar Panels// main structure only// electrical permit must be filed for separately $50,627 Sunpro Solar, Marc Jones Construction LLC, DBA, Sunpro Solar BLDR-2021-000476 400 ROSE AVE DES MOINES, IA 9/8/2021 5.04/4.15 kW roof-mounted",
        "score": 0.38623142,
        "bucket": "installation"
      },
      {
        "url": "https://fcc.report/FCC-ID/YAW539848-Z/6022544.pdf",
        "title": "FCC PVS6 Residential Installation Quick Start Guide",
        "snippet": "• Drill extra 0.875” (22 mm) or 1.11” (28 mm) conduit openings, if required, with step drill (do not use screwdriver or hammer).\n• Use only the provided conduit openings or drillout locations and never cut holes in the top or sides of the enclosure.\n• Never run inverter or Ethernet communication cable in the same conduit as AC wiring.\n• CT and AC wiring may be run in the same conduit. [...] (for example, ZT214385000549Wxxxx) the Ethernet ports are not present, meaning that for commissioning you must use a dongle. PVS6 units with an A in their serial number will likely look familiar because all the standard ports are present: SunPower Corporation proprietary information. This document is electronically controlled. The latest revision is available in the document management system. All printed copies are not controlled and may be outdated unless marked with a red ink “Controlled [...] • Drill extra openings with step drill (do not use screwdriver or hammer).\n• Use only the provided conduit openings or drillout locations and never cut holes in the top or sides of the enclosure.\n• Never run inverter or Ethernet communication cable in the same conduit as AC wiring.\n• CT and AC wiring may be run in the same conduit.",
        "score": 0.28998506,
        "bucket": "installation"
      },
      {
        "url": "https://eta-publications.lbl.gov/sites/default/files/journal-lbnl-62937.pdf",
        "title": "[PDF] Microgrids: An Overview of Ongoing Research, Development, and ...",
        "snippet": "R. Lasseter, A. Abbas, C. Marnay, J. Stevens, J. Dagle, R.\nGuttromson, A. Sakis Meliopoulos, R. Yinger, and J. Eto, “Integration of distributed energy resources: The CERTS microgrid concept,” California Energy Commission, P500-03-089F, Oct. 2003.\nY. Fujioka, H. Maejima, S. Nakamura, Y. Kojima, M. [...] These systems, together with solar photovoltaic (PV) mod-ules, small wind turbines (WTs), other small renewables (such as biogas digestors), heat and electricity storage, and controllable loads are expected to play a significant role in future electricity supply. These technologies are herein col-lectively called distributed energy resources (DERs). They can substantially reduce carbon emissions, thereby contribut-ing to the commitments of most developed countries (or in some cases regional [...] apparatus, product, or process disclosed, or represents that its use would not infringe privately owned rights. Reference herein to any specific commercial product, process, or service by its trade name, trademark, manufacturer, or otherwise, does not necessarily constitute or imply its endorsement, recommendation, or favoring by the United States Government or any agency thereof, or The Regents of the University of California. The views and opinions of authors expressed herein do not",
        "score": 0.25329307,
        "bucket": "installation"
      },
      {
        "url": "https://thesunpays.co.za/ItemSpecifications/4kW+manual.pdf",
        "title": "Thesunpays USER'S MANUAL",
        "snippet": "Importer and distributor of solar equipment for residential and commercial and industrial use. Our products include: off-grid solar inverters, solar lithium batteries, solar pumps, solar panels and solar accessories such as mounting frames, MC4 connectors, solar cable, battery cable.",
        "score": 0.17167166,
        "bucket": "installation"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/warrantydocumentsingleglass.pdf",
        "title": "[PDF] Limited Warranty for PV Modules - Sunpro Power",
        "snippet": "Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. [...] application, installation, use and service conditions. If MODULES fail to conform to this warranty, then for a period ending 360 months from date of sale as shown in the invoice to the direct customer of Sunpro Power either repair or replace the product, or refund the purchase price as paid by the CUSTOMER. The repair or replacement or refund remedy shall be the sole and exclusive remedy provided under the “Limited Product Warranty” and shall not extend beyond the 360 months period set forth [...] have no responsibility or liability whatsoever for damage or injury to persons or property, or for other loss or injury resulting from any cause whatsoever arising out of or related to the MODULES, including, without limitation, any defects in the MODULE, or from use or installation. Under no circumstances shall Sunpro Power be liable for incidental, consequential or special damages, howsoever caused. Loss of use, Loss of profits, loss of production, loss of revenues are therefore specifically",
        "score": 0.6796259,
        "bucket": "other"
      },
      {
        "url": "http://www.sunlitfuture.in/wp-content/uploads/2019/07/p370-p404-p500.pdf",
        "title": "[PDF] POWER OPTIMIZER - Sunlit Future",
        "snippet": "P405 (for thin film modules) P500 (for 96-cell modules) P505 (for higher current modules) UNIT INPUT Rated Input DC Power(1) 300 370 405 405 500 505 W Absolute Maximum Input Voltage (Voc at lowest temperature) 48 60 80 125 80 83 Vdc MPPT Operating Range 8 - 48 8 - 60 12.5 - 80 12.5 - 105 8 - 80 12.5-83 Vdc Maximum Short Circuit Current (Isc) 11 10.1 14 Adc Maximum Efficiency 99.5 % Weighted Efficiency 98.8 % Overvoltage Category II OUTPUT DURING OPERATION (POWER OPTIMIZER CONNECTED TO OPERATING [...] Rating IP68 Relative Humidity 0 - 100 % PV SYSTEM DESIGN USING A SOLAREDGE INVERTER(4) SINGLE PHASE HD-WAVE SINGLE PHASE THREE PHASE THREE PHASE FOR 277/480V GRID Minimum String Length (Power Optimizers) P300, P370, P500, P505(5) 8 16 18 P404,P405,P505 6 13 (12 with SE3K) 14 Maximum String Length (Power Optimizers) 25 50 50 Maximum Power per String 5700 5250 11250 12750 W Parallel Strings of Different Lengths or Orientations Yes (4) Mixing P404/P405/P505 with [...] 129 x 153 x 27.5 / 5.1 x 6 x 1.1 129 x 153 x 42.5 / 5.1 x 6 x 1.7 129 x 159 x 49.5 / 5.1 x 6.3 x 1.9 129 x 153 x 33.5 / 5.1 x 6 x 1.3 129 x 162 x 59 / 5.1 x 6.4 x 2.3 mm / in Weight (including cables) 630 / 1.4 655 / 1.5 775 / 1.7 845 / 1.9 750 / 1.7 1064 / 2.3 gr / lb Input Connector MC4(2) Single or Dual MC4(3) MC4(2) Input Wire Length 0.16 / 0.52 m / ft Output Connector MC4 Output Wire Length 0.95 / 3.0 1.2 / 3.9 m / ft Operating Temperature Range -40 - +85 / -40 - +185 ˚C / ˚F Protection",
        "score": 0.6737291,
        "bucket": "other"
      },
      {
        "url": "https://sungreen.com.au/pdf/solar-inverter-78.pdf",
        "title": "[PDF] POWER OPTIMISER",
        "snippet": "SE10000H) 5250 5700 11250 W Parallel Strings of Different Lengths or Orientations Yes Notes -Connect 2 arrays -Optimiser Model (Typical Module Compatibilty) P320(1) (for 60-cell modules) P370 (for high- power 60 and 72-cell modules) P404 (for 60-cell and 72-cell, short strings) P485 (for high-voltage modules) P500 (for 96-cell modules) P505 (for higher current modules) INPUT Rated Input DC Power(2) 320 370(2) 405(2) 485 500(2) 505(2) W Absolute Maximum Input Voltage (Voc at lowest temperature) [...] 48 60 80 125 80 83 Vdc MPPT Operating Range 8 - 48 8 - 60 12.5 - 80 12.5 - 105 8 - 80 12.5-83 Vdc Maximum Short Circuit Current (Isc) 11 10.1 14 Adc Maximum Efficiency 99.5 % Weighted Efficiency 98.8 % Overvoltage Category II OUTPUT DURING OPERATION (POWER OPTIMISER CONNECTED TO OPERATING SOLAREDGE INVERTER) Maximum Output Current 15 Adc Maximum Output Voltage 60 85 60 85 Vdc OUTPUT DURING STANDBY (POWER OPTIMISER DISCONNECTED FROM SOLAREDGE INVERTER OR SOLAREDGE INVERTER OFF) Safety Output [...] (7) Optimisers must be connected in two separate arrays. For complete design guidelines for the three phase residential inverters refer to:  PV System Design Using a Solaredge Inverter(6) Single Phase HD-WAVE Single Phase Three Phase Residential(7) Three Phase Commercial Minimum String Length (Power Optimisers) P320, P370, P500 8 8 per array 16 P404, P485, P505 6 7 per array 14 Maximum String Length (Power Optimisers) 25 25 per array 50 Maximum Power per String 5700 (6000 with SE8000H,",
        "score": 0.54564947,
        "bucket": "other"
      },
      {
        "url": "https://assets.ctfassets.net/k6ot5nj1c6f9/7tDIr3yBJcpK6ICZvbIbsk/da9f6ea6d8fd92152a91fb60d23586a3/spes-ppm-war-41837_0.pdf",
        "title": "[PDF] SunPower Limited Product and Power Warranty for Residential PV ...",
        "snippet": "Power Warranty, SunPower Corporation (“SunPower”) warrants to the original purchaser (as defined herein) (“Owner”) that for 25 years beginning on the Warranty Start Datei (the “Warranty Period”), its photovoltaic modules specified above (“PV Module(s)”), shall be free from defects in materials and workmanship under normal application, installation, use and service conditions, and the Minimum Peak Powerii rating and the maximum annual decline in peak power rating of the PV Modules will be no [...] action, regardless of form or basis, including for any claim arising from or related to this warranty, must be commenced within one year of the earlier of: (a) the date the system owner knew or should have known, after reasonable investigation, of a defect, issue or power loss in excess of the warranty minimum output stated herein; or (b) the date the claim was first presented to SunPower or a SunPower authorized dealer. Failure to timely assert a claim shall deemed it irrevocably waived. [...] WARRANTY CLAIM. SOME JURISDICTIONS DO NOT ALLOW LIMITATIONS ON IMPLIED WARRANTIES OR THE EXCLUSION OF DAMAGES SO THE ABOVE LIMITATIONS OR EXCLUSIONS MAY NOT APPLY TO YOU. IF ANY PROVISION OF THIS LIMITED PRODUCT AND POWER WARRANTY IS HELD UNENFORCEABLE OR ILLEGAL BY A COURT OR OTHER BODY OF COMPETENT JURISDICTION, SUCH PROVISIONS SHALL BE MODIFIED TO THE MINIMUM EXTENT REQUIRED SUCH THAT THE REST OF THIS LIMITED PRODUCT AND POWER WARRANTY WILL CONTINUE IN FULL FORCE AND EFFECT. THIS IS A",
        "score": 0.52173984,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "sunpro-solar",
    "product": "Sunpro Solar P600",
    "candidates": [
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOopaf_V4nltGjAinTu1NkiXblx9CCQfXeBvszFXl0iPeZw64xPp7",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.22779596,
        "bucket": "datasheets"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOoqZcU2o_7q-D91-CyMydhPG0b0TB58WTRWwxLa9JaaORupt3eMf",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.22779596,
        "bucket": "datasheets"
      },
      {
        "url": "https://6582712.fs1.hubspotusercontent-na1.net/hubfs/6582712/Solar%20Pro%20Installation%20Guide.pdf",
        "title": "[PDF] Solar Pro Installation Guide",
        "snippet": "panel face-down on a clean surface. Insert a bolt through the panel clamp and through the mounting holes on the top and bottom of the L brackets. Adjust the L bracket and push the clamping pieces all the way towards the peripheral edge of the panel. Use a metal washer (one for each bolt) and a nyloc nuts to attach the arm to the panel. (4 times total) Solar Pro Installation Guide Version 1.0 6 Figure 6. L Support Arm Attachment on Bottom L End Caps 5. Attach the L support arms to the L end cap [...] Enclosure Mounting 3. Insert the large black battery enclosure between the L brackets on the back of the solar panel so that the hinge of the enclosure is parallel to the top long edge of the solar panel. Secure the top and bottom of the equipment side of the enclosure to the left and right L brackets. (4 times total) Solar Pro Installation Guide Version 1.0 10 4 Mounting 1. Locate and mark the positions on the pole where the solar panel will be installed. Figure 12. Solar Panel Mounted onto [...] installation instructions. 2 Parts List Item # Part Amount 1 L Support Bracket (Right) 1 2 L Support Bracket (Left) 1 3 'U' Channel Plate (top and bottom) 2 4 Solar Kit Antenna Mount 1 5 Panel Clamp 4 6 'L' End Cap Bracket 4 7 'V' Pole Mount Plate 2 8 L Bracket Support Arm 2 Not Shown Mounting Hardware (screws, washers, nuts) 179 Not Shown 24v 120W Solar Panel 1 Solar Pro Installation Guide Version 1.0 2 Item # Part Amount 1 Lithium-Ion Battery Packs 2 2 Victron Solar Controller Assembly 1 3",
        "score": 0.6972179,
        "bucket": "installation"
      },
      {
        "url": "https://www.canadiansolar.com/wp-content/uploads/2020/08/Installation_Manual_of_Standard_Solar_Modules_en.pdf",
        "title": "[PDF] INSTALLATION MANUAL OF STANDARD SOLAR MODULES",
        "snippet": "· The mounting design must be certified by a registered professional engineer. The mounting design and procedures must comply with all applicable local codes and requirements from all relevant authorities.\n· The module is considered to be in compliance with UL 1703 and IEC 61215 only when the module is mounted in the manner specified by the mounting instructions included in this installation manual. [...] on the long side. Mounting rails run parallel to the long side frame. [...] 6.0 MOUNTING INSTRUCTIONS The applicable regulations pertaining to work safety, accident prevention and securing the construction site must be observed. Workers and third party personnel shall wear or install fall arrest equipment. Any third party need to be protected against injuries and damages.",
        "score": 0.6164054,
        "bucket": "installation"
      },
      {
        "url": "https://static.csisolar.com/wp-content/uploads/2020/10/05094834/Installation_Manual_of_Standard_Solar_Modules_en-v3.3.pdf",
        "title": "[PDF] INSTALLATION MANUAL OF STANDARD SOLAR MODULES",
        "snippet": "protected against injuries and damages.  The mounting design must be certified by a registered professional engineer. The mounting design and procedures must comply with all applicable local codes and requirements from all relevant authorities.  The module is considered to be in compliance with UL 61730 and IEC 61215 only when the module is mounted in the manner specified by the mounting instructions included in this installation manual.  The system designer and installer are responsible for [...] 61215.  Clamping methods will vary and are dependent on the mounting structures. Please follow the mounting guidelines recommended by the mounting system supplier.  Each module must be securely fastened at a minimum of four points on two opposite sides. The clamps should be positioned symmetrically. The clamps should be positioned according to the authorized position ranges.  Install and tighten the module clamps to the mounting rails using the torque stated by the mounting hardware [...] positioned between the frame and the wire with the concave side up to prevent galvanic corrosion. Tighten the bolt securely using the SS toothed nut. A wrench may be used to do this. The tightening torque is 3-7 Nm (2.2-5.2 ft-lbs). 6.0 MOUNTING INSTRUCTIONS The applicable regulations pertaining to work safety, accident prevention and securing the construction site must be observed. Workers and third party personnel shall wear or install fall arrest equipment. Any third party need to be",
        "score": 0.604703,
        "bucket": "installation"
      },
      {
        "url": "https://dobraenergia.subregion.pl/wp-content/uploads/sites/6/2021/12/Lista-uprawnionych-wykonawcow-fotowoltaika-aktualizacja_12.11.2021.pdf",
        "title": "[PDF] longi solar lr6-60hph 320m - Projekt - Gminy z dobrą energią",
        "snippet": "/P600/P800p/P850 (dopuszczony w przypadku stosowania falowników Solar Edge) ... SUNPRO POWER SPXXX-120M G.7. Twin Silver M Black Frame 166. MM 370/375 W.",
        "score": 0.51032627,
        "bucket": "installation"
      },
      {
        "url": "https://oze.subregion.pl/wp-content/uploads/sites/5/2020/12/Lista-Wykonawcow-Instalacje-fotowoltaiczne-16.12.2020-3.pdf",
        "title": "[PDF] Instalacje fotowoltaiczne",
        "snippet": "SunPRO 330Wp - SPP 330-345-. 120M. SunPRO 330Wp - SSP 330-345 ... LONGI SOLAR LR6-60OPH 340-360. M. EXE SOLAR A-HCM 345. LONGI SOLAR LR4",
        "score": 0.418341,
        "bucket": "installation"
      },
      {
        "url": "https://stegback.com/root/storage/uploads/11665662814-64.290.22.30696.01TRFESY.pdf",
        "title": "[PDF] Test Record Form (TRF) - Stegback",
        "snippet": "YUHUAN SUNPRO POWER CO.,LTD ... Only qualified electricians are allowed to install and maintain the converter. (4). In order to protect the",
        "score": 0.4119392,
        "bucket": "installation"
      },
      {
        "url": "https://img.bretts.com.au/Sunpro-electric-collector.pdf",
        "title": "[PDF] Solar Collector Installation Guide and Parts List - Bretts",
        "snippet": "Description Illustration PK5007 PK5008 PK5010 PK5014 PK5015 SFT4 PK5016 PK5017 PK5018 H3350 Union 1\" Conetite × ½\" Conetite 1 1 1 1 1 1 1 H3351 Union 1\" Conetite × 1\" Conetite 2 2 2 2 2 H3353 End Stop 1\" Conetite 2 2 2 2 2 2 2 4-Way Manifold Assembly 1 1 1 1 1 1 1 H60-1063 Automatic Air Vent Valve (200°C) 1 1 1 1 1 1 1 AFV60F Anti Frost Protection Valve 1 H3692 Manual 1 1 1 1 1 1 1 1 H3322 Mounting Rail Joiner 3rd Rail 2 H60-4006 Collector Strap 4 2 4 4 4 H60-6008 Collector Clamp (Z) Bracket 8 [...] Step 8 • Repeat the process for the second collector. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken.\nStep 9 • Now position the top mounting rail and repeat the above steps for that rail.\n• Join the top connections with the brass compression fittings supplied. [...] • Ensure collector strap is located on truss vertically.\n• Repeat this process for the collector strap at the other end of the mounting rail.\nStep 5 • Once the bottom rail has been secured, the collector can now be lifted on to the roof. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken.",
        "score": 0.4017588,
        "bucket": "installation"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOop-_njWQma7eUZUdFmHUIPtIqytH2P5i7yON1GeVxK8FdsGnS2a",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "INSTALLATION TOOLS & ACCESSORIES. NEW. Page 41. Code. Description. Brush. Power. Pole Length. Kit Includes. X21-9M. Manual Solar Cleaning Brush. X41-AC-5.5M.",
        "score": 0.29709303,
        "bucket": "installation"
      },
      {
        "url": "https://web.szmc.edu.tw/Public/Edumoney/data/a/107research/107%E5%B9%B4%E5%BA%A6%E7%A7%81%E7%AB%8B%E6%8A%80%E5%B0%88%E6%A0%A1%E9%99%A2%E6%95%B4%E9%AB%94%E7%99%BC%E5%B1%95%E7%8D%8E%E5%8B%B5%E8%A3%9C%E5%8A%A9%E7%B6%93%E8%B2%BB%E5%9F%B7%E8%A1%8C%E6%B8%85%E5%86%8A.pdf",
        "title": "[PDF] 107年度私立技專校院整體發展獎勵補助經費執行清冊",
        "snippet": "白色透氣防燄皮革.內層 高密度泡綿.背面整面毛 氈板黏貼 1 式 62,560 62,560 擴充教學資源，配合 課程實務教學使用 職能治 療科 2 C615 107/11/2 107/12/05 62,560 -1071127E006 經107.04.24第 1次專責會議 通過採購 36 跑步機 3501030713-42~44 SUNPRO IMT-8000 長214寬86高139cm.總 重154Kg.承重181Kg.馬力 3.0HP.內建17組運動程 式.1~20公里/小時 3 台 48,000 144,000 供全校性體育課程教 學及活動使用，授課 科目為：體育（三）~ （六）及體育（ 七）、（八）興趣選 項 通識教 育中心 5 D101-1 107/11/21 107/12/15 144,000 -1071206E006 經107.04.24第 1次專責會議 通過採購 37 LDR床（生產 待產床） 311010102-47 Stryker 4701 L236W94cm.控制靠背/ 前後傾/腳段/上下.骨盆位 前推10cm.雙側觸控操作. [...] 10 個 1,920 19,200 教學用 應用日語科 2 C323 107/6/8 107/07/05 19,200 -1070614E004 經107.04.24 第1次專責會 議通過採購 134 其他非消耗 品 桌球桌 6080240-7 SUNPR O SP-200 長274高152.5寬 76cm.桌面厚20mm.\n桌框5025mm鋼框.\n桌腳3939mm鋼 管.3吋抗壓滑輪.\n1 檯 9,870 9,870 供全校性體育課程教 學及活動使用，授課 科目為：體育 (三)~(六)及體育(七)、 (八)興趣選項 通識教育中心 3 A棟1F 107/8/22 107/09/15 9,870 -1070904E013 經107.04.24 第1次專責會 議通過採購 135 專業教室物 品 啞鈴 6080209-98~102 mainkit TK-5LB8LB 含5磅及8磅各2支.\n外層防滑. [...] -1071225E030 經107.04.24第 1次專責會議 通過採購 52 筆記型電腦 314010103-2538~2541 HP ZBook 15v G5 i7-8750H.記憶體16G.硬碟 256G+1TB.16.5\"螢幕.顯 卡Quadro P600.含背 包.USB滑鼠.",
        "score": 0.27371436,
        "bucket": "installation"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOopHnR2XH5MlEYEtySM4QmHkW3tnqOdGGjPzXcdd-Z6mp9GspAed",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.19585577,
        "bucket": "installation"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/warrantydocumentsingleglass.pdf",
        "title": "[PDF] Limited Warranty for PV Modules - Sunpro Power",
        "snippet": "application, installation, use and service conditions. If MODULES fail to conform to this warranty, then for a period ending 360 months from date of sale as shown in the invoice to the direct customer of Sunpro Power either repair or replace the product, or refund the purchase price as paid by the CUSTOMER. The repair or replacement or refund remedy shall be the sole and exclusive remedy provided under the “Limited Product Warranty” and shall not extend beyond the 360 months period set forth [...] Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. [...] have no responsibility or liability whatsoever for damage or injury to persons or property, or for other loss or injury resulting from any cause whatsoever arising out of or related to the MODULES, including, without limitation, any defects in the MODULE, or from use or installation. Under no circumstances shall Sunpro Power be liable for incidental, consequential or special damages, howsoever caused. Loss of use, Loss of profits, loss of production, loss of revenues are therefore specifically",
        "score": 0.683948,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "sunpro-solar",
    "product": "Sunpro Solar P700",
    "candidates": [
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/05/28/%E3%80%90topcon%E3%80%91spdgxxx-n132m12%EF%BC%88685-710w%EF%BC%89%E5%8F%8C%E7%8E%BB%E9%93%B6%E6%A1%86.pdf",
        "title": "[PDF] 【topcon】spdgxxx-n132m12（685-710w）双玻银 ... - Sunpro Power",
        "snippet": "current(Isc) Module Efficiency(%) Max system voltage Maximum Series Fuse Rating 35A Electrical parameters at standard test conditions (STC:AM=1.5, 1000W/m² ,Cells Temperature25 ) Typical type Max power(Pmax) Max power voltage(Vmp) Max power current(Imp) Open circuit voltage(Voc) Short circuit current(Isc) Typical type Electrical parameters at NMOT test conditions (Irradiance 800W/m²,Ambient Temperature 20 ,AM 1.5,Wind Speed 1m/s) Mechanical Data Dimensions Weight Glass Output cables Connectors [...] 20.99 695W 799.25 40.32 19.82 48.08 21.02 700W 805 40.51 19.87 48.27 21.07 705W 810.75 40.69 19.93 48.46 21.11 710W 816.5 40.88 19.97 48.65 21.16 690W 690 40.12 17.2 47.88 18.25 22.21 685W 685 39.91 17.17 47.69 18.21 22.05 695W 695 40.32 17.24 48.08 18.28 22.37 700W 700 40.51 17.28 48.27 18.32 22.53 705W 705 40.69 17.33 48.46 18.36 22.70 710W 710 40.88 17.37 48.65 18.40 22.86 TÜV, WEEE 35±1 1234567895555 1303±1 2384±1 XXXXXXXXXXXXX XXXXXXXXXXXXX XXXXXXXXXXXXX Normal operating cell temperature [...] tolerance Withstand extreme wind(2400 Pascal) and snow loads(5400 Pascal) 0~+5W Junction box Warranties IP 68 25 years product warranty and 30 years 87.4% of power Tests, Certifications and Warranties System certs Certifications ISO 9001, ISO14001, ISO45001 Total power Pmax/W Vmp/V(Total) Imp/A(Total) Voc/V(Total) Isc/A(Total) Front power Pmax/W Electrical Characteristics with 15% Rear Side Power Gain (F) 2.0mm ultra clear embossed double layer colorless glass (B) 2.0mm white mesh glazed",
        "score": 0.72184175,
        "bucket": "datasheets"
      },
      {
        "url": "https://inis.iaea.org/records/p8pn3-47q14/files/21058220.pdf?download=1",
        "title": "[PDF] INIS DOCUMENT I",
        "snippet": "P700 measurements provide essential information on. PS I and the rate ... measurements at dillerent solar elevations to study its effect on ths UV solar.",
        "score": 0.47811517,
        "bucket": "datasheets"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOooYOLRNh3b6aQtOAdLWfi41Kx3qhQUIxzI6WVE54lWXKftQNiT8",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.22579233,
        "bucket": "datasheets"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOoqzDNJ5dojRLzBjROyVQvGcdJB8IwAbWqV-lcJnvLI1qGU2l3rq",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.22579233,
        "bucket": "datasheets"
      },
      {
        "url": "https://link.springer.com/content/pdf/10.1007/978-3-0348-8994-0.pdf",
        "title": "Bioenergetics",
        "snippet": "The publisher and editors cannot assume any legal responsibility for information on drug dosage and administration contained in this publication.",
        "score": 0.025200473,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/installationintroductionsingleglass.pdf",
        "title": "[PDF] S 尚SUNPRO PV MODULES INSTALLATION MANUAL 尚博太阳能 ...",
        "snippet": "备注：该工作环境温度为安装地点月平均最高温度和最低温度。太阳能光伏组件所能承受的机械载荷是由安装 方式来决定的，机械负载压力：设计压力为3600（前）/1600（后），安全系数为1.5。 Notes: - The mechanical load bearing is dependent upon the mounting methods used and failure to follow the instructions of this manual may result in different capabilities to withstand snow and wind loads. The system installer must ensure that the installation methods used meet these requirements and any local codes and regulations. [...] 不要将组件直接叠放在一起。 Pallet Number Serial number Product name 文件编号Document No.：SP/WI-JS-010 - 22 -5、INSTALLATION 安装 5.1、INSTALLATION SAFETY 安装安全 （1）Zhejiang Sunpro Modules can be mounted on long or short sides, adopt the way of landscape long side installation ，can minimize the effect of dust on the shading of the solar cells ，Zhejiang Sunpro is not recommended to use short side installation. [...] 在屋顶安装结构上安装模块时，请尽量遵循“从上到下”和/或“从左到右”的安全原则，请不要站到组件上面去， 因为那样会损坏组件，也会对人身安全造成危险。 （19 ）The design loading of modules have been evaluated by UL according to UL61730 with 1.5 times safety factor; The mechanical load bearing is dependent upon the mounting methods used and failure to follow the instructions of this manual may result in different capabilities to withstand snow and wind loads;The system installer must ensure that the installation methods used meet these requirements and any local codes and",
        "score": 0.7140107,
        "bucket": "installation"
      },
      {
        "url": "https://energydepot.com.au/wp-content/uploads/2021/03/Sunpower-Installation-manual.pdf",
        "title": "[PDF] Sunpower-Installation-manual.pdf - Energy Depot",
        "snippet": "Section 4.1 Modules may be mounted using the following methods only: 1) Frame Holes: Secure the module to the structure using the factory mounting holes. Four M6 or M8 stainless steel bolts, with nuts, flat washers on both side, and lock washers are recommended per module. Bolts to be fasten according to racking supplier recommendations. Refer to Table 2 for the module dimensions and mounting hole locations. (Please refer to the arrows on the Table 2, E1&E2&E3&E4). 2) Pressure Clamps or Clips: [...] with two mounting rails parallel to the long side of the Modules (See Table 1.2) and 3) without any mounting rail (See Table 1.2). The end‐mounting rails and clips or clamps (identified as A(1&2&3&4) in Table 1.1) must be of sufficient strength to allow for maximum designed test pressure of the module. Verify this capacity with the mounting system of vendor before installation. 4) Hybrid Mount: Combination with clamps or clips located on longer or shorter sides of Modules are also possible, see [...] low light. • Installation should only be done by a qualiﬁed technician. 527040 www.sunpower.com Patented as shown at www.sunpower.com/patents Safety Class II Fire Rating: Class C Max. System Voltage:1500 V DC 400 mm 700 mm 1058 mm 1300 mm 4X Ø4.2 mm Ground Holes 8X 10mm(L) x 7mm(W) R3.5mm Mounting Holes 8X 14mm(L) x 9mm(W) R4.5mm SLOTS 35mm 400 mm 539 mm 1058 mm 1423 mm 954 mm 2066 mm 998 mm 35 4X Ø4.2 mm Ground Holes Mounting Holes 4X Ø6.7 mm Mounting Holes 12X Ø6.8 mm 4X 5.0 mm (W) x 15.0 mm",
        "score": 0.5372119,
        "bucket": "installation"
      },
      {
        "url": "https://img.bretts.com.au/Sunpro-electric-collector.pdf",
        "title": "[PDF] Solar Collector Installation Guide and Parts List - Bretts",
        "snippet": "Step 8 • Repeat the process for the second collector. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken.\nStep 9 • Now position the top mounting rail and repeat the above steps for that rail.\n• Join the top connections with the brass compression fittings supplied. [...] • Ensure collector strap is located on truss vertically.\n• Repeat this process for the collector strap at the other end of the mounting rail.\nStep 5 • Once the bottom rail has been secured, the collector can now be lifted on to the roof. Note: Ensure this is done with full consideration to OH&S regulations. Care should be taken. [...] Description Illustration PK5007 PK5008 PK5010 PK5014 PK5015 SFT4 PK5016 PK5017 PK5018 H3350 Union 1\" Conetite × ½\" Conetite 1 1 1 1 1 1 1 H3351 Union 1\" Conetite × 1\" Conetite 2 2 2 2 2 H3353 End Stop 1\" Conetite 2 2 2 2 2 2 2 4-Way Manifold Assembly 1 1 1 1 1 1 1 H60-1063 Automatic Air Vent Valve (200°C) 1 1 1 1 1 1 1 AFV60F Anti Frost Protection Valve 1 H3692 Manual 1 1 1 1 1 1 1 1 H3322 Mounting Rail Joiner 3rd Rail 2 H60-4006 Collector Strap 4 2 4 4 4 H60-6008 Collector Clamp (Z) Bracket 8",
        "score": 0.38124317,
        "bucket": "installation"
      },
      {
        "url": "https://firemarshal.utah.gov/wp-content/uploads/LP-GAS-COMPANIES-7-01-24-1.pdf",
        "title": "[PDF] Liquid Propane GAS COMPANIES - Utah State Fire Marshal's Office",
        "snippet": "CANYNLNDS GETAWAY 13701 N HIGHWAY 191 MOAB UT 84532 435 259-7854 P638 06/21/2025 CLASS 4 SUN OUTDOORS MOAB DOWNTOWN 555 SOUTH MAIN STREET MOAB UT 84532 435 259-6848 P2320 06/21/2025 CLASS 4 SUNBELT RENTALS 55 EAST 2400 SOUTH SALT LAKE CITY UT 84115 801 486-0055 P1268 11/15/2024 CLASS 4 SUNBELT RENTALS 1548 NORTH 2000 WEST FARR WEST UT 84404 801 732-8807 P1378 08/24/2024 CLASS 4 SUNBURST FOOD MART 1326 EAST 5600 SOUTH MURRAY UT 84121 801-278-3970 P700 10/21/2024 CLASS 4 SUNPRO CHEVRON 395 SOUTH [...] MURRAY 5664 S 900 E MURRAY UT 84121 P106031 11/02/2024 CLASS 4 ACE HARDWARE - PAYSON 84 EAST UTAH AVE PAYSON UT 84651 801-465-3722 P17504 05/22/2025 CLASS 4 ACE HARDWARE - PRICE 720 W PRICE RIVER DR PRICE UT 84501 801-973-4400 P149026 05/17/2025 CLASS 4 ACE HARDWARE - SOUTH OGDEN 4291 HARRISON BLVD OGDEN UT 84403 801-452-6010 P18284 03/28/2025 CLASS 4 ACE HARDWARE @ BRIGHTON POINTE 3438 BENGAL BLVD SALT LAKE CITY UT 84121 UT 84121 801-683-0383 P117421 10/07/2024 CLASS 4 ACE HARDWARE LONE PEAK [...] P110621 12/10/2024 CLASS 4 CHOICE HARDWARE & HOME CENTER 1005 NORTH MAIN STREET NEPHI UT 84648 P13291 02/28/2025 CLASS 4 CITY ACE HARDWARE - MARMALADE 477 N 300 W SALT LAKE CITY UT 84770 385-297-7670 P139426 11/23/2024 CLASS 4 CORAL CANYON MARKET 41 NORTH 6300 WEST HURRICANE UT 84737 435 628-4858 P2392 08/03/2024 CLASS 4 CORAL SANDS RV PARK 150 S 6TH WEST BLUFF UT 84512 435 672 2232 P136026 05/25/2025 CLASS 4 COSTCO WHOLESALE #672 835 NORTH 3050 EAST ST GEORGE UT 84790 P100621 01/13/2025 CLASS",
        "score": 0.37230033,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual",
        "snippet": "\"ZZ\" can be NH or SH; and \"YY\" can be BB or TB Sunpower Sunpower standard (G3 or G4) or InvisiMount (G5) 35, 40 and 46 mm frames SPR-Zb-xxx-YY Where \"Z\" can be A, E, M, P or X; “b” can be blank, 17, 18, 19, 20, 21, or 22; and “YY” can be blank, BLK, COM, C-AC, D-AC, E-AC, BLK-E-AC, G-AC, BLK-G-AC, H-AC, BLK-H-AC, BLK-C-AC, or BLK-D-AC Sunspark Sunspark modules with 40 mm frames SYY-xxxZ-A Where “YY” can be MX or ST; and “Z” can be M, MB, M3, M3B, P or W; and \"A\" can be 60 or 72 Suntech Suntech [...] be blank, HomePV, Bifacial, M10-SL, M10-SL-BLK, M10 TPC SL, M10 Bifacial, M10 SL-Bifacial, M10 TPC SL Bifacial, M10 NTYP SL or M10 NTYP SL Bifacial HT-SAAE HT-SAAE modules with 35 and 40 mm frames HTyy-aaaZ-xxx Where \"yy\" can be 60, 66, 72 or 78, \"aaa\" can be 18, 156 or 166, \"Z\" can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C, X or X (ND)-F Hyperion Solar (Runergy) Hyperion or Runergy modules with 30 and 35 mm frames HY-DHzzzA8-xxxB Where \"zzz\" can be 108 or 144; \"A\" can be N or [...] PA05, PC05, PD05, PD06, PA14, PC14, PD14, PE14, PE15, NE19RC, NED19RC, NEG19RC, NE09RC or NE09RH.05 ; and \"ZZ\" can be blank, .05, .05(II), .08, .08(II), .10, .18, .08D, .18D, 0.82, .002, .00S, 05S, 08S, .20, .20(II), A, A.05, A.08, A.10, A.18, (II), A(II), A.05(II), A.08(II), A.082(II), A.10(II), A.18(II), C.05, C.07, C.05(II), C.07(II), H, H(II), H.05(II), H.08(II), HC.20(II), HC.20(II), M, M(II), M.05(II), MC.20(II) Universal Universal Solar Modules with 35 mm frames UNI-xxx-yyyZZZ-aa Where",
        "score": 0.36134556,
        "bucket": "installation"
      },
      {
        "url": "https://oze.subregion.pl/wp-content/uploads/sites/5/2020/12/Lista-Wykonawcow-Instalacje-fotowoltaiczne-16.12.2020-3.pdf",
        "title": "[PDF] Instalacje fotowoltaiczne",
        "snippet": "TS4-R ul. Urbana 28 fotowoltaiczne Ja Solar JAM60S10 330-335 3.0-3-S – 4.5-3-S 47-400 Racibórz 3.0-3-M – 20.0-3-M SolarEdge P300-P700 Longi LR6-60HPH 315-320M Kontakt: SolarEdge SE3K-10K Piotr Tumulka Phono Solar TwinPlus 305-320 506 304 840 SMA Sunny Tripower 3.0-10.0 EXE Solar A-HCUT 320 - E02E 12 BB GW1000/1500/2000/3000-NS EXE Solar A-HCUT 330 - E02E 5BB GW3000/3600-D-NS EXE Solar A-HCM330/120 5BB Full GW4000/5000/6000/8000-DT Black 330 W GoodWe10KN-DT Huawei SUN2000L-2/3/3.68/KTL Huawei [...] 1-3,6 kW Canadian Solar CS3K-325 Senergy 5kW Solar Edge SE3K-10K, SE12.5K, SE15K, SE16K, SE17K Canadian Solar CS3L-360 29. Energetyka Solarna Ensol Instalacje EXE Solar A-HCUT 320 - E02E 12 Fronius SYMO 3.0-3-S - 4,5-3-S TIGO TS4-RO Sp. z o.o. fotowoltaiczne BB Fronius SYMO 3.0-3-M - 20.0-3-M ul. Piaskowa 11 EXE Solar A-HCUT 330 - E02E 5BB SolarEdge P300 – P700 47-400 Racibórz EXE Solar A-HCM330/120 5BB Full SolarEdge SE3K-SE10K Black 330 W Kontakt: SMA Sunny Tripower 3.0/4.0/ 5.0/6.0/8.0/10.0 [...] SunPRO 330Wp - SPP 330-345- 120M SunPRO 330Wp - SSP 330-345- 120M 64. EKO WAT Instalacje Longi LR6-60 HPH 305M-325M SofarSolar TL SolarEdge P300-P505 ul. Polna 6b/12 fotowoltaiczne Longi LR4-60HPH 350M-370M 47-400 Racibórz SolarEdge SE 3000H - 4000H TIGO TS4-RO Ja Solar JAM60S03 305-325/PR SolarEdge SE3K-SE10K Kontakt: Grzegorz Suchodolski Cheetah HC 60M 330 Watt SMA Sunny Boy 3.0 / 3.6 / 4.0 / 5.0 882 482 444 Sunny Tripower 3.0 / 4.0 / 5.0 / 6.0 ekowat.suchodolski@gmail.com Hanwha Q-cells",
        "score": 0.35622323,
        "bucket": "installation"
      },
      {
        "url": "https://firemarshal.utah.gov/wp-content/uploads/LP-GAS-COMPANIES-12-2-24.pdf",
        "title": "[PDF] Liquid Propane GAS COMPANIES - Utah State Fire Marshal's Office",
        "snippet": "GETAWAY 13701 N HIGHWAY 191 MOAB UT 84532 435 259-7854 P638 06/21/2025 CLASS 4 SUN OUTDOORS MOAB DOWNTOWN 555 SOUTH MAIN STREET MOAB UT 84532 435 259-6848 P2320 06/21/2025 CLASS 4 SUNBELT RENTALS 1548 NORTH 2000 WEST FARR WEST UT 84404 801 732-8807 P1378 08/24/2025 CLASS 4 SUNBURST FOOD MART 1326 EAST 5600 SOUTH MURRAY UT 84121 801-278-3970 P700 10/21/2025 CLASS 4 SUNPRO CHEVRON 395 SOUTH MAIN STREET SPRINGVILLE UT 84663 801-222-3387 P108621 09/17/2025 CLASS 4 SUNRISE ENTERPRISES INC. [...] 3245 WEST 2100 SOUTH WEST VALLEY CITY UT 84119 801 972-6674 P502 05/18/2025 CLASS 1 SUMMIT CREEK LLC 183 N MAIN STREET SMITHFIELD UT 84335 435 563-2490 P2032 06/02/2025 CLASS 4 SUMMIT OIL COMPANY 1390 JORDAN RIVER DR NORTH SALT LAKE UT 84054 801-444-1915 P146826 01/24/2025 CLASS 1 SUMMIT RV REPAIR LLC 2479 W 14850 S BLUFFDALE UT 84065 801 694 2548 P149916 06/25/2025 CLASS 3 SUN OUTDOORS ARCHES GATEWAY 1773 N HWY 191 MOAB UT 84532 435-259-4469 P17804 06/21/2025 CLASS 4 SUN OUTDOORS CANYNLNDS [...] CHEYENNE WY 82001 307-509-0388 P125821 12/28/2024 CLASS 4 KIVA UNITED ENERGY INC 10281 SOUTH STATE STREET SANDY UT 84070 801-553-7001 P2213 03/22/2025 CLASS 1 KJ'S CATCH N SNACK 245 E IVY STREET SCOFIELD UT 84526 435 448 9697 P129221 06/21/2025 CLASS 4 KODACHROME BASIN STATE PARK 2905 S KODACHROME STATE PRK RD CANNONVILLE UT 84718 435 679 8562 P142026 05/09/2025 CLASS 4 KSS COR 5404 SOUTH 4220 WEST KEARNS UT 84118 801-963-1902 P2950 04/23/2025 CLASS 4 L&L MECHANICAL 3218 E DESERET DR ST GEORGE",
        "score": 0.34442192,
        "bucket": "installation"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOorkyiyjvdupm_u5WS3k7WVUUgffxf7AXSTRTJXV3S6meDMDRLx8",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "INSTALLATION TOOLS & ACCESSORIES. NEW. Page 41. Code. Description. Brush. Power. Pole Length. Kit Includes. X21-9M. Manual Solar Cleaning Brush. X41-AC-5.5M.",
        "score": 0.2979809,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/pitched-roof-mounting/resources/brochures/IronRidge_Flush_Mount_Installation_Manual.pdf",
        "title": "[PDF] xr flush mount installation manual - IronRidge",
        "snippet": "modules with 30 mm frames EVPVxxxA Where \"A\" can be blank or H, K, HK, HK2 or PK Peimar Peimar modules with 40 mm frames SbxxxYzz Where “b” can be G, M or P; “Y” can be M or P; and “zz” can be blank, (BF) or (FB) Philadelphia Solar Philadelphia modules with 30, 35 and 40 mm frames PS-YzzAA-xxxW Where \"Y\" can be M, MNB, MNG or P; \"zz\" can be 60, 72, 108, 132, 144 or 156; \"AA\" can be blank, (BF), (HC), (HCBF) or (HCBF)-GG; and \"W\" can be blank or W Phono Solar Phono Solar modules with 30, 35 and [...] no perimeter guarding required • Module Types 4 and 5: Allowed with Steep Slope Roofs (≥ 9.5°). Any module-to-roof gap is permitted, low edge guarding (Trim) required • Class A rated PV systems can be installed on Class A, B, and C roofs without affecting the roof fire rating CLASS B SYSTEM FIRE RATING PER UL 2703 • Module Types 4 and 5: Allowed with Steep Slope Roofs (≥ 9.5°). Any module-to-roof gap is permitted, with no perimeter guarding required. [...] DNA-yy-zzaa-xxxbb Where \"yy\" can be 108, 120 or 144; \"zz\" can be MF or BF; \"aa\" can be 10, 23 or 26; and \"bb\" can be blank or W-DG Astronergy Solar Astronergy modules with 30, 35 and 40 mm frames aaSMbbyyC/zz-xxx Where “aa” can be CH or A; \"bb\" can be 60, 66, or 72; “yy” can be blank, 10 or 12; \"C\" can M, P, M(BL), M-HC, M(BL)-HC, P-HC, M(DG), M(DGT) or N(DG); and “zz” can be blank, HV, F-B, or F-BH ASUN ASUN modules with 35 and 40 mm frames ASUN-xxx-YYZZ-aa Where \"YY\" can be 60 or 72; \"ZZ\" can",
        "score": 0.28400522,
        "bucket": "installation"
      },
      {
        "url": "https://acdc.co.za/uploads/shortforms/attachment/1725259451_ACDC%20SFC%20SOLAR%2013th%202024_web.pdf?srsltid=AfmBOoqmcTY_oIkWcfqyFLAs9mqa2tDLp6itbfR_898RSTypGpbfm_t4",
        "title": "[PDF] SOLUTIONS - ACDC Dynamics",
        "snippet": "Solar Panel. 5V/18W Polycrystalline. 350 x 350 x 17. Functions. • LED light output will be gradually reduced as the battery is depleted.",
        "score": 0.19328474,
        "bucket": "installation"
      },
      {
        "url": "https://res4live.eu/wp-content/uploads/2025/03/RES4LI2_compressed-1.pdf",
        "title": "[PDF] Report with the results obtained on energy and ... - RES4LIVE",
        "snippet": "The pump transfers heat from the solar field to the solar station heat ... The field data post-installation from the farm has been collected, and analysis is done",
        "score": 0.1358617,
        "bucket": "installation"
      },
      {
        "url": "https://www.sunpropower.com/sunpropower/2024/09/30/warrantydocumentsingleglass.pdf",
        "title": "[PDF] Limited Warranty for PV Modules - Sunpro Power",
        "snippet": "Our goods come with guarantees that cannot be excluded under the Australian Consumer Law. You are entitled to a replacement or refund for a major failure and compensation for any other reasonably foreseeable loss or damage. You are also entitled to have the goods repaired or replaced if the goods fail to be of acceptable quality and the failure does not amount to a major failure. [...] application, installation, use and service conditions. If MODULES fail to conform to this warranty, then for a period ending 360 months from date of sale as shown in the invoice to the direct customer of Sunpro Power either repair or replace the product, or refund the purchase price as paid by the CUSTOMER. The repair or replacement or refund remedy shall be the sole and exclusive remedy provided under the “Limited Product Warranty” and shall not extend beyond the 360 months period set forth [...] have no responsibility or liability whatsoever for damage or injury to persons or property, or for other loss or injury resulting from any cause whatsoever arising out of or related to the MODULES, including, without limitation, any defects in the MODULE, or from use or installation. Under no circumstances shall Sunpro Power be liable for incidental, consequential or special damages, howsoever caused. Loss of use, Loss of profits, loss of production, loss of revenues are therefore specifically",
        "score": 0.68191797,
        "bucket": "other"
      },
      {
        "url": "https://www.newntide.com/wp-content/uploads/2024/11/Sunpro-Series-Installation-Users-Manual.pdf",
        "title": "[PDF] Installation & User's Manual - newntide",
        "snippet": "Max. Heating Capacity (kW) 1.73~6.06 Power Input (kW) 0.28~1.31 COP 6.18~4.63 [Space Heating] Ambient Temp. (DB/WB): 7°C/6°C, Water Temp. (Inlet/Outlet): 50°C/55°C.\nMax. Heating Capacity (kW) 1.12~5.29 Power Input (kW) 0.26~2.03 COP 4.31~2.61 [Space Cooling] Ambient Temp. (DB/WB): 35°C / -, Water Temp. (Inlet/Outlet): 12°C/7°C.\nMax. Cooling Capacity (kW) 0.97~4.86 Power Input (kW) 0.21~1.76 EER 4.62~2.76 [Hot Water] Ambient Temp. (DB/WB): 20°C/15°C, Water Temp. from 15°C to 55°C. [...] Max. Heating Capacity (kW) 11.04 13.50 16.81 22.29 Power Input (kW) 2.43 3.06 3.94 5.16 COP 4.54 4.41 4.27 4.32 Electric Heater Rated Input (kW) 3/6/9(optional) 3/6/9(optional) Max. Power Input (kW) 6.8(3.8+3) 9.8(3.8+6) 12.8(3.8+9) 7.7(4.7+3) 10.7(4.7+6) 13.7(4.7+9) 9.6(6.6+3) 12.6(6.6+6) 15.6(6.6+9) 9.6(6.6+3) 12.6(6.6+6) 15.6(6.6+9) Max. Running Current (A) 19.2(5.5+13.7) 14.6(5.5+9.1) 19.2(5.5+13.7) 21.5(7.8+13.7) 16.9(7.8+9.1) 21.5(7.8+13.7) 25.2(11.5+13.7) 20.6(11.5+9.1) 25.2(11.5+13.7) [...] Max. Heating Capacity (kW) 11.54~29.82 12.86~31.74 Power Input (kW) 1.90~6.95 2.18~7.58 COP 6.07~4.29 5.90~4.19 [Space Heating] Ambient Temp. (DB/WB): 7°C/6°C, Water Temp. (Inlet/Outlet): 50°C/55°C.\nMax. Heating Capacity (kW) 7.81~28.93 8.73~30.91 Power Input (kW) 1.77~11.17 1.99~12.22 COP 4.41~2.59 4.39~2.53 [Space Cooling] Ambient Temp. (DB/WB): 35°C / -, Water Temp. (Inlet/Outlet): 12°C/7°C.",
        "score": 0.4718322,
        "bucket": "other"
      }
    ]
  }
]