[
  {
    "manufacturer": "mounting-systems",
    "product": "Mounting Systems MS-COMPACT",
    "candidates": [
      {
        "url": "https://prod-edam.honeywell.com/content/dam/honeywell-edam/hbt/en-us/documents/literature-and-specs/datasheets/Select_Series_Bases_SPDS901.pdf",
        "title": "[PDF] Select Series Mounting Base Options",
        "snippet": "B200S-WH, B200S-IV, B200S-LF-WH, B200S-LF-IV, B200SR-WH, B200SR-IV, B200SR-LF-WH, B200SR-LF-IV: 6.85\" (17.4 cm) B300-6, B300-6-IV: 6.1\" (155 mm) B224BI-WH, B224BI-IV, B224RB-WH, B224RB-IV: 6.85\" (17.4 cm) Base Height (without sensor) B501-WHITE, B501-IV, B501-BL: 0.74\" (18.8 mm) B200S-WH, B200S-IV, B200S-LF-WH, B200S-LF-IV, B200SR-WH, B200SR-IV, B200SR-LF-WH, B200SR-LF-IV: 1.6\" (4.1 cm) B300-6, B300-6-IV: 0.76\" (19 mm) B224BI-WH, B224BI-IV, B224RB-WH, B224RB-IV: 1.61\" (4.1 cm) Weight: [...] M02-09-00 Test magnet with telescoping handle Select Series Junction Box Selection Guide Model Single Gang Double Gang 3.5\" Octagonal 4\" Octagonal 4\" Square 4\" Square with mud ring 50 mm 60 mm 70 mm 75 mm B501-WHITE, B501-IV, B501-BL No No Yes No No Yes Yes Yes Yes No B200S-WH, B200S-IV, B200S-LF-WH, B200S-LF-IV, B200SR-WH, B200SR-IV, B200SR-LF-WH, B200SR-LF-IV Yes Yes Yes Yes Yes Yes No No No No B300-6, B300-6-IV Yes No Yes Yes Yes Yes No No No No B224BI-WH, B224BI-IV Yes Yes Yes Yes Yes Yes [...] Set Time Position 1, Short Delay: 60 to 100 ms Position 2, Long Delay: 6 to 10 sec Reset Time 20 ms max.",
        "score": 0.47329262,
        "bucket": "datasheets"
      },
      {
        "url": "https://meraki.cisco.com/wp-content/uploads/2020/10/meraki_datasheet_ms120_compact.pdf",
        "title": "[PDF] Datasheet | MS120-8 Compact Switch - Cisco Meraki",
        "snippet": "non-blocking compact switch • 67/124 watt PoE budget with PoE+ support and dynamic power allocation for powering access points, phones, cameras, and other PoE-enabled devices • 6 dedicated QoS queues for converged voice, video, and data applications • Integrated mounting brackets for wall or desk mounting, with included Kensington security slot • Lifetime hardware warranty and advanced replacement at no additional cost Cisco Systems, Inc. | 500 Terry A. Francois Blvd, San Francisco, CA 94158 | [...] Datasheet | MS120-8 Compact Switch MS120-8 Compact Switch CLOUD-MANAGED COMPACT ACCESS SWITCHES Cisco Meraki MS120-8 compact switches provide Layer 2 access switching in a fanless, compact form factor. All models include 1G SFP uplinks, integrated mounting brackets, and a Kensington security slot, making them ideal for rapid and secure deployment to branch locations. [...] Sticky MAC, MAC whitelisting DHCP snooping, detection and blocking IPv4 and IPv6 ACLs Performance Switching capacity: 20Gbps Forwarding rate: 14.88mpps with standard packet size Jumbo frame support (9578 byte ethernet frame) Flow control support Power Power input: 100 - 240 VAC, 47-63 Hz Power consumption: 6-162 W External power supply for MS120-8, MS120-8 LP Mounting Wall or utility board mountable with included mount hardware Desktop-mountable with included feet Kensington lock slot included",
        "score": 0.41577685,
        "bucket": "datasheets"
      },
      {
        "url": "https://literature.rockwellautomation.com/idc/groups/literature/documents/td/1769-td005_-en-p.pdf",
        "title": "[PDF] CompactLogix Controllers Specifications - Literature Library",
        "snippet": "Type tested at 2257V rms for 60 seconds between Input power and pass through power. Weight, approx (with mounting feet) 5.40 kg (11.90 lb) 5.62 kg (12.40 lb) Module location Panel mount Panel-mount screw torque 6.6 N•m (58 lb•in) - use M6 screw Wire category(1) 3 - on USB ports 2 - on power ports 2 - on Ethernet ports Wire type, Ethernet RJ45 connector according to IEC 60603-7, 2 or 4 pair Category 5e minimum cable according to TIA 568-B.1 or Category 5 cable according to ISO/IEC 24702 M12, [...] Over 32767 32767 5250 5250 17202 17202 10500 10500 0…5.0V 5.0V +5.0V Normal 31207 31207 5000 5000 16383 16383 10000 10000 0.0V 0.0V Normal 0 0 0 0 0 0 0 0 -0.5V -0.5V -0.5V Under -3121 -3121 -500 -500 -1638 -1638 -1000 -1000 Under -0.5V -1.0V -0.5V Under -6241 -3121 -500 -500 -3277 -1638 -2000 -1000 0…10V Over 10.5V 11.0V +10.5V Over – – 11000 10500 18021 17202 11000 10500 +10.5V +10.5V +10.5V Over 32767 32767 10500 10500 17202 17202 10500 10500 0…10.0V +10.0V +10.0V Normal 31207 31207 10000 [...] – +10.5V +10.5V +10.5V Over 32767 32767 10500 10500 16793 16793 10500 10500 ±10V +10.0V +10.0V Normal 31207 31207 10000 10000 16383 16383 10000 10000 0.0V 0.0V Normal 0 0 0 0 8192 8192 0 0 -10.0V -10.0V Normal -31207 -31207 -10000 -10000 0 0 -10000 -10000 -10.5V -10.5V -10.5V Under -32767 -32767 -10500 -10500 -410 -410 -10500 -10500 Under 10.5V -11.0V -10.5V Under – – -11000 -10500 -819 -410 -11000 -10500 0…5V Over 5.25V 5.5V +5.25V Over – – 5500 5250 18021 17202 11000 10500 5.25V 5.25V +5.25V",
        "score": 0.25182748,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOop8KlNv9l2-Q70A7DX6wHNz23sBCSGIq8GXacj9EQ20piw5zogV",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] 23 Alpha+ Installation Manual If flashing is required for a particular application or jurisdiction, flashings and flashing materials may be procured from a number of sources. Contact Mounting Systems, Inc. for more information and recommendations. The following instructions provide basic installation procedures for each Mounting Systems, Inc. roof hook type. [...] • The use of shared rails requires precise positioning of the base rails. Mounting Systems strongly recommends the use of appropriate tile roof attachments with adequate adjustability.\n• Mounting Systems recommends fabrication and use of a gauge, such as a length of dowel or PVC pipe, to be used to precisely position and maintain the distance between roof attachments in the N-S direction.",
        "score": 0.6337056,
        "bucket": "installation"
      },
      {
        "url": "https://literature.rockwellautomation.com/idc/groups/literature/documents/in/1769-in006_-en-p.pdf",
        "title": "[PDF] 1769-IN006B-EN-P, Compact 120V ac Input Module Installation ...",
        "snippet": "5 Publication 1769-IN006B-EN-P System Assembly The module can be attached to the controller or an adjacent I/O module before or after mounting. For mounting instructions, see “Panel Mounting” on page 6, or “DIN Rail Mounting” on page 7. To work with a system that is already mounted, see “Replacing a Single Module within a System” on page 8.\nThe following procedure shows you how to assemble the Compact I/O system.\n1.\nDisconnect power.\n2. [...] Publication 1769-IN006B-EN-P Compact™ 120V ac Input Module (Catalog Number 1769-IA16) Installation Instructions Inside Module Description.........................................................................................3 Module Installation..........................................................................................4 System Assembly ...........................................................................................5 Mounting Expansion [...] On a clean work surface, assemble no more than three modules.\n2.\nUsing the assembled modules as a template, carefully mark the center of all module-mounting holes on the panel.\n3.\nReturn the assembled modules to the clean work surface, including any previously mounted modules.\n4.\nDrill and tap the mounting holes for the recommended M4 or #8 screw.\n5.\nPlace the modules back on the panel, and check for proper hole alignment.\n6.\nAttach the modules to the panel using the mounting screws.",
        "score": 0.528607,
        "bucket": "installation"
      },
      {
        "url": "https://literature.rockwellautomation.com/idc/groups/literature/documents/um/5069-um004_-en-p.pdf",
        "title": "[PDF] Compact 5000 Digital I/O Modules User Manual - Literature Library",
        "snippet": "Publication 5069-IN001 5069-FPD Publication 5069-IN002 5069-ARM Publication 5069-IN003 5069-AENTR Publication 5069-IN004 5069-IB16, 5069-IB16F, 5069-IB16K Publication 5069-IN006 5069-IB6F-3W Publication 5069-IN007 5069-OB16, 5069-OB16F, 069-OB16K Publication 5069-IN008 5069-OW4I Publication 5069-IN009 5069-OX4I Publication 5069-IN010 5069-IF8 Publication 5069-IN011 5069-IY4, 5069-IY4K Publication 5069-IN012 5069-OF4, 5069-OF4K, 5069-OF8 Publication 5069-IN015 5069-IA16 Publication 5069-IN016 [...] the input module, as shown. [...] table defines terms that are used in this manual.",
        "score": 0.46191534,
        "bucket": "installation"
      },
      {
        "url": "https://literature.rockwellautomation.com/idc/groups/literature/documents/in/1769-in057_-en-p.pdf",
        "title": "[PDF] Compact™ Combination Analog I/O Module - Rockwell Automation",
        "snippet": "Publication 1769-IN057A-EN-P - July 2001 Installation Instructions Compact™ Combination Analog I/O Module (Catalog Number 1769-IF4XOF2) Inside Module Description ..................................................................................2 Module Installation...................................................................................3 System Assembly......................................................................................4 Mounting Expansion [...] ATTENTION !\nDuring panel or DIN rail mounting of all devices, be sure that all debris (metal chips, wire strands, etc.) is kept from falling into the module. Debris that falls into the module could cause damage on power up. [...] 4 Compact™ Combination Analog I/O Module Publication 1769-IN057A-EN-P - July 2001 System Assembly The module can be attached to the controller or an adjacent I/O module before or after mounting. For mounting instructions, see “Panel Mounting” on page 6, or “DIN Rail Mounting” on page 7. To work with a system that is already mounted, see “Replacing a Single Module within a System” on page 7.\nThe following procedure shows you how to assemble the Compact I/O system.\n1. Disconnect power.",
        "score": 0.4403014,
        "bucket": "installation"
      },
      {
        "url": "https://images.thdstatic.com/catalog/pdfImages/65/65a6b329-89ee-4f4c-ae49-f77d48d703e2.pdf",
        "title": "[PDF] Installation Manual",
        "snippet": "． Connect the 2 wires of the decoration panel to the mainboard of the unit. 5-core wire X 言琶荨 10-core wire ． Fasten the control box lid with 2 screws . 1 2 Decoration Panel Screws (MS)(supplied with the panel) 15 ． Close the intake grille, and slide the 2 grille hooks back.\nD[me]D 7 TEST OPERATION Make sure the control box lids are closed on the indoor and outdoor units.\nRefer to \"For the following items, take special care during construction and check after installation is finished\" on page 2. [...] ． ． Read this manual extensively before starting up the units.\n． For safety purposes, any unit operators must read the following cautions carefully.\nInstallation must be performed in accordance with the requirement of NEC and CEC, by authorized personnel only.\nThe safety precautions listed here are divided into two categories.\nA WARNING If these warnings are not adhered to, the unit may cause severe property damage, personal injury, or loss of life. [...] - After removing the packaging material from the paper patten for installation, attach the paper pattern for installation to the unit with the attached sc「ews as shown in figure below. 2 3 1 Pape「Pattern to「 Installation(on some models) 2 Center of the Ceiling Opening 3 Screws(supplied with the decoration panel) 3) Adjust the unit to the correct position for Installation.\n(Refer to the chapter \"Preparations before Installation\" on page 5.) 6 2.2 Figure of Body Size 2.",
        "score": 0.40077335,
        "bucket": "installation"
      },
      {
        "url": "https://www.canadiansolar.com/wp-content/uploads/2020/08/Installation_Manual_of_Standard_Solar_Modules_en.pdf",
        "title": "[PDF] INSTALLATION MANUAL OF STANDARD SOLAR MODULES",
        "snippet": "30 | Use four clamps on the long side. Mounting rails run parallel to the long side frame. A1 A1 A1 A1 A1 range = (240 – 330) mm Maximum Load: Uplift load ≤ 2400 Pa Downforce load ≤ 4000 Pa CS1VL-MS, CS1A-MS, CS1HA-MS Use four clamps on the long side. Mounting rails run perpendicularly to the long side frame. Use four clamps on the short side. Mounting rails run parallel to the long side frame. [...] · Insertion methods can vary and depend on the mounting structures. The installer needs to follow the mounting guidelines recommended by the mounting system supplier. Each module must be securely maintained through all its length on two opposite sides. Install and tighten the insertion profiles to the support structure using the hard­ ware and instructions provided by the mounting system manufacturer. The system designer and installer are solely responsible for load calculations and for the [...] 6.0 MOUNTING INSTRUCTIONS The applicable regulations pertaining to work safety, accident prevention and securing the construction site must be observed. Workers and third party personnel shall wear or install fall arrest equipment. Any third party need to be protected against injuries and damages.",
        "score": 0.294469,
        "bucket": "installation"
      },
      {
        "url": "https://literature.rockwellautomation.com/idc/groups/literature/documents/um/1769-um011_-en-p.pdf",
        "title": "[PDF] 1769 CompactLogix Controllers User Manual - Rockwell Automation",
        "snippet": ". . . . . . . . 23 Minimum Spacing. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 23 Dimensions. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24 Ground the Wiring. . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 24 Mount the Panel . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . . 25 Mount the Controller on the DIN Rail . . . . . [...] ATTENTION: During panel or DIN-rail mounting of all devices, be sure that all debris (such as metal chips or wire strands) is kept from falling into the controller. Debris that falls into the controller could cause damage while the controller is energized. [...] Mount the System Minimum Spacing Maintain spacing from enclosure walls, wireways, and adjacent equipment. Allow 50 mm (2 in.) of space on all sides, as shown. This provides ventilation and electrical isolation.\nATTENTION: When attaching the controller, power supply, and I/O modules, make sure the bus connectors are securely locked together to be sure of proper electrical connection.\nThis equipment is not resistant to sunlight or other sources of UV radiation.",
        "score": 0.26127717,
        "bucket": "installation"
      },
      {
        "url": "https://igate.multisalesinc.com/WOEB/Docs/e3_Install_Instructions.pdf",
        "title": "[PDF] 620-100531B e3 eMerge UL Installation Instructions.indd - Multi Sales",
        "snippet": "www.linearcorp.com 5 e3 eMerge Installation Instructions 3.0 Installing the Control Panel 3.1 Mounting the Compact Enclosure Th e housing is designed to accommodate the necessary wiring connections for most installations. Th e compact enclosure is optimized to run wires under the back panel and thru the knockouts shown in Figure 3.1 and Figure 3.2. Th e enclosure should be mounted vertically on a wall, in a secure location within normal temperature and humidity levels. Installing the Panel 1. [...] Figure 3.2. Mounting Feet / Extensions for Compact Enclosure www.linearcorp.com 7 e3 eMerge Installation Instructions 3.2 Mounting the Metal Enclosure Th e metal enclosure is designed to accommodate one or two 12VDC 7Ah backup batteries and the necessary wiring connections for most installations. Conduit knock-outs are provided on all sides of the enclosure. Th e enclosure should be mounted vertically on a wall in a secure location within normal temperature levels. A minimum of 12 inches of [...] PIP; P/N 0-291312RU ♦ Linear 12VDC/60W (5A) PIP; P/N 0-299177RU (required for UL installations) ♦ Linear e3 PoE module; P/N 620-100159 (requires additional high power PoE injector). PoE is not supported for installations requiring UL294. 4.1 Power Connection for Systems using Compact Enclosure Power Supply Connection 1. Connect 12VDC from the included power supply to the +12V and GND input terminals on the panel. Note: e3 eMerge systems require a 12VDC, 2 amp Class 2 power supply. Incorrect",
        "score": 0.2302012,
        "bucket": "installation"
      },
      {
        "url": "https://prod-edam.honeywell.com/content/dam/honeywell-edam/hbt/en-us/documents/manuals-and-guides/installation-guides/hbt-bms-Spyder_Model_5_Compact_VAV_Controller_Installation_Instructions_31-00362.pdf?download=false",
        "title": "[PDF] Spyder Model 5 COMPACT VAV CONTROLLER WEB-VA423B24N",
        "snippet": "controller features the following LEDs: Table 7. Description of LED behaviors Symbol Color Function Green Power LED indicating firmware problems, hardware problems, etc. Yellow Status LED indicating firmware problems, hardware problems, etc. Yellow LED indicating transmission of communication signals via the BACnet MS/TP interface. In case of no communication LED will be off. Yellow LED indicating reception of communication signals via the BACnet MS/TP interface. In case of no communication LED [...] isolated, it is recommended that those devices be connected to signal ground. NOTE 2: • Matched terminating resistors are required at each end of a segment bus wired across (+) and (-). Use matched precision resistors rated ¼ W ±1% / 80 - 130 Ω. Ideally, the value of the terminating resistors should match the rated characteristic impedance of the installed cable. For example, if the installed MS/TP cable has a listed characteristic impedance of 120 Ω, install 120 Ω matched precision resistors. [...] NOTE 3: • Following proper MS/TP cabling shield grounding procedures is important to minimize the risk of communication problems and equipment damage caused by capacitive coupling. Capacitive coupling is caused by placing MS/TP cabling close to lines carrying higher voltage. If shielding is used, the shielding of each individual bus segment should be separately connected at one end to earth. Fig. 14. Connection to a BACnet MS/TP Bus COMPACT VAV CONTROLLER WEB-VA423B24N – INSTALLATION",
        "score": 0.21730468,
        "bucket": "installation"
      },
      {
        "url": "https://www.cisco.com/c/en/us/td/docs/switches/lan/catalyst9200/hardware/install/b-c9200cx-hig.pdf",
        "title": "[PDF] Cisco Catalyst 9200CX Compact Series Switches Hardware ...",
        "snippet": "Warning Read the wall-mounting instructions carefully before beginning installation. Failure to use the correct hardware or to follow the correct procedures could result in a hazardous situation to people and damage to the system.\nWarning Ultimate disposal of this product should be handled according to all national laws and regulations. [...] Note Cisco Catalyst 9200CX Compact Series Switches Hardware Installation Guide 23 Figure 4: Components Delivered in the Shipping Box (Optional) Two 19-inch mounting brackets (RACKMNT-19-CMPACT=) 8 Cisco Catalyst 9200CX Series switch 1 (Optional) Two 23-inch mounting brackets (RCKMNT-23-CMPCT) 9 (Optional) AC power cord  2 (An AC power cord is available to order with AC-powdered switches. For C9200CX-12T-2X2G, a power cord is available with C9K-80W-ADPT, if ordered. [...] • Do not place the chassis where it will receive direct sunlight, particularly in the afternoon.\n• Do not place the chassis next to a heat source of any kind, including heating vents.\n• Adequate ventilation is particularly important at high altitudes. Make sure that all the slots and openings on the system remain unobstructed.\n• Clean the installation site at regular intervals to avoid buildup of dust and debris, which may cause a system to overheat.",
        "score": 0.16939245,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Warranty%20Statement.pdf?srsltid=AfmBOopaQ4fH3BEndWYiTtm1G4ftMFJLg9EbqbHUZM_YNUKly8cFGzWr",
        "title": "[PDF] Mounting Systems Warranty Statement - Solaris-shop.com",
        "snippet": "is 10 years. C. The warranty period for all non-metallic Product components is 2 years. D. Each warranty period commences on the date of delivery of the Product to the Customer. § 3 Procedures in the Event of a Warranty Claim If the Product exhibits defects that are covered under this Limited Warranty, then please promptly contact Mounting Systems Customer Service at (855) 731-9996 or at the address or facsimile number noted below. Please have the following information available when contacting [...] Mounting Systems, Inc. | 820 Riverside Parkway | West Sacramento, CA 95605 Contact: Phone 1 855 731 9996 | jobs@mounting-systems.us | www.mounting-systems.us § 1 Limited Warranty A. Mounting Systems, Inc., hereinafter referred to as “Mounting Systems”, warrants only to its direct customer (“Customer”) that the products listed below (each a “Product” and, collectively, the “Products”), when installed properly in the United States of America or Canada, will be free from defects in workmanship and [...] INCIDENTAL DAMAGES ARISING FROM OR OUT OF THE INSTALLATION OR USE OF ANY PRODUCT, OR ANY BREACH OF WARRANTY; WITHOUT LIMITING THE FOREGOING, MOUNTING SYSTEMS SHALL NOT BE LIABLE FOR PERSONAL INJURY, PROPERTY DAMAGE, LOST PROFIT, LOST REVENUE, HARM TO REPUTATION, LOSS OF DATA, ADVERTISING OR MANUFACTURING COSTS, OVERHEAD COSTS, LOST CUSTOMERS, OPERATIONAL DISRUPTIONS OR DOWN-TIME RESULTING FROM THE INSTALLATION OR USE OF ANY PRODUCT OR ANY BREACH OF WARRANTY. Some jurisdictions do not allow the",
        "score": 0.6745014,
        "bucket": "other"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_Produktkatalog-ProLine_EN_compressed.pdf",
        "title": "[PDF] Product Catalogue ProLine - Mounting Systems",
        "snippet": "The pre-assembled variant includes besides the roof hook: 1 bracket 84 x 40 x 7.75 mm, with slot 15 mm and ø 9 mm, T-head bolt and self-locking nut M8 for connection to the base rails, pre-assembled In the comfort version are support bracket for the base rails and small parts for the rail connection to the roof hooks pre-assembled Total height: 151 mm Base dimensions: 56 x 180 x 5 mm (W x L x T) Base holes: 12 x ø 7 mm Max. height adjustment: 38 mm to rail area Height in roof batten area: 35 - [...] 600 mm Black anodised 610-0714 1 1008 610-0714 2400 mm Natural 610-0070 1 504 610-0070 2500 mm Natural 610-0143 1 130 610-0143 2500 mm Black anodised 610-0144 1 130 610-0144 3150 mm Natural 800-0019 1 130 800-0019 3300 mm Natural 800-1412 1 130 800-1412 3600 mm Natural 800-1459 1 130 800-1459 3600 mm Black anodised 800-1460 1 130 800-1460 4150 mm Natural 800-0017 1 130 800-0017 4400 mm Natural 800-1411 1 130 800-1411 5200 mm Natural 800-1319 1 130 800-1319 6000 mm Natural 800-1057 1 130 [...] Total height: 171 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 40 - 51 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base plate: 95 x 100 mm (W x L) Base holes: 8 x ø 9 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21",
        "score": 0.6304352,
        "bucket": "other"
      },
      {
        "url": "https://us.allegion.com/content/dam/allegion-us-2/web-files/allegion/technical-documents/Allegion_Commercial_Warranty_015496.pdf",
        "title": "[PDF] LIMITED PRODUCT WARRANTY - Allegion US",
        "snippet": "from date of shipment from Company’s factory Effective on or after 02/04/25 015496, Rev 02/25 PRODUCT WARRANTY PERIOD SPECIFIC EXCLUSIONS LCN - Surface Mount • 4000 Series - 30 years • 4050 Series - 25 years • 1460 Series - 30 years • 1450 Series - 25 years • 1260 Series - 20 years • 1250 Series - 15 years Warranty begins from the date of shipment from Company’s factory LCN - Overhead Concealed (2010/5010 Series, 2030/5030/6030 Series, 3030/3130 Series) 15 years from the date of shipment from [...] Series, L Series, INPACT Series, CE Series, B Series) 1 year from date of shipment from Company’s factory Product will be repaired or replaced as authorized by Company Excludes: • Return of Product unless authorized by Company Steelcraft - Frames (C/CK Series, DE Series, F Series, MU Series, FE Series, DW/K Series, FN Series, FT Series, FS/KS/MS Series, FP Series) 1 year from date of shipment from Company’s factory Product will be repaired or replaced as authorized by Company Excludes: • Return [...] include the Province of Quebec), this warranty is not transferable. What is not Covered: The following costs, expense and damages are not covered by the provisions of this warranty: (i) back charges or labor costs including, but not limited to, such costs as the removal and reinstallation of the Product or for normal maintenance; (ii) shipping and freight expenses required to return the Product to Schlage; (iii) failures, defects, or damage (including, but not limited to, any security related",
        "score": 0.514718,
        "bucket": "other"
      },
      {
        "url": "https://catalogue.k2-systems.com/media/ab/1d/f3/Product-Brochure-en.pdf",
        "title": "[PDF] Mounting systems - K2 Catalogue",
        "snippet": "draining ­ rainwater with optional roof drainage Layout • In single or double version with 10° inclination • Module layout 3x portrait Optional trapezoidal sheet metal roofing Available in two versions: • With trapezoidal sheet metal covering for robust protection and classic aesthetics • Without trapezoidal sheet metal cladding for the use of bifacial modules and a more modern look 1. [...] mounted solutions. [...] Standing seam • Multitude of application possibilities: Double standing seam, angled seam, snap seam and round seam • Direct lateral rail connection • Penetration-free assembly Corrugated fibre cement and corrugated sheet metal • For all corrugated fibre cement and corrugated sheet metal roofing with wooden substructure • Secure sealing on the roofing • Climber connection • abZ (general technical approval) in Germany Roof tiles and slate • Roof hooks for the majority of clay tiles, pantiles and",
        "score": 0.40825373,
        "bucket": "other"
      },
      {
        "url": "https://www.enerack.com/uploadfile/downloads/2025%20Enerack%20Solar%20Mounting%20System%20Catalog.pdf",
        "title": "[PDF] 2025 Enerack Solar Mounting System Catalog.pdf",
        "snippet": "years of experiences on design, production and sale. We achieved good trust from customers because of our stable and excellent products. We will try our best to become a world leading level of solar photovoltaic systems integration solutions supplier. ABOUT US Enerack 3 4 Manufacturing facilities for both aluminum and steel products Global service Certification: TUV, UL 467, UL 2703, EN 1090 EXC 2 (system 2+), AS/NZS1170.2, and test with SGS Direct racking supply 15 Years warranty 15 [...] quality management system certification. Which are quality assurance for the products purchased by our customers. Our products design strictly in accordance with AS/NZS1170.2, JIS C 8955, MCS012, TUV, UL 467, UL 2703, EN 1090 EXC 2 (system 2+) European building codes and other standards. Ensure that every code and regulation is fully complied with all applicable local or national building codes. [...] the anti-corrosion requirements of the service life Ground Screw Length Conventional pile compression and tensile strength reference values(KN) N=3 N=5 N=7 N=10 Resistance compression Resistance compression Resistance compression Resistance compression Resistance Resistance Resistance Resistance 1600 1800 2000 8.7 9.9 11 9.1 10.2 11.4 14.6 16.5 18.4 15.2 17.1 19 20.4 23.1 25.8 21.4 24 26.7 29.2 33 36.8 30.6 34.4 38.2 Remarks: The N value of the soil in this table are based on the Swedish",
        "score": 0.23967884,
        "bucket": "other"
      },
      {
        "url": "https://www.swagelok.com/downloads/webcatalogs/en/ms-02-185.pdf",
        "title": "[PDF] Modular Platform Components (MPC) - Swagelok",
        "snippet": "A B Port 1 Port 2 0.42 (10.7) D 28 Modular Systems TUBE FITTINGS PIPE, WELD, VCR, VCO FITTINGS STANDARD TUBING MPC COMPONENTS HOSE / FLEXIBLE TUBING BELLOWS, DIAPHRAGM VALVES BALL & PLUG VALVES NEEDLE & METERING VALVES CHECK & RELIEF VALVES REGULATORS & FILTERS INSTRUMENT MANIFOLD SYSTEMS MEASUREMENT DEVICES REFERENCES MEDIUM- HIGH- PRESSURE Elbow-to-Swagelok Tube Fitting Number of Surface-Mount Positions Basic Ordering Number A in. (mm) 1 6L-MPC-MS-ME 1.58 (40.1) 2 6L-MPC-MS-MEMT01 3.18 (80.8) [...] (109) 4 A-MPC-PB-04 5.83 (148) 5 A-MPC-PB-05 7.36 (187) 6 A-MPC-PB-06 8.89 (226) 1.10 (27.9) 1.53 (38.9) 0.50 (12.7) A Parallel Manifold Components Jumper Tube Connectors Number of Surface-Mount Positions Ordering Number A in. (mm) 3 6L-MPC-MS-METB01ME 3.50 (88.9) 4 6L-MPC-MS-METB02ME 5.03 (128) 5 6L-MPC-MS-METB03ME 6.56 (167) 6 6L-MPC-MS-METB04ME 8.09 (205) Port 2 A Port 1 0.51 (13.0) Swagelok Substrate and Manifold Components Manifold Channels Number of Surface-Mount Positions Ordering Number [...] Fluorocarbon FKM (75 durometer) KZ-7075-OR-006 (quantity of 1) Kalrez 7075 compound Seals, Mounting Blocks, and Assembly Hardware MS-02-185, RevO, January 2022 Introduction Since 1947, Swagelok has designed, developed, and manufactured high-quality, general-purpose and specialty fluid system products to meet the evolving needs of global industries. Our focus is on understanding our customers’ needs, finding timely solutions, and adding value with our products and services.",
        "score": 0.16226083,
        "bucket": "other"
      },
      {
        "url": "https://meraki.cisco.com/wp-content/uploads/2020/05/meraki_datasheet_ms_family.pdf",
        "title": "[PDF] Meraki MS Series Switches",
        "snippet": "Included in the box MS120-8 series Integrated mounting brackets; external PSU (non-PoE and LP models); mounting screw kit; getting started insert MS120 series Mounting screw kit; getting started insert MS210 series Mounting screw kit; getting started insert MS225 series Mounting screw kit; getting started insert MS250 series Power supply (1); system fans (2); mounting screw kit; getting started insert MS350 series Stacking cable (1); power supply (1); system fans (2); mounting screw kit; [...] server + relay Warm spare (VRRP) Static + dynamic DHCP server + relay Warm spare (VRRP) Models MS410-16-HW MS410-32-HW MS425-16-HW MS425-32-HW MS450-12-HW Lifetime warranty with next-day advance replacement All Cisco Meraki MS switches include a limited lifetime hardware warranty that provides next-day advance hardware replacement. The Meraki simplified software and support licensing model also combines all software upgrades, centralized systems management, and phone support under a single, [...] 14 MS FAMILY DATASHEET MERAKI.COM Additional resources Meraki MS120 series datasheet Meraki MS125 series datasheet Meraki MS210 series datasheet Meraki MS225 series datasheet Meraki MS250 series datasheet Meraki MS350 series datasheet Meraki MS355 series datasheet Meraki MS390 series datasheet Meraki MS410 series datasheet Meraki MS425 series datasheet Meraki MS450 series datasheet 15 MS FAMILY DATASHEET MERAKI.COM",
        "score": 0.14880042,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "mounting-systems",
    "product": "Mounting Systems MS-FLAT",
    "candidates": [
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_Brochure-ProLine_2025_EN_compressed.pdf",
        "title": "[PDF] ProLine | Mounting Systems",
        "snippet": "to renewable energy, Mounting Systems sets the standard in the PV mounting industry. Mounting Systems GmbH has an experienced team of experts to help customers select the most suitable system for their specific needs and assist with system design and installation. With our wide range of products and services, Mounting Systems is a reliable partner for anyone looking for a safe and effective PV mounting solution. [...] Our products are designed to ensure reliable and secure mounting of photovoltaic systems on roofs, maximizing energy production from sunlight. They meet the highest safety standards and offers solutions for every conceivable situation. The systems are made of high-quality materials and are designed to withstand the harshest weather conditions and loads. In addition, the company is continuously developing and improving its products to maximize safety and efficiency. With passion and commitment [...] innovative fl at roof mounting system designed for maximum effi ciency with minimal eff ort. Pre-assembled components signifi cantly reduce installation time – with only a few connection points and just three screws per module row, the system is quick and easy to install.",
        "score": 0.61779,
        "bucket": "datasheets"
      },
      {
        "url": "http://5.imimg.com/data5/SELLER/Doc/2022/9/CC/PB/RG/3626194/ms-flats.pdf",
        "title": "[PDF] MS FLAT BAR",
        "snippet": "Tolerances of Mild Steel Flat Bar Depth Tolerance Width of flange Tolerance Up to 200 mm > 200 to 400 mm ± 2.5 mm ± 3.0 mm Up to 100 mm ± 2 mm Tolerance on weight per meter shall be ± 2.5% or alternatively +4, -1% of the standard weight per meter. The permissible limits for camber and sweep shall be 0.2% of the length. [...] 3.530 4.710 5.890 7.070 14.720 12.560 15.070 0.957 1.195 1.435 0.932 1.243 1.554 1.865 1.075 1.435 1.795 2.155 4.486 3.828 4.593 website:  MS Flat Sizes and Weights Size (in mm) Weight (in Kg/m) Weight (in Kg/feet) MS Flat 145 x 30 MS Flat 150 x 8 MS Flat 150 x 10 MS Flat 150 x 12 MS Flat 150 x 16 MS Flat 150 x 20 MS Flat 150 x 25 MS Flat 160 x 20 MS Flat 180 x 14 MS Flat 180 x 20 MS Flat 200 x 8 MS Flat 200 x 10 MS Flat 200 x 12 MS Flat 200 x 16 34.150 9.420 11.780 14.130 18.840 23.550 29.440 [...] website:  Mild Steel Flat Bar Chemical Composition: (in % max values) Tolerance Carbon % Manganese Max % Sulphur Max % Phosporous Max % Silicon Max % Carbon Equivalent 0.23 +0.02 1.50 0.045 0.045 0.40 0.42 +0.05 +0.005 +0.005 +0.03 +0.03 Mild Steel Flat Bar Mechanical Composition: (in % max values) Tensile Strength Min, Mpa Yield Stress, Min, MPa % Elongation at gauge length 5.65 √Ѕo Bend Test mm 410 <20 mm 250 20-40 mm 240 >40 mm 230 min 23 min 3t (t is 3 times thickness) website:",
        "score": 0.60358196,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOoral70PDYtvNC4pUhQu3p3rj2hs2hEpxuCD5p85nGpwT_3hO_ex",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles). [...] • Loosely install the Alpha+ L-feet on the mounting/ flashings with the preassembled T-head bolts facing the ridge of the roof. The L-feet may be aligned with the base of the \"L\" facing north or south (it may be necessary to disassemble and reassemble the T-bolts and nuts as appropriate).\n2 The MS Flashing Installation Manual can be found on Mounting Systems' website: \nus/downloads-technical-docs-warranty/ Image 5.3.1 MS flashing L-Foot Kit i NOTE! [...] • Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions.",
        "score": 0.5405607,
        "bucket": "datasheets"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_for_Flat_Roof_Applications_Addendum.pdf",
        "title": "[PDF] Ground Mount for Flat Roof Applications - IronRidge",
        "snippet": "UL 2703 LISTED Conforms to STD UL 2703 Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels • Scope of Evaluation includes bonding, grounding, mechanical loading, and fire classification • Max Overcurrent Protective Device (OCPD) Rating: 40A • Max Module Size: 36.8 ft² • Module Orientation: Portrait or Landscape • Actual system structural capacities and module sizes are defined [...] BLK G4.1/TAA, G5, BLK G5, BLK-G6+/HL, L-G4, L-G4.1, L-G4.2, L-G5.2, L-G5.3, L-G6.2, L-G6.3, L-G6.3/BFG, L G4.2, L-G4.2/TAA, L-G7, L-G7.2, L-G7.3, L-G8.2, L-G8.3, L-G8.3/BFG, L-G8.3/BGT, BLK-G10, BLK-G10+, BLK-G10+/AC, M-G2+, BLK M-G2+, BLK M-G2. [...] \"B\" can be blank or L; and \"cc\" can be blank, H, H-HC, H-HC-BF, H-HC-BF-DG or R-H-HC-BF BYD BYD Solar modules with 30mm frames BYDxxxZLBK Where \"Z\" can be M or N Canadian Solar Canadian Solar modules with 30, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, R, U, W, Y, -48TM, -54TM, -66TB, -66TM or -72TB; and \"Z\" can be blank, H, HP, P, PB-AG, M, MS, MS-HL, MB-AG, T or TB-AG © 2025 IRONRIDGE, INC. VERSION 4.6 GROUND MOUNT FOR FLAT ROOF APPLICATIONS -",
        "score": 0.39985907,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solarelectricsupply.com/media/sparsh/product_attachment/Tamarack-Solar-Ground-Mount-System-Installation-Manual_compressed.pdf?srsltid=AfmBOopyhPswWMozFObD7DulpJp5XLOtiXKN0yPT8Gk3jqZiUzb8xJ2D",
        "title": "[PDF] Tamarack-Solar-Ground-Mount-System-Installation ...",
        "snippet": "ETL Listed to UL 2307 for bonding and grounding when installed in accordance with this manual. Rails, clamps, splices, and mounting devices are UL2703 Listed for mounting flat-plate Photovoltaic Modules and Panels • Conforms to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\n• Certified to CSA STD LTR AE-001-2012 Photovoltaic Module Racking Systems. [...] Exposure Catergory B - Urban and suburban and wooded areas filled with obstructions the size of single family dwellings must surround the structure at least 2,630 ft or 10 times the structure height in all directions whichever is greater.\nExposure Catergory C - Open terrain with scattered obstructions having heights generally less than 30 ft [9.1 m]. This category includes flat, open country, grasslands and shorelines in hurricane regions. [...] MF, MG, PI, RI, RG, RG(BF), RG(BK), SG, TI or TG ITEK 40 and 50 mm frames IT-xxx-YY Where “YY” can be blank, HE, or SE, or SE72 JA Solar 30, 35, 40 and 45 mm frames JAyyzz-bbww-xxx/aa Where “yy” can be M, P, M6 or P6; “zz” can be blank, (K), (L), (R), (V), (BK), (FA), (TG), (FA)(R), (L)(BK), (L) (TG), (R)(BK), (R)(TG), (V)(BK), (BK)(TG), or (L)(BK)(TG); “bb” can be 48, 60, or 72; “ww” can be D09, S01, S02, S03, S06, S09, S10, or S12; and “aa” can be BP, MR, SI, SC, PR, 3BB, 4BB, 4BB/RE, 5BB",
        "score": 0.35307175,
        "bucket": "datasheets"
      },
      {
        "url": "https://macmetalarchitectural.com/wp-content/uploads/2024/06/DataSheet_MS3_4_ENG.pdf",
        "title": "[PDF] MS 3 & MS 4 - MAC Metal Architectural",
        "snippet": "Resistance accreditation Non-tested • No perforations and no visible screws • No joints along the length of the panels • Non-combustible product • Increased wind resistance • MS 3 17.75’ flat surface • MS 4 17.75’ surface incorporating two grooves • 26-gauge PRINCIPAL CHARACTERISTICS ENVIRONMENT Placing the environment at the heart of our priorities, all of our products are made from 86% recycled material and are 100% recyclable at the end of their life, in addition to contributing to the [...] give relief and accentuate the architectural details of your cre-ations. Installation direction Installation orientation vertical Characteristics of the profiles MS 3 Square bead | Flat surface MS 4 Square bead | Incorporates two grooves MS 3 MS 4 WARRANTY Since we use a superior grade of steel and an unparalleled painting process that ensures longevity, MAC offers its customers a 40-year Quiet Guarantee. INSTALLATION WARRANTY In the event that a problem occurs during the installation of the [...] profiles, it is impor-tant to report the situation immediately to your supplier before proceeding with the rest of the installation. For MS 3 and MS 4 profiles, the supplier must be notified prior to the installation of 500 sq. ft. Beyond 500 sq. ft. the installer is responsible for the installation.",
        "score": 0.34409124,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.sfusa.com/vs-uploads/resources/1551900179_SFUSA%20GroundMount%20Racking%20-%20SF100%20UL%20Install%20Manual%20Ver%204.1.pdf",
        "title": "[PDF] SFUSA® Ground Mount Structure Installation Manual",
        "snippet": "conforms to UL 2703 Standard for Safety First Edition: Mounting Systems, Mounting Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels for grounding and bonding. ® SFUSA® Ground Mount Structure Installation Manual 1142 River Road, New Castle, DE 19720 | phone 855-738-7200 | fax 866-644-5665 | www.solarfoundationsusa.com SF100 UL Install Manual Ver 4.1 © Solar Foundations USA®, All Rights Reserved Page 3 Component Identification 1 - SF Rail: Standard rail lengths are [...] 5M18, 6M, 6M18, 6M24, 6M27, 6M30, 6P, 6P18, 6P27, 6P30)-xxx (Blank, Black, Transparent, PERC) with 35 or 40 mm Frames. AXITEC Solar: AC-xxx(M, P)/156-(60,72)S with 35 or 40 mm Frames. Boviet Solar: BVM(6610P, 6612P, 6610M, 6612M)-xxx with 40mm Frames. Canadian Solar: CS(3K, 3U, 6K, 6P, 6U, 6X)-xxx(M, MS, P) with 40 mm Frames. ET Solar: ET-(M6, P6)(72)xxx(BB, WB, WW) with 40 mm Frames. Hanwha Q CELLS: Q.(PRO, PLUS, PEAK)-(G3, BLK-G3, BFR-G3, G4, BFR-G4, G4.1, G4.1/SC, BFR-G4.1, BLK-G4.1, L-G4.2, [...] SWA (Blank, Protect) xxx (MONO, XL, XL MONO, DUO, XL DUO, DUO CLEAR) (Blank) with 33 mm Frames. Suniva: (OPT, MVX, ART)xxx-(60, 72)-(4, 5)-(100, 1B0, 800, 8B0) with 35, 38 or 40 mm Frames. SunPower: SPR-(E20, E19, P17, X20, X21, X22)-xxx-(Blank, COM, BLK, WHT, C)-(Blank, B, C, D)-(Blank, AC) with 46 mm Frames. Talesun Solar: (Blank, HIPRO) TP(660, 672)(M, P, P(H)) xxx with 35 or 40 mm Frames. Trina Solar: TSM-xxx-(DD05A, DD14A, PA05, PA14, PC05, PD05, PD14, PE14A, DD14A(II), DE14A(II))(Blank,",
        "score": 0.2697516,
        "bucket": "datasheets"
      },
      {
        "url": "https://tnb.ca/en/pdf-catalogues/metal-framing-fastening-and-identification/metal-framing/A-Metal_Framing-E.pdf",
        "title": "[PDF] METAL FRAMING",
        "snippet": "For use with 3⁄8 in. rod see U-569.\nCat. no.\nA size (in.) Wt./C lb Design load lb/ea A570HDG 1⁄2 220 500 3⁄8 A 3⁄8 1 27⁄8 7⁄8 Optional Use of U563HDG Beam Clamp Optional use of U562HDG beam clamp 25⁄8 11⁄4 3⁄4 21⁄4 17⁄8 All dimensions shown are in in.\n33 BE AM CL AMPS Cat. no.\nA (in.) B (in.) C (in.) Wt./C lb Design load, lb U560-1/4 1⁄4 1⁄8 3⁄8 x 11⁄2 67 1,050 U560-3/8 3⁄8 1⁄8 3⁄8 x 11⁄2 67 1,050 U560-1/2 1⁄2 1⁄4 1⁄2 x 11⁄2 130 2,650 U560-5/8 5⁄8 1⁄4 1⁄2 x 11⁄2 130 2,650 Cat. no. [...] Bolt size (in.) Wt./ C lb AB241-1/4 1⁄4 18 AB241-5/16 5⁄16 16 18 AB241-3/8 3⁄8 18 AB241-1/2 1⁄2 17 AB241-5/8 5⁄8 15 AB241-3/4 3⁄4 14 Finishes •\tHDGC •\t\u0007 EG •\tGoldGalv® •\t\u0007 SS6C — 01 — 06 — 11 — 02 — 07 — 12 — 03 — 08 — 13 — 04 — 09 — 14 — 05 — 10 — 15 — Fittings and brackets Flat fittings 91⁄8 35⁄8 7 31⁄2 31⁄2 31⁄2 53⁄8 15⁄8 31⁄2 53⁄8 Standard dimensions Hole spacing 13 13⁄16 16 in. from end Hole spacing 17⁄8 in. centers Hole size 9⁄16 16 in. diam. [...] H 122 1/4 1⁄4 150 50 H 122 3/8 3⁄8 590 50 H 122 1/2 1⁄2 1,080 50 H 122 1/4 EG 1⁄4 150 50 H 122 3/8 EG 3⁄8 590 50 H 122 1/2 EG 1⁄2 1,080 50 H 122 3/8 SS6 3⁄8 590 50 H 122 1/2 SS6 1⁄2 1,080 50 Rod size A (in.) Pipe size (in.) B (in.) E (in.) Wt./C lb Design load, lb 1⁄4 3⁄8 1⁄4 111 11⁄32 32 5 230 3⁄8 1⁄2–2 1⁄4 111 11⁄32 32 7 610 1⁄2 21⁄2–31⁄2 1⁄4 117 17⁄32 32 13 1,130 5⁄8 4–5 3⁄8 113 13⁄16 16 19 1,810 3⁄4 6 1⁄2 25⁄32 32 31 2,400 7⁄8 8 1⁄2 211 11⁄32 32 44 2,800 Cat. no.",
        "score": 0.15591232,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOorln1Imu9X9eRxu2_pI50N4v2T4cQUuzEjCA2Jazj61LiuVMPnX",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] 23 Alpha+ Installation Manual If flashing is required for a particular application or jurisdiction, flashings and flashing materials may be procured from a number of sources. Contact Mounting Systems, Inc. for more information and recommendations. The following instructions provide basic installation procedures for each Mounting Systems, Inc. roof hook type. [...] Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles).",
        "score": 0.65887916,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOopbNjEvaPJG9EG7h01QazZ2K1nqxX4Ym-U1nooYzrDJKHCExutp",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] 23 Alpha+ Installation Manual If flashing is required for a particular application or jurisdiction, flashings and flashing materials may be procured from a number of sources. Contact Mounting Systems, Inc. for more information and recommendations. The following instructions provide basic installation procedures for each Mounting Systems, Inc. roof hook type. [...] Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles).",
        "score": 0.65887916,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOoqDVNECuQN27K0aDKd823BNpDk5cs5agyfzyXYc0xhNW55AH3Ce",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] • Loosely install the Alpha+ L-feet on the mounting/ flashings with the preassembled T-head bolts facing the ridge of the roof. The L-feet may be aligned with the base of the \"L\" facing north or south (it may be necessary to disassemble and reassemble the T-bolts and nuts as appropriate).\n2 The MS Flashing Installation Manual can be found on Mounting Systems' website: \nus/downloads-technical-docs-warranty/ Image 5.3.1 MS flashing L-Foot Kit i NOTE! [...] Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles).",
        "score": 0.6052631,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOorbJcOjfjmeLzm_QYDuDNEGGLjNW4461fv_2yuyDI8QKY6pcxXJ",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] • Loosely install the Alpha+ L-feet on the mounting/ flashings with the preassembled T-head bolts facing the ridge of the roof. The L-feet may be aligned with the base of the \"L\" facing north or south (it may be necessary to disassemble and reassemble the T-bolts and nuts as appropriate).\n2 The MS Flashing Installation Manual can be found on Mounting Systems' website: \nus/downloads-technical-docs-warranty/ Image 5.3.1 MS flashing L-Foot Kit i NOTE! [...] Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles).",
        "score": 0.6052631,
        "bucket": "installation"
      },
      {
        "url": "https://www.solarelectricsupply.com/media/sparsh/product_attachment/Tamarack-Solar-Ground-Mount-System-Installation-Manual_compressed.pdf?srsltid=AfmBOooWyiOjPpEx0WVPWHborLIKXrYrdCH-pHDbNZzJwcoU2s6i0YqD",
        "title": "[PDF] Tamarack-Solar-Ground-Mount-System-Installation ...",
        "snippet": "ETL Listed to UL 2307 for bonding and grounding when installed in accordance with this manual. Rails, clamps, splices, and mounting devices are UL2703 Listed for mounting flat-plate Photovoltaic Modules and Panels • Conforms to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\n• Certified to CSA STD LTR AE-001-2012 Photovoltaic Module Racking Systems. [...] L-G6.2, L-G6.3, G7, BLK-G6+, BLK-G6+/AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, XL-G9, XL-G9.2, XL-G9.3, XL-G9.3/BFG, XL-G10.2, XL-G10.3, XL-G10.c, XL-G10.d, XL-G10.d/BFG or XL-G10.3/BFG Hansol Hansol modules with 35 and 40 [...] Exposure Catergory B - Urban and suburban and wooded areas filled with obstructions the size of single family dwellings must surround the structure at least 2,630 ft or 10 times the structure height in all directions whichever is greater.\nExposure Catergory C - Open terrain with scattered obstructions having heights generally less than 30 ft [9.1 m]. This category includes flat, open country, grasslands and shorelines in hurricane regions.",
        "score": 0.44985238,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual",
        "snippet": "UL 2703 LISTED Conforms to STD UL 2703 Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels • Scope of Evaluation includes bonding, grounding, mechanical loading, and fire classification • Max Overcurrent Protective Device (OCPD) Rating: 40A • Max Module Size: 30.5 ft² • Module Orientation: Portrait or Landscape • System Design Load Rating: 10 PSF downward, 5 PSF upward, 5 PSF [...] installing on a low slope roof please refer to Ground Mount for Flat Roof Applications Addendum (Version 4.50). ➢Unless otherwise noted, all components have been evaluated for multiple use. They can be uninstalled and reinstalled in the same or new location. [...] MS, MHBB, or PBB; \"ZZ\" can be 54, 60, 72 or 78; \"AAA\" is the module power rating; and \"bb\" can be 03, 04 or 05 Module Compatibility GROUND MOUNT INSTALLATION MANUAL - 22 © 2025 IRONRIDGE, INC. VERSION 4.5 VSUN VSUN modules with 30, 35 and 40 mm frames VSUNxxxA-YYz-aa Where \"A\" can be blank or N; \"YY\" can be 60, 72, 108, 120, 132, 144; \"z\" can be M, P, MH, PH, or BMH; and \"aa\" can be blank, BB, BW, or DG Waaree Waaree modules with 35 and 40 mm frames AAyy-xxx Where \"AA\" canbe WS or Bi; and \"yy\"",
        "score": 0.36765668,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Unirac%20SM%20SolarMount%20Installation%20Guide.pdf",
        "title": "[PDF] Unirac SM SolarMount Installation Guide.pdf",
        "snippet": "Manufacturer Series/Model Aleo P18, P19 AU Optronics (BenQ Solar) PM Series Auxin AXN6M610T, AXN6P610T, AXN6M612T & AXN6P612T Axitec AXIpower, AXIpremium, AXIblackpremium Boviet BVM6610 & BVM6612 Series Canadian Solar CS5A-M, CS6P-M, CS6P-P, CS6X-P, CSX-P, ELPS CS6P-MM, ELPS CS6A-MM, CS6U-P, CS6U-M, CS6K-MS, CS6K-M, CS6K-P, CS3U-P, CS3U-MS, CS3K-P, CS3K-MS, CS1K-MS, CS3W-P, CS3L-P, CS3K-MB, CS3K-PB, CS3U-MB, CS3U-PB, CS3U-MS, CS3U-P, CS3K-MS, CS3K-P, CS6U-P, CS6K-MS, CS6K-P Centrosolar America [...]   Ilsco SGB-4 SOLID COPPER WIRE Ilsco SGB-4 REQUIRED ONLY FOR TEMPORARY BONDING DURNING ARRAY MAINTENANCE SM SOLAR MOUNT System Certification PAGE APPENDIX A Q The SOLARMOUNT system has been certified and listed to the UL 2703 standard (Rack Mounting Systems and Clamping Devices for Flat-Plate Photovoltaic Modules and Panels). This standard included electrical grounding, electrical bonding, mechanical load and fire resistance testing. [...] DRILL PILOT HOLES: Center the roof attachment over the rafter and drill a pilot hole(s) for the lag bolt(s).\nNOTE: Determine lag bolt size and embedment depth.\nQuick Tip: Pre-drill the pilot hole through the flat flashing lag bolt location for easier installation.\nFLASHING INSTALLATION: Insert the flashing so the top part is under the next row of shingles and the hole lines up with the pilot hole.",
        "score": 0.35300484,
        "bucket": "installation"
      },
      {
        "url": "https://unirac.com/wp-content/uploads/bsk-pdf-manager/2024/11/RM10-Installation-Guide_20240823.pdf",
        "title": "[PDF] UNIRAC Code-Compliant Installation Manual",
        "snippet": "BVM6610(P/M) & BVM6612(P/M) Canadian Solar BiHiKu7 CS1H-MS, CS1K-MS, CS1U-MS, CS1Y-MS CS3K-MB-AG, CS3K-MS (Black), CS3K-P (HE), CS3K-PB-AG, CS3L-P CS3N MS, CS3U-MB-AG, CS3U-MS, CS3U-P (HE), CS3U-PB-AG, CS3W-MB-AG CS3W-PB-AG, CS3W-P/MS, CS3W-P-PB-AG, CS3Y-MB-AG CS5A-M, CS6K-M, CS6K-MS (AllBlack),CS6K-P (HE), CS6K, CS6P-M, CS6P-P, CS6R-MS-HL, CS6U-M, CS6U-P (HE), CS6W-MB-AG, CS6X-P CS7L-MB-AG, CS7L-MB-AG, CS7L-TB-AG Canadian Solar (Cont.) CS7N-xxxMB-AG (640-665 W) CS7N-xxxTB-AG, ELPS CS6A-MM, [...] in the illustration below. Minimum and maximum roof slopes are restricted through the system design and layout rules. The fire classification rating is only valid on roof pitches less than 2:12 (slopes < 2 inches per foot, or 9.5 degrees. Rack mounting system is to be installed over a fire resistant roof covering rated for the application. [...] PD05, PD14, PE14, TSM-DE15V(II), TSM-DE19 TSM-DEG15VC.20(II) TSM-DEG19C.20, TSM-DEG21C.20 TSM-NEG19RC.20 TSMxxx-DE19 URE D7 (M/K) H7A, D7 (M/K) H8A Vikram Eldora, Solivo, Somera PREXOS Paradea VSMDH.66.AAA.05 Paradea VSMDH.72.AAA.05 VSMDHT.60.AAA.05 VSMDHT.72.AAA.05 VSUN VSUNxxx-144BMH VSUNxxx-144BMH-DG VSUNxxx-108BMH VSUNxxx-108MH VSUNxxx-108M VSUNxxxN-108BMH VSUNxxxN-108MH VSUNxxx-120BMH Waaree Bi-55 Yingli YGE60/72, YLM60/72, YLM-VG Yotta YSM-Bxxx-06-72-1 YSM-Bxxx-10-72-1 Manufacturer Module",
        "score": 0.34514993,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/pitched-roof-mounting/resources/brochures/IronRidge_Flush_Mount_Installation_Manual.pdf",
        "title": "[PDF] xr flush mount installation manual - IronRidge",
        "snippet": "MOUNT INSTALLATION MANUAL - 3 ATTACHMENTS BONDING HARDWARE TORQUE VALUES Please refer to each attachment's individual section for full details on all torque values and instructions. ☐ 3/8\" Bonding Hardware Nuts (7/16\" Socket): 300 in-lbs ☐ All Tile Hook Carriage Bolts (7/16\" Socket): 144 in-lbs ☐ Flat Tile Hook Carriage Bolts (7/16\" Socket): 144 in-lbs ☐ Flat Roof Attachment Nuts (9/16” Socket): 250 in-lbs ☐ Lynx Set Screw (3/16\" Hex Drive): 150 in-lbs ☐ Lynx Flange Nut (1/2\" Socket): 150 [...] P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or TB-AG CertainTeed CertainTeed modules with 30, 35 and 40 mm frames CTBBxxxYZZ-AA Where \"BB\" can be blank or M10; \"Y\" can be M, P, or [...] additional details refer to the full QM Installation Manual.",
        "score": 0.3084719,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/pitched-roof-mounting/resources/brochures/IronRidge_Aire_System_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Flush Mount Manual",
        "snippet": "P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or TB-AG CertainTeed CertainTeed modules with 30, 35 and 40 mm frames CTBBxxxYZZ-AA Where \"BB\" can be blank or M10; \"Y\" can be M, P, or [...] instructions in this manual. [...] 72 or 78, \"aaa\" can be 18, 156 or 166, \"Z\" can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C, or X Hyperion Solar (Runergy) Hyperion modules with 30 and 35 mm frames HY-DHzzzA8-xxxB Where \"zzz\" can be 108 or 144; \"A\" can be N or P; and \"B\" can be blank or B Hyundai Hyundai modules with 30, 32, 33, 35 and 40 mm frames HiY-SxxxZZ Where \"Y\" can be A, D, N or S; \"S\" can be M, S or T; and \"ZZ\" can be GI, HG, HI, KI, MI, MF, MG, NF(BK), NJ, OJ, PI, RI, RG, RG(BF), RG(BK), SG, TI, TG,",
        "score": 0.24270828,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Ironridge%20Flush%20Mount%20Installation%20Guide.pdf",
        "title": "[PDF] IronRidge Flush Mount Manual - LA County Public Works",
        "snippet": "35 and 40 mm frames HTyy-156Z-xxx Where “yy” can be 60 or 72, “Z” can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C Hyundai Hyundai modules with 33, 35, 40 and 50 mm frames HiY-SxxxZZ Where “Y” can be A, D, M or S; and “ZZ” can be GI, HG, HI, KI, MI, MF, MG, PI, RI, RG, RG(BF), RG(BK), SG, TI, or TG © 2020 IRONRIDGE, INC. VERSION 3.0 FLUSH MOUNT INSTALLATION MANUAL - 23 MODULE COMPATIBILITY Itek Itek Modules with 40 and 50 mm frames IT-xxx-YY Where “YY” can be blank, HE, or SE, or [...] roofs. Ensure membrane flashing is compatible with existing roofing material. ➢If membrane flashing is not used, only washer on top of L-Foot is required. ➢Standalone Flat Roof Attachment Manual available on website. 250 in-lbs Flat Roof Attachment Hardware L-Foot Flat Roof Attachment Membrane Flashing FLAT ROOF ATTACHMENT Locate the desired mount placement over a rafter. Using the base as a template, mark the two penetration points. Drill two 7/32\" pilot holes, back fill with roofing [...] and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3 or 6; \"Y\" can be H, K, L, P, U, V, W, or X; and \"Z\" can be M, P, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, or MS-SD CertainTeed CertainTeed modules with 35 and 40 frames CTxxxYZZ-AA Where \"Y\" can be M, P, or HC; \"ZZ\" can be 00,01, 10, or 11; and \"AA\" can be 01, 02, 03, or 04 CSUN Csun modules with 35 and 40 mm frames YYxxx-zzAbb Where \"YY\" is CSUN or SST; \"zz\" is",
        "score": 0.2174542,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/EcoFasten%20Rock-It%20Installation%20Guide.pdf",
        "title": "[PDF] INSTALLATION GUIDE",
        "snippet": "60-cell modules with 40 mm frames JCxxxY-ZZ “Y” can be F, M or S; and “ZZ” can be Ab, Ab-b, Abh, Abh-b, Abv, Abv-b, Bb, Bb-b, Bbh, Bbh-b, Bbv, Bbv-b, Db, or Db-b S-Energy S-Energy modules with 35 and 40mm frames SABB-CCYYY-xxxZ Where “A” can be C, L or N; “BB” can be blank, 20, 40 or 45; “CC” can be blank, 60 or 72; “YYY” can be blank, MAE, MAI, MBE, MBI, MCE or MCI; and “Z” can be V, M-10, P-10 or P-15 Silfab Silfab Modules with 38 mm frames SYY-Z-xxxAb Where “YY” can be IL, SA, LA, SG or LG; [...] ATTACH MOUNTING PROFILES Screw the mounting profiles onto the roof using the self piercing screws. Use a cordless screwdriver or impact driver with a 1/4” hex socket.  A WATERTIGHT SEAL HAS BEEN FORMED WHEN THE RUBBER ON THE WASHER CREATES A VISIBLE RING AROUND THE SCREW HEAD. [...] VERSION: v2.4 REVISION DATE: 12/8/20 INSTALLATION GUIDE COMPONENTS PAGE 04 SYSTEM COMPONENTS REQUIRED SYSTEM COMPONENTS ACCESSORIES V3 SKIRT & SKIRT CAP PORTRAIT & LANDSCAPE IN 32MM & 38MM OR 35MM & 40MM TF-FLAT SIERRA TAN TF-W SIERRA TAN TF-S SIERRA TAN ROCK-IT V3 SLIDE TILE BASE-FLAT LITE (Flat, W and S to match flashing profile) GF-1 FLASHING SLIDECOMP ROCKIT MOUNT ROCKIT COUPLING STEELDECK SELF PIERCING SCREW COMPOSITION SHINGLE ROOFS METAL ROOFS TILE ROOFS ROCKIT CLIP 2.0 J-PLATE COMP",
        "score": 0.21275535,
        "bucket": "installation"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_Produktkatalog-ProLine_EN_compressed.pdf",
        "title": "[PDF] Product Catalogue ProLine - Mounting Systems",
        "snippet": "Total height: 171 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 40 - 51 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base plate: 95 x 100 mm (W x L) Base holes: 8 x ø 9 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21 [...] Total height: 170 mm Base dimensions: 50 x 180 x 4 mm (W x L x T) Base holes: 12 x ø 7 mm Height in roof batten area: 45 mm Max. height adjustment: 38 mm to rail area Upper slot dimensions: 38 mm and ø 9 mm Weight / Comfort: 0.57 kg / 0.61 kg Total height: 156 mm Base dimensions: 50 x 180 x 4 mm (W x L x T) Base holes: 12 x ø 7 mm Height in roof batten area: 44 mm Max. height adjustment: 37 mm to rail area Upper slot dimensions: 38 mm and ø 9 mm Weight: 0.56 kg Total height: 228 mm Base [...] 600 mm Black anodised 610-0714 1 1008 610-0714 2400 mm Natural 610-0070 1 504 610-0070 2500 mm Natural 610-0143 1 130 610-0143 2500 mm Black anodised 610-0144 1 130 610-0144 3150 mm Natural 800-0019 1 130 800-0019 3300 mm Natural 800-1412 1 130 800-1412 3600 mm Natural 800-1459 1 130 800-1459 3600 mm Black anodised 800-1460 1 130 800-1460 4150 mm Natural 800-0017 1 130 800-0017 4400 mm Natural 800-1411 1 130 800-1411 5200 mm Natural 800-1319 1 130 800-1319 6000 mm Natural 800-1057 1 130",
        "score": 0.6601948,
        "bucket": "other"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOorp4pcES1gMX1aZsppoUB550SNNuus8Ge5PvF4I0If5xG0upZdV",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "Flat Tiles Mounting Systems provides two types of roof hooks for flat tiles: a standard roof hook and an adjustable roof hook. The standard roof hook is available in a Direct Attach version and a High Lift version. Both versions are primarily intended for use with 1-inch thick concrete roof tiles.\nAn adjustable, \"universal\" roof hook is available for use with both 1-inch and 1¼-inch concrete tiles. (The universal roof hook is also usable for curved tiles). [...] • Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] • Loosely install the Alpha+ L-feet on the mounting/ flashings with the preassembled T-head bolts facing the ridge of the roof. The L-feet may be aligned with the base of the \"L\" facing north or south (it may be necessary to disassemble and reassemble the T-bolts and nuts as appropriate).\n2 The MS Flashing Installation Manual can be found on Mounting Systems' website: \nus/downloads-technical-docs-warranty/ Image 5.3.1 MS flashing L-Foot Kit i NOTE!",
        "score": 0.54521364,
        "bucket": "other"
      },
      {
        "url": "https://us.allegion.com/content/dam/allegion-us-2/web-files/allegion/technical-documents/Allegion_Commercial_Warranty_015496.pdf",
        "title": "[PDF] LIMITED PRODUCT WARRANTY - Allegion US",
        "snippet": "from date of shipment from Company’s factory Effective on or after 02/04/25 015496, Rev 02/25 PRODUCT WARRANTY PERIOD SPECIFIC EXCLUSIONS LCN - Surface Mount • 4000 Series - 30 years • 4050 Series - 25 years • 1460 Series - 30 years • 1450 Series - 25 years • 1260 Series - 20 years • 1250 Series - 15 years Warranty begins from the date of shipment from Company’s factory LCN - Overhead Concealed (2010/5010 Series, 2030/5030/6030 Series, 3030/3130 Series) 15 years from the date of shipment from [...] Series, L Series, INPACT Series, CE Series, B Series) 1 year from date of shipment from Company’s factory Product will be repaired or replaced as authorized by Company Excludes: • Return of Product unless authorized by Company Steelcraft - Frames (C/CK Series, DE Series, F Series, MU Series, FE Series, DW/K Series, FN Series, FT Series, FS/KS/MS Series, FP Series) 1 year from date of shipment from Company’s factory Product will be repaired or replaced as authorized by Company Excludes: • Return [...] include the Province of Quebec), this warranty is not transferable. What is not Covered: The following costs, expense and damages are not covered by the provisions of this warranty: (i) back charges or labor costs including, but not limited to, such costs as the removal and reinstallation of the Product or for normal maintenance; (ii) shipping and freight expenses required to return the Product to Schlage; (iii) failures, defects, or damage (including, but not limited to, any security related",
        "score": 0.42176673,
        "bucket": "other"
      },
      {
        "url": "https://catalogue.k2-systems.com/media/ab/1d/f3/Product-Brochure-en.pdf",
        "title": "[PDF] Mounting systems - K2 Catalogue",
        "snippet": "Digital tools Product Brochure EN V2 | 0325 · Subject to change Product illustrations are exemplary and may differ from the original.\nk2-systems.com K2 Systems GmbH Haldenstraße 1 · 71272 Renningen · Germany +49 (0) 7159 - 42059 - 0 · info@k2-systems.com [...] mounted solutions. [...] installation.",
        "score": 0.40098447,
        "bucket": "other"
      },
      {
        "url": "https://www.swagelok.com/downloads/webcatalogs/en/ms-02-486.pdf",
        "title": "[PDF] Gas Distribution Systems (MS-02-486 - Swagelok",
        "snippet": "M6 =\u0007 6 mm Swagelok tube fitting M1 =\u0007 10 mm Swagelok tube fitting M2 = 12 mm Swagelok tube fitting N4 = 1/4 in. Male NPT F4 =\u0007 1/4 in. Female NPT 9 Inlet Filter 0 =\u0007 None 1 =\u0007 Filter - 60 micron (inert)/10 micron (Oxygen) 10 Mounting 0 =\u0007 Flat plate W =\u0007 Wall-mount wings T =\u0007 Top (L plate) B = Bottom (L plate) 11 Cv (Flow Coefficient) 1 =\u0007 0.02 2 =\u0007 0.06 5 =\u0007 0.2 12 Note: \u0007 Multiple options can be added to the end of an ordering number. [...] removed or replaced for maintenance due to flexible mounting solutions and the use of Swagelok tube fittings. The designs of Swagelok gas distribution systems make it easy to ensure you’re getting the most usage of the gas in your supply bottles. They are fully assembled using high-quality, leak-tight Swagelok components and tested prior to delivery. This ensures reliable, long-lasting performance to help you reduce costs, time, and resources needed for troubleshooting and maintenance, and that [...] is relatively modest along the flat part of the curve, it is quite steep at the far ends of the curve.",
        "score": 0.2323628,
        "bucket": "other"
      },
      {
        "url": "https://connect.soligent.net/site/Item%20Documents/6684_213-0085%20Installation%20Manual.pdf",
        "title": "[PDF] INSTALLATION GUIDE - Soligent Connect",
        "snippet": "SYSTEM INSTALLATION 9 9 10 10 11 11 12 12 VERSION: v3.1 REVISION DATE: 12/2/22 INSTALLATION GUIDE INSTALLATION PAGE 20 TILE MOUNTING SYSTEM INSTALLATION 1. Locate rafter in the typical manner. Remove tile.\n2. Pre-drill lag bolt holes through base and butyl tape.\n3. Remove release paper from bottom of butyl tape. • Place base in proper location and press down firmly. • Backfill holes with sealant. Install lag bolts in pre-drilled locations. [...] VERSION: v3.1 REVISION DATE: 12/2/22 INSTALLATION GUIDE COMPONENTS PAGE 04 STEELDECK SLIDE SELF PIERCING SCREW SIMPLEBLOCK-U SYSTEM COMPONENTS REQUIRED SYSTEM COMPONENTS ACCESSORIES SKIRT & SKIRT CAP PORTRAIT & LANDSCAPE IN 32MM & 38MM OR 35MM & 40MM TF-FLAT SIERRA TAN TF-W SIERRA TAN TF-S SIERRA TAN TILE SLIDE TILE BASE-FLAT LITE (Flat, W and S to match flashing profile) GF-1 FLASHING COMP SLIDE ROCKIT MOUNT ROCKIT COUPLING SMART SLIDE & SCREW COMPOSITION SHINGLE ROOFS METAL ROOFS TILE ROOFS",
        "score": 0.22833751,
        "bucket": "other"
      },
      {
        "url": "https://www.magnum-dimensions.com/sites/default/files/MagDocs/64-0007%20Rev%20C%20%28MS%20Series%29.pdf",
        "title": "[PDF] MS Series Pure Sine Wave Inverter/Charger Owner's Manual",
        "snippet": "Introduction Figure 1-1, Power Switch, Status LED, and Accessory Connection Ports Figure 1-2, Electrical Connection Points 8 12 11 10 7 9 1 2 3 4 5 6 POWER ON/OFF SWITCH STATUS (CHARGING/INVERTING) LED STACK/ACCESSORIES PORT (RED LABEL - RJ11 CONNECTION) NETWORK PORT (GREEN LABEL - RJ11 CONNECTION) REMOTE PORT (BLUE LABEL - RJ11 CONNECTION) BATTERY TEMPERATURE SENSOR PORT (YELLOW LABEL - RJ11 CONNECTION) POSITIVE (+) DC TERMINAL (UNDER COVER) NEGATIVE (-) DC TERMINAL (UNDER COVER) MOUNTING [...] Page iv CONSIGNES DE SÉCURITÉ IMPORTANTES CONSERVER CES INSTRUCTIONS CE MANUEL CONTIENT DE IMPORTANTES POUR LA SÉRIE MS ONDULEUR/CHARGEUR QUI DOIVENT ETRE SUIVIES PENDANT L’INSTALLATION ET FONCTIONNEMENT DE CE PRODUIT . Avant d’utiliser la série MS, lire toutes les instructions etles mises en garde. Aussi, n’oubliez pas depasser en revue les différents manuels fournispour chaque composant du système. Lesinstructions d’installation sont pour une utilisationpar du personnel qualiﬁ é. Ne pas [...] Page 10 Installation 2.2 Mounting the Inverter The inverter base can reach a temperature up to 90°C (194°F) and should be mounted on a noncombustible surface. This surface and the mounting hardware must also be capable of supporting at least twice the weight of the inverter. To meet regulatory requirements, the MS Series must be mounted in one of the following positions as shown in Figure 2-2: • above or under a horizontal surface (shelf or table), • on a vertical surface (wall) with the DC",
        "score": 0.18129252,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "mounting-systems",
    "product": "Mounting Systems MS-GROUND",
    "candidates": [
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/2022/03/MSY-TP_Ground-Mount_EN_2022.pdf",
        "title": "[PDF] Technical Planning Aid Ground mount",
        "snippet": "1 Please add module datasheet including information about fixing restriction. For further information: www.mounting-systems.com. Subject to technical changes.",
        "score": 0.64639384,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solar-electric.com/lib/wind-sun/Tamarack-Solar-Ground-Mount-System-Installation-Manual.pdf?srsltid=AfmBOorI4F2UIZ_G-xUlDrWTceL_PNewypk4MzB-OEsJmnK8hZf0rkgZ",
        "title": "[PDF] Installation Manual Tamarack Ground Mount System",
        "snippet": "blank, Tron, Q or B; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, [...] L-G6, L-G6.1, L-G6.2, L-G6.3, G7, BLK-G6+, BLK-G6+/AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, XL-G9, XL-G9.2, XL-G9.3, XL-G9.3/BFG, M-G2+ or BLK M-G2+ Hansol Hansol modules with 35 and 40 frames HSxxxYY-zz Where \"YY\" can be [...] 35, and 40 mm frames - CSbY-xxxZ Where \"b\" can be 1, 3, 6 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X or Y; and \"Z\" can be M, P, MS, PX, M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-SD, MS-HL, or TB-AG CentrsoSolar C and E series.",
        "score": 0.5654673,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.enerack.com/uploadfile/downloads/2025%20Enerack%20Solar%20Mounting%20System%20Catalog.pdf",
        "title": "[PDF] 2025 Enerack Solar Mounting System Catalog.pdf",
        "snippet": "Standard Ground Mounting System Aluminum ground mount, optimized for lightweight,quick and efficient installation with flexible on engineering upon site conditions. Optional on foundation by ground screw or concrete. Maximize pre-assembled before shipment 51 52 Technical features: Product name Application Inclination Material Finish Module orientation Standard ground mounting system Flat concrete roof, open terrain Customized AL 6005-T5, SUS 304, Q235 AL 6005-T5 Anodized, Q235 [...] Main structure & components 2 H Support U Pile 55 56 Technical features: Product name Application Inclination Material Finish Module orientation U Pile ground mounting system Open terrain Customized AL 6005-T5, SUS 304, Q235 AL 6005-T5 Anodized, Q235 Hot-dip\u0000galvanizing Landscape or Portrait ConventionalUpilecompressionandtensilestrengthreferencevalues(KN) N=3 N=5 N=7 N=10 Resistance Resistance Compressi on Resistance Resistance Resistance Compressi on Resistance Compressi on Resistance [...] the anti-corrosion requirements of the service life Ground Screw Length Conventional pile compression and tensile strength reference values(KN) N=3 N=5 N=7 N=10 Resistance compression Resistance compression Resistance compression Resistance compression Resistance Resistance Resistance Resistance 1600 1800 2000 8.7 9.9 11 9.1 10.2 11.4 14.6 16.5 18.4 15.2 17.1 19 20.4 23.1 25.8 21.4 24 26.7 29.2 33 36.8 30.6 34.4 38.2 Remarks: The N value of the soil in this table are based on the Swedish",
        "score": 0.559411,
        "bucket": "datasheets"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Ground_Mount_Installation_Manual.pdf?srsltid=AfmBOorX2dpc59fKcQi1b4PCtVU3AzrDOx8VipJY3V9E7H4MI65TOv_b",
        "title": "[PDF] Ground Mount Installation Manual - RESsupply.com",
        "snippet": "L-G6.3/BFG, G7, BLK-G6+, BLK-G6+/ AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, M-G2+, BLK M-G2+, BLK M-G2.H+, BLK M-G2+/AC, BLK M-G2.H1+/AC, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, BLK-G10, BLK-G10+, BLK G10+/AC, BLK-G10+/HL, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, BLK ML-G10.B+, BLK ML-G10.C+, BLK ML-G10 [...] PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO, PEAK DUO or TRON; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/ SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, L-G6, L-G6.1, L-G6.2, L-G6.3, [...] DE14, DE15, DE15V, DEG15, DEG15VC, DE18M, DEG18MC, DE09, DE19, DEG19C.20, DE06X, PA05, PC05, PD05, PD06, PA14, PC14, PD14, PE14, PE15, NE19RC, NEG19RC, NE09RC or NE09RH.05 ; and \"ZZ\" can be blank, .05, .05(II), .08, .08(II), .10, .18, .08D, .18D, 0.82, .002, .00S, 05S, 08S, .20, .20(II), A, A.05, A.08, A.10, A.18, (II), A(II), A.05(II), A.08(II), A.082(II), A.10(II), A.18(II), C.05, C.07, C.05(II), C.07(II), H, H(II), H.05(II), H.08(II), HC.20(II), HC.20(II), M, M(II), M.05(II), MC.20(II)",
        "score": 0.5440511,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.solarelectricsupply.com/media/sparsh/product_attachment/Tamarack-Solar-Ground-Mount-System-Installation-Manual_compressed.pdf?srsltid=AfmBOoorv9Nns2TgBBlLaiGqJeQQdLdNriL7wyoQd3YD2-c_3DEWkrV5",
        "title": "[PDF] Tamarack-Solar-Ground-Mount-System-Installation ...",
        "snippet": "L-G6.2, L-G6.3, G7, BLK-G6+, BLK-G6+/AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, XL-G9, XL-G9.2, XL-G9.3, XL-G9.3/BFG, XL-G10.2, XL-G10.3, XL-G10.c, XL-G10.d, XL-G10.d/BFG or XL-G10.3/BFG Hansol Hansol modules with 35 and 40 [...] or B.; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, L-G6, L-G6.1, [...] 35, and 40 mm frames - CSbY-xxxZ Where \"b\" can be 1, 3 or 6; \"Y\" can be H, K, L, N, P, U, V, W, X or Y; and \"Z\" can be M, P, MS, PX, M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, or MS-SD CentrsoSolar C and E series.",
        "score": 0.49641174,
        "bucket": "datasheets"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_for_Flat_Roof_Applications_Addendum.pdf",
        "title": "[PDF] Ground Mount for Flat Roof Applications - IronRidge",
        "snippet": "UL 2703 LISTED Conforms to STD UL 2703 Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels • Scope of Evaluation includes bonding, grounding, mechanical loading, and fire classification • Max Overcurrent Protective Device (OCPD) Rating: 40A • Max Module Size: 36.8 ft² • Module Orientation: Portrait or Landscape • Actual system structural capacities and module sizes are defined [...] and \"yyy\" can be 108BB-US, 108V, 108VB, 144S, 144US, 144TS-US, 144V or 144VB Big Shine Solar Big Shine Solar modules with 35mm frames BSExxxN-144BMH-DG Bila Solar Bila Solar modules with 30 mm frames AA-xxxUS-6x24GG Bluesun Solar Bluesun modules with 30 and 35 mm frames BSMxxxY-AAA Where \"Y\" can be M or M10; and \"AAA\" can be 60HPH or 72HBD Boviet Boviet modules with 33, 35 and 40 mm frames BVMZZaaYY-xxx-Bcc Where \"ZZ\" can be 66, 76 or 86; \"aa\" can be 10, 11 or 12; \"YY\" can be M, M(S) or P; and [...] \"B\" can be blank or L; and \"cc\" can be blank, H, H-HC, H-HC-BF, H-HC-BF-DG or R-H-HC-BF BYD BYD Solar modules with 30mm frames BYDxxxZLBK Where \"Z\" can be M or N Canadian Solar Canadian Solar modules with 30, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, R, U, W, Y, -48TM, -54TM, -66TB, -66TM or -72TB; and \"Z\" can be blank, H, HP, P, PB-AG, M, MS, MS-HL, MB-AG, T or TB-AG © 2025 IRONRIDGE, INC. VERSION 4.6 GROUND MOUNT FOR FLAT ROOF APPLICATIONS -",
        "score": 0.46016815,
        "bucket": "datasheets"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Ground_Mount_Installation_Manual.pdf?srsltid=AfmBOop-a2Eih3JB1PZgkDa4KXxSfys9FfeIW5sw5BDCTvemm2o9AnzJ",
        "title": "[PDF] Ground Mount Installation Manual - RESsupply.com",
        "snippet": "L-G6.3/BFG, G7, BLK-G6+, BLK-G6+/ AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, M-G2+, BLK M-G2+, BLK M-G2.H+, BLK M-G2+/AC, BLK M-G2.H1+/AC, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, BLK-G10, BLK-G10+, BLK G10+/AC, BLK-G10+/HL, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, BLK ML-G10.B+, BLK ML-G10.C+, BLK ML-G10 [...] PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO, PEAK DUO or TRON; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/ SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, L-G6, L-G6.1, L-G6.2, L-G6.3, [...] DE14, DE15, DE15V, DEG15, DEG15VC, DE18M, DEG18MC, DE09, DE19, DEG19C.20, DE06X, PA05, PC05, PD05, PD06, PA14, PC14, PD14, PE14, PE15, NE19RC, NEG19RC, NE09RC or NE09RH.05 ; and \"ZZ\" can be blank, .05, .05(II), .08, .08(II), .10, .18, .08D, .18D, 0.82, .002, .00S, 05S, 08S, .20, .20(II), A, A.05, A.08, A.10, A.18, (II), A(II), A.05(II), A.08(II), A.082(II), A.10(II), A.18(II), C.05, C.07, C.05(II), C.07(II), H, H(II), H.05(II), H.08(II), HC.20(II), HC.20(II), M, M(II), M.05(II), MC.20(II)",
        "score": 0.67706895,
        "bucket": "installation"
      },
      {
        "url": "https://www.solar-electric.com/lib/wind-sun/Tamarack-Solar-Ground-Mount-System-Installation-Manual.pdf?srsltid=AfmBOoqq3-TwEiIiLiYvpqHqA_Ul3HA6dCY-izwD61Is2STVyX78qRHC",
        "title": "[PDF] Installation Manual Tamarack Ground Mount System",
        "snippet": "blank, Tron, Q or B; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, [...] L-G6, L-G6.1, L-G6.2, L-G6.3, G7, BLK-G6+, BLK-G6+/AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, XL-G9, XL-G9.2, XL-G9.3, XL-G9.3/BFG, M-G2+ or BLK M-G2+ Hansol Hansol modules with 35 and 40 frames HSxxxYY-zz Where \"YY\" can be [...] 13 support@tamaracksolar.com 1-800-819-7236 Ext 556 PAGE Installation Manual Ground Mount SYSTEM Install Rail Assemblies onto the Pipe Substructure Install the first module mounting rail assembly at one end of the horizontal beams at least 1-IN in from the end of the two beams. Position the rail assembly to be centered on the two horizontal beams (north to south), and with the rail assembly perpendicular (90°) to the beams. Finger-tighten the flange nuts on the Pipe Mount Clamps and on the",
        "score": 0.6426349,
        "bucket": "installation"
      },
      {
        "url": "https://www.solar-electric.com/lib/wind-sun/Tamarack-Solar-Ground-Mount-System-Installation-Manual.pdf?srsltid=AfmBOoqK68FXMTM7Cqg7HQaah9cf9l3KgCT69-3502bJJ7lfYfOVse2A",
        "title": "[PDF] Installation Manual Tamarack Ground Mount System",
        "snippet": "blank, Tron, Q or B; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, [...] L-G6, L-G6.1, L-G6.2, L-G6.3, G7, BLK-G6+, BLK-G6+/AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, L-G8.3, L-G8.3/BFF, L-G8.3/BFG, L-G8.3/BGT, ML-G9, BLK ML-G9, ML-G9+, BLK ML-G9+, ML-G10, BLK ML-G10, ML-G10+, BLK ML-G10+, ML-G10.a, BLK ML-G10.a, ML-G10.a+, BLK ML-G10.a+, XL-G9, XL-G9.2, XL-G9.3, XL-G9.3/BFG, M-G2+ or BLK M-G2+ Hansol Hansol modules with 35 and 40 frames HSxxxYY-zz Where \"YY\" can be [...] 13 support@tamaracksolar.com 1-800-819-7236 Ext 556 PAGE Installation Manual Ground Mount SYSTEM Install Rail Assemblies onto the Pipe Substructure Install the first module mounting rail assembly at one end of the horizontal beams at least 1-IN in from the end of the two beams. Position the rail assembly to be centered on the two horizontal beams (north to south), and with the rail assembly perpendicular (90°) to the beams. Finger-tighten the flange nuts on the Pipe Mount Clamps and on the",
        "score": 0.6426349,
        "bucket": "installation"
      },
      {
        "url": "https://www.solar-electric.com/lib/wind-sun/Tamarack-Solar-Ground-Mount-System-Installation-Manual.pdf?srsltid=AfmBOoqgRjJSF6kLiA8TfAlAkEyhydY4dO7iV4KQRgpGnFGENCzrEM0Y",
        "title": "[PDF] Installation Manual Tamarack Ground Mount System",
        "snippet": "blank, Tron, Q or B; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, [...] Install one 5050 Clamp in each rail on the other side of the first module and slide it down so that the inside of the clamp contacts the frame of the first module. The springs will hold the clamps in place prior to tightening. Place the second module on the rails, align it with the first module, and slide down and fully into the two mid-clamps. Tighten the mid-clamp bolts to 144 inch-pounds (12 foot-pounds) to fully secure the module. [...] On the top edge of the last module of the first column, install the 5050 Clamps so that the sides with the two stainless-steel pins are facing in toward the module frame, and the clamp is tight up against the module frame. Tighten the two end clamp bolts 6 foot-pounds.",
        "score": 0.5803764,
        "bucket": "installation"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/2021/06/MSY-MA_Montageanleitung_Allgemein_EN.pdf",
        "title": "[PDF] Mounting systems Installation manual – general information",
        "snippet": "This manual describes the universally valid aspects of handling Mounting Systems GmbH's products, above all with regard to safety.",
        "score": 0.57780564,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Tamarack-Solar-Ground-Mount-Kit-Installation-Manual.pdf?srsltid=AfmBOopdjexxyLh2XMNuqqOSIhvCNtzYqt8X0LYYBYq9MlaA9L83kXmw",
        "title": "[PDF] Tamarack Solar Ground Mount Kit Installation Manual",
        "snippet": "Design • Make a drawing showing the dimensions of the mount system and the location of the mounting peers. • Read this manual before beginning installation. [...] 35, and 40 mm frames - CSbY-xxxZ Where \"b\" can be 1, 3 or 6; \"Y\" can be H, K, L, N, P, U, V, W, X or Y; and \"Z\" can be M, P, MS, PX, M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, or MS-SD CentrsoSolar C and E series. [...] or B.; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, L-G6, L-G6.1,",
        "score": 0.5726516,
        "bucket": "installation"
      },
      {
        "url": "https://boxedsolar.com/wp-content/uploads/IronRidge_Ground_Mount_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual - BOXED Solar",
        "snippet": "GROUND MOUNT INSTALLATION MANUAL Contents GROUND MOUNT INSTALLATION MANUAL - 1 © 2019 IRONRIDGE, INC. VERSION 2.3 DISCLAIMER\b 1 RATINGS\b 2 MARKINGS\b 2 CHECKLIST\b 3 1. BUILD BASE\b 4 2. CONNECT SUBSTRUCTURE\b 4 3. PLACE RAILS\b 5 4. SECURE LUGS\b 5 5. SECURE MODULES\b 6 CAMO\b 7 ELECTRICAL DIAGRAM\b 8 DIAGONAL BRACES (OPTIONAL)\b 9 END CAPS\b 9 WIRE CLIPS\b 9 SPLICING CROSS PIPE\b 10 MICROINVERTER KITS\b 11 SYSTEMS USING ENPHASE MICROINVERTERS OR SUNPOWER AC MODULES\b 11 SYSTEMS USING MICROSTORAGE PRODUCTS\b [...] GROUND MOUNT INSTALLATION MANUAL - 2 © 2019 IRONRIDGE, INC. VERSION 2.3 RATINGS MARKINGS Product markings are located on the system’s Rail Connectors.\nUL 2703 LISTED • Conforms to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\n• Certified to CSA STD LTR AE-001-2012 Photovoltaic Module Racking Systems. [...] GROUND MOUNT INSTALLATION MANUAL - 13 © 2019 IRONRIDGE, INC. VERSION 2.3 MODULE COMPATIBILITY The Ground Mount System may be used to ground and/or mount a PV module complying with UL 2703 only when the specific module has been evaluated for grounding and/or mounting in compliance with the included instructions. Unless otherwise noted, “xxx” refers to the module power rating and both black and silver frames are included in the certification.",
        "score": 0.57064295,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Ironridge%20Ground%20Mount%20Installation%20Guide.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual - LA County Public Works",
        "snippet": "GROUND MOUNT INSTALLATION MANUAL Contents GROUND MOUNT INSTALLATION MANUAL - 1 © 2019 IRONRIDGE, INC. VERSION 2.8 DISCLAIMER\b 1 RATINGS\b 2 MARKINGS\b 2 CHECKLIST\b 3 1. BUILD BASE\b 4 1. BUILD BASE\b 5 2. CONNECT SUBSTRUCTURE\b 5 3. PLACE RAILS\b 6 4. SECURE LUGS\b 6 5. SECURE MODULES\b 7 CAMO\b 8 ELECTRICAL DIAGRAM\b 9 DIAGONAL BRACES (OPTIONAL)\b 10 END CAPS\b 10 WIRE CLIPS\b 10 SPLICING CROSS PIPE\b 11 MICROINVERTER KITS\b 12 SYSTEMS USING ENPHASE MICROINVERTERS OR SUNPOWER AC MODULES\b 12 SYSTEMS USING [...] GROUND MOUNT INSTALLATION MANUAL - 2 © 2019 IRONRIDGE, INC. VERSION 2.8 RATINGS MARKINGS Product markings are located on the system’s Rail Connectors.\nUL 2703 LISTED • Conforms to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\n• Certified to CSA STD LTR AE-001-2012 Photovoltaic Module Racking Systems. [...] MICROSTORAGE PRODUCTS\b 13 FRAMELESS MODULE KITS\b 13 MODULE COMPATIBILITY\b 14-18 FRAMLESS MODULE COMPATIBILITY\b 19 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily",
        "score": 0.55709904,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Ground-Mount-Kit-Manual-v2.pdf?srsltid=AfmBOooAuxG8XV7LGTMJ2mQKycWlclpCCzkLkimlp394tT-n1phj1rQg",
        "title": "[PDF] Ground Mount Kit - Solaris-shop.com",
        "snippet": "Make a drawing showing the dimensions of the mount system and the location of the mounting peers. • Read this manual before beginning installation.",
        "score": 0.5440511,
        "bucket": "installation"
      },
      {
        "url": "https://www.sfusa.com/vs-uploads/resources/1551900179_SFUSA%20GroundMount%20Racking%20-%20SF100%20UL%20Install%20Manual%20Ver%204.1.pdf",
        "title": "[PDF] SFUSA® Ground Mount Structure Installation Manual",
        "snippet": "installers who are trained and competent in all the required skills needed to complete system construction. This manual must be used in conjunction with project specific drawings which are provided for each installation by Solar Foundations USA®, Inc. The project drawings are unique to each job site and are based on client specified configurations and local design conditions. Installer Responsibilities:  Comply with all national, state and local building codes, including any requirement that [...] 5M18, 6M, 6M18, 6M24, 6M27, 6M30, 6P, 6P18, 6P27, 6P30)-xxx (Blank, Black, Transparent, PERC) with 35 or 40 mm Frames. AXITEC Solar: AC-xxx(M, P)/156-(60,72)S with 35 or 40 mm Frames. Boviet Solar: BVM(6610P, 6612P, 6610M, 6612M)-xxx with 40mm Frames. Canadian Solar: CS(3K, 3U, 6K, 6P, 6U, 6X)-xxx(M, MS, P) with 40 mm Frames. ET Solar: ET-(M6, P6)(72)xxx(BB, WB, WW) with 40 mm Frames. Hanwha Q CELLS: Q.(PRO, PLUS, PEAK)-(G3, BLK-G3, BFR-G3, G4, BFR-G4, G4.1, G4.1/SC, BFR-G4.1, BLK-G4.1, L-G4.2, [...] written installation manual for the Product, or if the Product has been modified, repaired or reworked in a manner not previously authorized in writing by Solar Foundations USA®, Inc., or if the Product is installed in an environment for which it was not designed or if the Purchaser fails to provide necessary preventive maintenance such as re-application of cold galvanizing compound as needed. The remedies provided in the above limited warranty are the sole and exclusive remedies available to",
        "score": 0.54187006,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual",
        "snippet": "GROUND MOUNT INSTALLATION MANUAL Contents GROUND MOUNT INSTALLATION MANUAL - 1 © 2025 IRONRIDGE, INC. VERSION 4.5 DISCLAIMER\b 1 RATINGS\b 2 MARKINGS\b 2 CHECKLIST\b 3 1. BUILD BASE\b 4 1. BUILD BASE\b 5 2. CONNECT SUBSTRUCTURE\b 5 3. PLACE RAILS\b 6 4. SECURE LUGS\b 6 5. SECURE MODULES\b 7 CAMO\b 8 ELECTRICAL DIAGRAM\b 9 DIAGONAL BRACES (OPTIONAL)\b 10 END CAPS\b 10 WIRE CLIPS\b 10 SPLICING HORIZONTAL BEAMS\b 11 MICROINVERTER KITS\b 12 SYSTEMS USING MICROSTORAGE PRODUCTS\b 13 FRAMELESS MODULE KITS\b 13 MODULE [...] BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/ SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, L-G5.2/H, L-G5.3, G6, G6/SC, G6/TS, G6+/TS, G6+, BLK-G6, L-G6, L-G6.1, L-G6.2, L-G6.3, L-G6.3/BFG, G7, BLK-G6+, BLK-G6+/ AC, BLK-G6+/HL, BLK-G6+/SC, BLK-G6/TS, BLK-G6+/TS, BLK-G7, G7.2, G8, BLK-G8, G8+, BLK-G8+ L-G7, L-G7.1, L-G7.2, L-G7.3, L-G8, L-G8.1, L-G8.2, [...] COMPATIBILITY\b 14-20 FRAMLESS MODULE COMPATIBILITY\b 21 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Any installation or use of this product not in accord with or not authorized by this written instruction shall void any and all",
        "score": 0.53342235,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Unirac%20SM%20SolarMount%20Installation%20Guide.pdf",
        "title": "[PDF] Unirac SM SolarMount Installation Guide.pdf",
        "snippet": "Manufacturer Series/Model Aleo P18, P19 AU Optronics (BenQ Solar) PM Series Auxin AXN6M610T, AXN6P610T, AXN6M612T & AXN6P612T Axitec AXIpower, AXIpremium, AXIblackpremium Boviet BVM6610 & BVM6612 Series Canadian Solar CS5A-M, CS6P-M, CS6P-P, CS6X-P, CSX-P, ELPS CS6P-MM, ELPS CS6A-MM, CS6U-P, CS6U-M, CS6K-MS, CS6K-M, CS6K-P, CS3U-P, CS3U-MS, CS3K-P, CS3K-MS, CS1K-MS, CS3W-P, CS3L-P, CS3K-MB, CS3K-PB, CS3U-MB, CS3U-PB, CS3U-MS, CS3U-P, CS3K-MS, CS3K-P, CS6U-P, CS6K-MS, CS6K-P Centrosolar America [...] systems. See page I for details WEEB washer dimples pierce anodized rail to create bond between rail and lug Solid copper wire connected to lug is routed to provide final system ground connection. [...] used to ground and/or mount a PV module complying with UL1703 only when the specific module has been evaluated for grounding and/or mounting in compliance with the included instructions.",
        "score": 0.34468657,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Warranty%20Statement.pdf?srsltid=AfmBOorn1y2QUJvpjqfWaCcEmAeK3FCfqBwkAuKAkCdLQNG4wKHNqF6q",
        "title": "[PDF] Mounting Systems Warranty Statement - Solaris-shop.com",
        "snippet": "Mounting Systems, Inc. | 820 Riverside Parkway | West Sacramento, CA 95605 Contact: Phone 1 855 731 9996 | jobs@mounting-systems.us | www.mounting-systems.us § 1 Limited Warranty A. Mounting Systems, Inc., hereinafter referred to as “Mounting Systems”, warrants only to its direct customer (“Customer”) that the products listed below (each a “Product” and, collectively, the “Products”), when installed properly in the United States of America or Canada, will be free from defects in workmanship and [...] is 10 years. C. The warranty period for all non-metallic Product components is 2 years. D. Each warranty period commences on the date of delivery of the Product to the Customer. § 3 Procedures in the Event of a Warranty Claim If the Product exhibits defects that are covered under this Limited Warranty, then please promptly contact Mounting Systems Customer Service at (855) 731-9996 or at the address or facsimile number noted below. Please have the following information available when contacting [...] INCIDENTAL DAMAGES ARISING FROM OR OUT OF THE INSTALLATION OR USE OF ANY PRODUCT, OR ANY BREACH OF WARRANTY; WITHOUT LIMITING THE FOREGOING, MOUNTING SYSTEMS SHALL NOT BE LIABLE FOR PERSONAL INJURY, PROPERTY DAMAGE, LOST PROFIT, LOST REVENUE, HARM TO REPUTATION, LOSS OF DATA, ADVERTISING OR MANUFACTURING COSTS, OVERHEAD COSTS, LOST CUSTOMERS, OPERATIONAL DISRUPTIONS OR DOWN-TIME RESULTING FROM THE INSTALLATION OR USE OF ANY PRODUCT OR ANY BREACH OF WARRANTY. Some jurisdictions do not allow the",
        "score": 0.6977124,
        "bucket": "other"
      },
      {
        "url": "https://sunceco.com/wp-content/uploads/2018/05/mounting-systems.pdf",
        "title": "[PDF] Mounting Systems | Sunceco",
        "snippet": "MOUNTING SYSTEMS PRODUCT CATALOG CONTENTS GROUND SYSTEMS Open areas mounting solutions Solar carport mount 3 GTS ground mount 4 DE pile ground mount 5 Pole ground mount 6 Agriculture greenhouse 7 ROOF SYSTEMS Solutions for all roof types Metal roof mount 8 Standing seam mount 9 Railless metal sheet mount 10 Tile roof mount 11 Triangle roof mount 12 Railless ballasted mount 13 Adjustable tilt mount 14 Mounting systems, as solar modules supporting equipment, represent an important part of the [...] final solar solution. Integrated, they constitute a reliable product for long-term use. Sunceco offers wide range of high-quality mounting systems patented for all common photovoltaic systems and commer­ cial application on the ground and on different types of roofs. [...] highest pre-assembly to unfold at site. The optimized design is carried out by experi­ enced engineers, this is important as high loads caused by wind and snow. It can use ground screw or concrete foundations, and its variable inclination and height makes plant design flexible. Made of aluminum, the system is extremely low-maintenance during its entire life span and fully recyclable, aesthetically pleasing, ideal for quick installation.",
        "score": 0.65412235,
        "bucket": "other"
      },
      {
        "url": "https://esign.com/wp-content/uploads/Mississippi-Special-Warranty-Deed-Form.pdf",
        "title": "[PDF] Mississippi Special Warranty Deed Form - eSign",
        "snippet": "written. _____________________________ _____________________________ Grantor’s Signature Grantor’s Signature _____________________________ _____________________________ Grantor’s Name Grantor’s Name _____________________________ _____________________________ Street Address Street Address _____________________________ _____________________________ City, State & ZIP City, State & ZIP STATE OF _____________________ COUNTY OF _____________________ I, the undersigned, a Notary Public in and for said [...] (hereinafter known as the “Grantor(s)”) hereby convey and warrant specially _________________________________, a _________________, with a mailing address of ___________________________________________________________________, a residential phone number of _________________, and a business phone number of _________________ (hereinafter known as the “Grantee(s)”) the following described real estate, situated in ______________ County, Mississippi, to-wit: [WRITE LEGAL DESCRIPTION HERE OR ATTACH [...] County, in said State, hereby certify that ______________________________ whose names are signed to the foregoing instrument, and who are known to me, acknowledged before me on this day that, being informed of the contents of the instrument, they executed the same voluntarily on the day the same bears date. Given under my hand this _______________ (mm/dd/yyyy). ____________________________________ Notary Public Signature My Commission Expires: ______________",
        "score": 0.24874899,
        "bucket": "other"
      },
      {
        "url": "https://eforms.com/images/2016/06/mississippi-special-warranty-deed-form.pdf",
        "title": "[PDF] Mississippi Special Warranty Deed Form - eForms",
        "snippet": "commission expires: __________________ [Affix seal here] [...] ______________________________________________________________________ proved to me through satisfactory identification of __________________________, to be the person(s) whose name(s) is/are signed above who personally executed such document in my presence, acknowledged to me that he/she/they signed it voluntarily for its stated purpose and swore or affirmed to me that all statements made herein are true, accurate and complete. _______________________________________________ Notary Public My [...] ______________________________________________ with a street address of _____________________________________ in the City of ______________________ State of ______________________ (the “Grantee(s)”) as: ☐ Husband and wife, tenants by the entirety ☐ Joint tenants ☐ Tenants in common A certain parcel of land with the buildings thereon situated with a street address of _____________________________________ in the City of ______________________ State of ______________________ being shown as",
        "score": 0.23646374,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "mounting-systems",
    "product": "Mounting Systems MS-HEAVY",
    "candidates": [
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_Produktkatalog-ProLine_EN_compressed.pdf",
        "title": "[PDF] Product Catalogue ProLine - Mounting Systems",
        "snippet": "Total height: 171 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 40 - 51 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base dimensions: 95 x 100 mm (W x L) Base holes: 8 x ø 7 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21 mm to rail area Weight: 0.49 kg Total height: 172 mm Base plate: 95 x 100 mm (W x L) Base holes: 8 x ø 9 mm Height in roof batten area: 45 - 58 mm Max. height adjustment: 21 [...] Leg front 770mm 821-0002 1 -821-0002 Leg back, diagonal 1608mm 821-0003 1 -821-0003 Leg back, diagonal 2029mm 821-0004 1 -821-0004 Leg back, diagonal 1425mm 821-0011 1 -821-0011 Leg back, diagonal 1753mm 821-0012 1 -821-0012 a Ramming posts b Fixing plates c Module support d Rafter e Module (end) clamp Leg and Diagonal Rafter Material: S350 GD + ZM 310 MA Dimensions: 40 x 40 mm (W x H) Weight: 1.813 kg/m Material: S350 GD + ZM 310 MA Dimensions: 83 x 100 mm (W x H) Weight: 3.843 kg/m Item No. [...] Total height: 170 mm Base dimensions: 50 x 180 x 4 mm (W x L x T) Base holes: 12 x ø 7 mm Height in roof batten area: 45 mm Max. height adjustment: 38 mm to rail area Upper slot dimensions: 38 mm and ø 9 mm Weight / Comfort: 0.57 kg / 0.61 kg Total height: 156 mm Base dimensions: 50 x 180 x 4 mm (W x L x T) Base holes: 12 x ø 7 mm Height in roof batten area: 44 mm Max. height adjustment: 37 mm to rail area Upper slot dimensions: 38 mm and ø 9 mm Weight: 0.56 kg Total height: 228 mm Base",
        "score": 0.6932451,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_Brochure-ProLine_2025_EN_compressed.pdf",
        "title": "[PDF] ProLine | Mounting Systems",
        "snippet": "to renewable energy, Mounting Systems sets the standard in the PV mounting industry. Mounting Systems GmbH has an experienced team of experts to help customers select the most suitable system for their specific needs and assist with system design and installation. With our wide range of products and services, Mounting Systems is a reliable partner for anyone looking for a safe and effective PV mounting solution. [...] Our products are designed to ensure reliable and secure mounting of photovoltaic systems on roofs, maximizing energy production from sunlight. They meet the highest safety standards and offers solutions for every conceivable situation. The systems are made of high-quality materials and are designed to withstand the harshest weather conditions and loads. In addition, the company is continuously developing and improving its products to maximize safety and efficiency. With passion and commitment [...] unlimited Module inclination 20° or 30° Min. module elevation to the ground 70 - 80 cm Foundation Cap profi le (ramming post) 2.8 m Max. ground inclination Up to 15° in east-west direction Frame profi les Extruded aluminium (EN AW 6063 T66) Corrosion resistance Standard: Class C3 Small parts Geomet-coated steel, stainless steel V2A, extruded aluminium (EN AW 6063 T66) Warranty 10 Years 1-Post Confi guration Dimensions (H x W) Clamping 2x Portrait 1744 mm x unlimited Fixing of the module support",
        "score": 0.60358196,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.renusol.com/files/content/Downloads/Datenbl%C3%A4tter/MS/20231030_EN_MS%2B_System%20Datasheet.pdf",
        "title": "[PDF] System Datasheet - MS+ - Renusol",
        "snippet": "System. PV-Mounting system for metal sheet roofs. Content. Mounting bracket, fastening elements, module clamps. System warranty. 10 years.",
        "score": 0.518815,
        "bucket": "datasheets"
      },
      {
        "url": "https://catalogue.k2-systems.com/media/ab/1d/f3/Product-Brochure-en.pdf",
        "title": "[PDF] Mounting systems - K2 Catalogue",
        "snippet": "draining ­ rainwater with optional roof drainage Layout • In single or double version with 10° inclination • Module layout 3x portrait Optional trapezoidal sheet metal roofing Available in two versions: • With trapezoidal sheet metal covering for robust protection and classic aesthetics • Without trapezoidal sheet metal cladding for the use of bifacial modules and a more modern look 1. [...] Multiple foundation options • Installation directly in the ground or on driven piles foundations • Quick and cost effective solution using driven pile foundations Multiple inclination options • Inclination of 20°: Installation of two rows of modules • Inclination of 15°: possibility of installing three rows of modules System-Highlights Simple, flexible and quick installation • Fixing with concrete or driven pile foundation • Multiple inclination options: 15° and 20° • Flexible and customised [...] Standing seam • Multitude of application possibilities: Double standing seam, angled seam, snap seam and round seam • Direct lateral rail connection • Penetration-free assembly Corrugated fibre cement and corrugated sheet metal • For all corrugated fibre cement and corrugated sheet metal roofing with wooden substructure • Secure sealing on the roofing • Climber connection • abZ (general technical approval) in Germany Roof tiles and slate • Roof hooks for the majority of clay tiles, pantiles and",
        "score": 0.4041552,
        "bucket": "datasheets"
      },
      {
        "url": "https://hutchinsonai.com/wp-content/uploads/2020/05/Barry-Controls-2011-compressed.pdf",
        "title": "[PDF] Full Catalog of Barry Controls/Hutchinson Mounting Products for ...",
        "snippet": "Mount Series 154 High Deflection Mounts ME Series 163 TTA Series 166 TTB Series 168 HTTA Series 170 VHC Series 172 2K Series 174 GB530 Series 178 GBCO (Barry-Flex) 180 Applications Vehicle Market Heavy trucks 6 Buses 8 Off highway 10 Vehicle systems 12 Industrial Market Small engines 14 Machinery 16 Off shore platforms 18 Buildings 20 Railroad 22 Marine 24 Defense Market Tanks & other tracked vehicles 26 Fixed wing aircraft 28 Missiles/Torpedoes 30 Submarines 32 Surface ships 34 Rotary wing [...] Low frequency vibration isolation and high deflection shock attenuation with minimum tilt under all conditions.\nLow frequency vibration isolation to minimize energy transmission.\nHigh-frequency isolation for shock protection and minimum noise transmission.\nAttenuate high-frequency road shock and transient vibrations.\nNatural frequency 25-35 Hz.\nAttenuate high-frequency road & terrain shock and transient vibrations.\nDesigned to ensure equipment survival. [...] Air turbulence.\nLanding impact.\nTaxiing.\nAmplified vibration caused by structural resonances.\nPropulsion system.\nAir turbulence.\nLanding impact.\nTaxiing.\nAmplified vibration caused by structural resonances.\nPropulsion system (Warm-up & Flight) Air turbulence.\nLanding impact.\nTaxiing.\nAmplified vibration caused by structural resonances.\nGunfire.\nOil.\nChemicals.\nFluids.\nOil.\nSunlight.\nOzone.\nHumidity.\nSalt Spray.\nOil.\nSunlight.\nOzone.\nHumidity.\nHeat and cold.\nHumidity.\nLubricants.",
        "score": 0.39508808,
        "bucket": "datasheets"
      },
      {
        "url": "https://static.csisolar.com/wp-content/uploads/2020/10/05094834/Installation_Manual_of_Standard_Solar_Modules_en-v3.3.pdf",
        "title": "[PDF] INSTALLATION MANUAL OF STANDARD SOLAR MODULES",
        "snippet": "1800 Pa 1800 Pa 24 inches (0.61 m) 8 inches (0.2 m) 2000 Pa 2000 Pa CS6R-MS-HL 48 inches (1.22 m) 16 inches (0.41 m) 1800 Pa 1800 Pa 32 inches (0.81 m) 10.7 inches (0.27 m) 1800 Pa 1800 Pa 24 inches (0.61 m) 8 inches (0.2 m) 2000 Pa 2000 Pa | 22 EN-Rev IM/GN-AM-EN/3.3 Copyright © December, 2022. CSI Solar Co., Ltd. www.csisolar.com 6.3 INSERTION SYSTEMS  This mounting method has been certified by VDE and CSA, or qualified by Canadian Solar.  Insertion methods can vary and depend on the [...] the maximum possible system open-circuit voltage. For CS7N-MS, CS7L-MS and CS7L-MS-R, Canadian Solar recommends the use of a copper wire of at least 6 mm² (10AWG) section.  Only copper conductor material should be used. Select a suitable conductor gauge to minimize voltage drop and ensure that the conductor ampacity complies with local regulations (i.e. NEC 690.8(D)). CABLE AND CONNECTOR PROTECTION  Secure the cables to the mounting system using UV-resistant cable ties. Protect exposed cables [...] （F23 Frame） +2200/-2000 / / +5400/-2400 / / CS6R-MS/CS6RA-MS/CS6RB-MS +2200/-2200 / +2400/-2400 / / / CS6R-MS-HL +2400/-2400 / / / +5400/-2400 / | 19 EN-Rev IM/GN-AM-EN/3.3 Copyright © December, 2022. CSI Solar Co., Ltd. www.csisolar.com 6.2.6 Four clamp mounting on short side of frame. Module Types Max Mechanical Load (Pa) +1000/-1000 +1200/-1200 +2000/-2000 +2200/-2200 +2200/-2000 +2400/-2400 +2600/-2400 A2 Range (mm) CS1VL-MS/CS1HA-MS / / / / / 0-250 CS1V-MS / / 0-210 / / / CS3K-P / / 0-200",
        "score": 0.3122971,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.usg.com/content/dam/USG_Marketing_Communications/united_states/product_promotional_materials/finished_assets/donn-suspension-systems-accessory-data-AC2396.pdf",
        "title": "[PDF] suspension systems accessories guide - USG",
        "snippet": "Wall Molding 240 20 63 M18 12'x7/8\"x1-1/8\" Wall Molding 240 20 40 MC11A25 10'x1\"x1\" Steel Molding with Aluminum Cap 250 25 39 M20SM 10'x1\"x2\" Heavy Duty Wall Molding 250 25 80 M20SM-2 10'x2\"x2\" Wall Molding 200 20 76 M202 10'x1\"x2\" Wall Molding 250 25 55 SHADOW MOLDING Length x A x B x C x D (See illustration above) MS125 12'x15/16\"x1/4\"x1/4\"x 9/16\" (Side 1) 300 25 46 12'x 9/16\"x1/4\"x 1/4\"x 15/16\" (Side 2) MS144 12'x3/4\"x3/8\"x1/2\"x3/4\" (Side 1) 300 25 48 12'x3/4\"x1/2\"x3/8\"x3/4\" (Side 2) MS1543 [...] 12'x7/8\"x3/4\"x3/4\"x7/8\" 300 25 67 MS164 12'x3/4\"x3/4\"x3/4\"x3/4\" 300 25 62 MS1743 12'x7/8\"x3/8\"x3/8\"x9/16\" (Side 1) 300 25 43 12'x9/16\"x3/8\"x3/8\"x7/8\" (Side 2) MS274 10'x7/8\"x3/4\"x9/32\"x1-1/4\" 200 20 54 US CHANNEL WALL MOLDING US8 10'x1/2\"x1/2\"x1\" U-Molding 100 10 8 US12 10'x3/4\"x1/2\"x1\" U-Molding 500 50 44 US20 10'x1-1/4\"x1/2\"x1\" U-Molding 300 30 57 UA25-10 10'x1-9/16\"x1/2\"x1\" Aluminum U-Molding 100 10 11 UA25-30 10'x1-9/16\"x1/2\"x1\" Aluminum U-Molding 300 30 33 UA25CE 10'x1-9/16\"x1/2\"x1\" [...] Wt. (lb.) ANGLE MOLDING M71 12'x7/8\"x7/8\" Wall Molding 480 40 63 M7OL 12'x7/8\"x7/8\" Overlapping Wall Molding 480 40 63 M7A 12'x7/8\"x7/8\" Aluminum Wall Molding 480 40 26 M7-10 10'x7/8\"x7/8\" Wall Molding 400 40 26 M7SS 12'x7/8\"x7/8\" Stainless Steel Wall Molding 240 20 31 M7Z 12'x7/8\"x7/8\" Hot-Dipped Galvanized Steel Wall Molding 480 40 58 M7CE 12'x7/8\"x7/8\" Wall Molding w/gaskets 240 48 59 M91 12'x9/16\"x15/16\" Wall Molding 480 40 55 M9-10 10'x9/16\"x15/16\" Wall Molding 400 40 23 M12 12'x1\"x1-1/2\"",
        "score": 0.30148593,
        "bucket": "datasheets"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Unirac%20SM%20SolarMount%20Installation%20Guide.pdf",
        "title": "[PDF] Unirac SM SolarMount Installation Guide.pdf",
        "snippet": "Manufacturer Series/Model Aleo P18, P19 AU Optronics (BenQ Solar) PM Series Auxin AXN6M610T, AXN6P610T, AXN6M612T & AXN6P612T Axitec AXIpower, AXIpremium, AXIblackpremium Boviet BVM6610 & BVM6612 Series Canadian Solar CS5A-M, CS6P-M, CS6P-P, CS6X-P, CSX-P, ELPS CS6P-MM, ELPS CS6A-MM, CS6U-P, CS6U-M, CS6K-MS, CS6K-M, CS6K-P, CS3U-P, CS3U-MS, CS3K-P, CS3K-MS, CS1K-MS, CS3W-P, CS3L-P, CS3K-MB, CS3K-PB, CS3U-MB, CS3U-PB, CS3U-MS, CS3U-P, CS3K-MS, CS3K-P, CS6U-P, CS6K-MS, CS6K-P Centrosolar America [...] C-Series, E-Series CertainTeed CTxxxMxx-01, CTxxxP01, CTxxxMxx02, CTxxxMxx03 Eco Solargy Orion 1000, Apollo 1000 ET Solar ET AC Module, ET Module Flextronics FXS GCL GCL-P6 & GCL-M6 Series Hansol TD-AN3, TD-AN4, UB-AN1, UD-AN1 Hanwha SolarOne HSL 60 Heliene 72M, 72P, 72M-BLK, 60M, 60P, 60M-BLK, 36M, 36P Hyundai Heavy Industries MG, RW, RG, KG, TG Series Hyundai Heavy Industries KI, TI, RI Series ITEK iT HE and iT SE Japan Solar JPS-60 & JPS-72 Series JA Solar \"JAP6(k)-72-xxx/4BB; [...] anodized, or dark anodized.",
        "score": 0.2214184,
        "bucket": "datasheets"
      },
      {
        "url": "https://files.ironridge.com/quickmount/QMPV-datasheet-QMR-QRail-legacy-web.pdf",
        "title": "[PDF] QRail® System - IronRidge",
        "snippet": "This manual describes the installation of the QRail mounting system and provides necessary information regarding components, system planning, and important",
        "score": 0.1321224,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.eaton.com/content/dam/eaton/products/support-systems/pipe-hangers/pipe-straps/pipe-hanger-and-supports-ca310001en.pdf",
        "title": "[PDF] Pipe hangers and supports catalog - Eaton",
        "snippet": "At Eaton, we believe that power is a fundamental part of just about everything people do. That's why we're dedicated to helping our customers find new ways",
        "score": 0.04621015,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/2021/06/MSY-MA_Montageanleitung_Allgemein_EN.pdf",
        "title": "[PDF] Mounting systems Installation manual – general information",
        "snippet": "Indicates a possibly dangerous situation that in case of non-compliance with the instructions can lead to slight or minor injuries and to property damage.\nIndicates a possible danger that could lead to property damage.\nWARNING CAUTION ATTENTION DANGER 5 Installation mannual - general information 5. Safety instructions 5.1. Intended use Unless explicitly stated otherwise, Mounting Systems GmbH’s products are designed exclusively for the installation of PV modules. [...] Otherwise, any warranty claims will be forfeited.\n5.3. General Safety Instructions The following general safety instructions are an important part of this document and are of fundamental importance to the handling of Mounting Systems GmbH’s PV mounting systems.\n• Prior to assembly or installation, ensure that the product complies with the structural requirements on site. [...] The specific mounting systems shall only be used within their defined operating conditions. The concept of intended use also comprises the compliance with the specifications both within this manual and the respective product-specific installation manual. Mounting Systems GmbH shall not reliable for damages caused by the non-observance of the installation manuals, particularly the safety instructions, as well as improper use of the mounting systems.",
        "score": 0.6044228,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOoocNLfDp9HjP2agIxah89HXChuWVBzgxoBsJg0wB-PrU4GIsAZp",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] • The use of shared rails requires precise positioning of the base rails. Mounting Systems strongly recommends the use of appropriate tile roof attachments with adequate adjustability.\n• Mounting Systems recommends fabrication and use of a gauge, such as a length of dowel or PVC pipe, to be used to precisely position and maintain the distance between roof attachments in the N-S direction. [...] Image 1.4.2 Alpha+ Fire Class Rating label and location Mechanical Load Rating (ANSI / UL 1703) The Alpha+ system has been mechanically tested accoding to UL 2703 Edition 1 to the following load ratings: • Downward Pressure: 10 PSF • Upward Pressure: 5 PSF • Down-Slope Load: 5 PSF 1.5 Safety All generally applicable safety regulations for Mounting Systems, Inc. products can be viewed in the General Installation Manual. Please read this document carefully and adhere to the instructions and",
        "score": 0.5363378,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOooogHUon0YFDn8qY7jD7w2U_INPpExkURKv46kr_sYa7jDQsDgQ",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "• Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions. [...] • The use of shared rails requires precise positioning of the base rails. Mounting Systems strongly recommends the use of appropriate tile roof attachments with adequate adjustability.\n• Mounting Systems recommends fabrication and use of a gauge, such as a length of dowel or PVC pipe, to be used to precisely position and maintain the distance between roof attachments in the N-S direction. [...] Image 1.4.2 Alpha+ Fire Class Rating label and location Mechanical Load Rating (ANSI / UL 1703) The Alpha+ system has been mechanically tested accoding to UL 2703 Edition 1 to the following load ratings: • Downward Pressure: 10 PSF • Upward Pressure: 5 PSF • Down-Slope Load: 5 PSF 1.5 Safety All generally applicable safety regulations for Mounting Systems, Inc. products can be viewed in the General Installation Manual. Please read this document carefully and adhere to the instructions and",
        "score": 0.5363378,
        "bucket": "installation"
      },
      {
        "url": "https://files.omron.eu/downloads/latest/manual/en/i624_tm12_and_tm14_series_installation_manual_en.pdf?v=2",
        "title": "[PDF] Medium & Heavy Payload Series Hardware Installation Manual",
        "snippet": "Ensure the strength of the mounting surface and its surround area before installations for upside down mounting and side mounting such as on the ceiling or the",
        "score": 0.5264164,
        "bucket": "installation"
      },
      {
        "url": "https://images.thdstatic.com/catalog/pdfImages/65/65a6b329-89ee-4f4c-ae49-f77d48d703e2.pdf",
        "title": "[PDF] Installation Manual",
        "snippet": "． ． Read this manual extensively before starting up the units.\n． For safety purposes, any unit operators must read the following cautions carefully.\nInstallation must be performed in accordance with the requirement of NEC and CEC, by authorized personnel only.\nThe safety precautions listed here are divided into two categories.\nA WARNING If these warnings are not adhered to, the unit may cause severe property damage, personal injury, or loss of life. [...] ． Connect the 2 wires of the decoration panel to the mainboard of the unit. 5-core wire X 言琶荨 10-core wire ． Fasten the control box lid with 2 screws . 1 2 Decoration Panel Screws (MS)(supplied with the panel) 15 ． Close the intake grille, and slide the 2 grille hooks back.\nD[me]D 7 TEST OPERATION Make sure the control box lids are closed on the indoor and outdoor units.\nRefer to \"For the following items, take special care during construction and check after installation is finished\" on page 2. [...] A WARNING If the base underneath the unit is not strong enough to support the weight of the unit, the unit could fall out of place and cause se「ious injury.",
        "score": 0.39880496,
        "bucket": "installation"
      },
      {
        "url": "https://www.canadiansolar.com/wp-content/uploads/2020/08/Installation_Manual_of_Standard_Solar_Modules_en.pdf",
        "title": "[PDF] INSTALLATION MANUAL OF STANDARD SOLAR MODULES",
        "snippet": "30 | Use four clamps on the long side. Mounting rails run parallel to the long side frame. A1 A1 A1 A1 A1 range = (240 – 330) mm Maximum Load: Uplift load ≤ 2400 Pa Downforce load ≤ 4000 Pa CS1VL-MS, CS1A-MS, CS1HA-MS Use four clamps on the long side. Mounting rails run perpendicularly to the long side frame. Use four clamps on the short side. Mounting rails run parallel to the long side frame. [...] conjunction with fire rated “Type 1” or “Type 4” rated modules, are considered acceptable for use with Canadian Solar Inc. modules, provides the mounting system does not violate any other requirements of this manual. · Any mounting system limitations on inclination or accessories required to maintain a specific System Fire Class Rating should be clearly specified in the installation instructions and UL 2703 certification of the mounting system supplier. [...] A3 range = (80 –380) mm A5 range = (80 –380) mm Maximum Load: Uplift load ≤ 4000 Pa Downforce load ≤ 6000 Pa A4 A4 A4 A4 www.canadiansolar.com | 29 CS1V-MS Use four clamps on the long side. Mounting rails run perpendicularly to the long side frame. Use four clamps on the short side. Mounting rails run parallel to the long side frame.",
        "score": 0.35300484,
        "bucket": "installation"
      },
      {
        "url": "https://www.pluginsolar.co.uk/wp-content/uploads/2023/02/Fastensol-Pitched-Roof-Mounting-Installation-Manual.pdf",
        "title": "[PDF] Fastensol-Pitched-Roof-Mounting-Installation-Manual.pdf",
        "snippet": "x Wind average recurrence interval of 500 years.\nx Wind Terrain Category 2.\nx Shielding and topographic multipliers, Ms and Mt taken as unity.\nx Racks mounted on roofs of enclosed buildings of nominal rectangular shape.\nx Roof slopes from 0 degrees up to 45 degrees from horizontal.\nx Maximum solar panel length of 2.00 metres.\nx Maximum solar panel width of 1.20 metres.\nx Minimum of 2 rails per panel.\nx Maximum panel weight of 15 kilograms per square metre. [...] The tables have been calculated for Australian conditions based on the following criteria:-x Wind Loads are in accordance with AS Code 1170.2:2011.\nx Wind average recurrence interval of 500 years.\nx Wind Terrain Category 2.\nx Shielding and topographic multipliers, Ms and Mt taken as unity.\nx Racks mounted on roofs of enclosed buildings of nominal rectangular shape.\nx Roof slopes from 0 degrees up to 45 degrees from horizontal.\nx Maximum solar panel length of 2.00 metres. [...] $Q\\\u0003DWWHPSW\u0003E\\\u0003DQ\u0003XQTXDOLILHG\u0003SHUVRQ\u0003WR\u0003LQVWDOO\u0003WKLV\u0003 SURGXFW\u0003FRXOG\u0003UHVXOW\u0003LQ\u0003GHDWK\u0003RU\u0003VHULRXV\u0003LQMXU\\\u0011 $6\u00121=6\u0014\u0014\u001a\u0013\u0011\u0015\u001d\u0015\u0013\u0014\u0014 ,W\u0003LV\u0003FULWLFDOO\\\u0003LPSRUWDQW\u0003WKDW\u0003VDIHW\\\u0003SUDFWLFHV\u0003DUH\u0003 REVHUYHG\u0003ZKHQ\u0003LQVWDOOLQJ\u0003 9 'R\u0003QRW\u0003WKURZ\u0003RU\u0003URXJKO\\\u0003KDQGOH\u0003DQ\\\u0003)DVWHQVRO FRPSRQHQWV\u0011 9 'R\u0003 QRW\u0003 EULQJ\u0003 )DVUHQVRO\u0003 V\\VWHP\u0003 LQWR\u0003 FRQWDFW ZLWK\u0003VKDUS\u0003RU\u0003KHDY\\\u0003REMHFWV\u0011 9 'R\u0003QRW\u0003PRGLI\\\u0003UDFH\u0003VRODU\u0003FRPSRQHQWV\u0003LQ\u0003DQ\\ ZD\\\u0011\u0003 7KH\u0003 H[FKDQJH\u0003 RI\u0003 EROWV\u000f\u0003 GULOOLQJ\u0003 RI\u0003 KROHV\u000f EHQGLQJ\u0003 RU\u0003 DQ\\\u0003 RWKHU\u0003 SK\\VLFDO\u0003 FKDQJHV\u0003 QRW GHVFULEHG\u0003",
        "score": 0.29488,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/flat-roof-mounting/resources/brochures/IronRidge_Tilt_Mount_Installation_Manual.pdf",
        "title": "[PDF] xr tilt mount - IronRidge",
        "snippet": "H-BF, H-BF-DG, H-HC, H-HC-BF, H-HC-BF-DG, HC-BF or HC-BF-DG BYD BYD modules with 30 and 35 mm frames BYDxxxAY-ZZ Where \"A\" can be M6, P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or [...] blank, HomePV, Bifacial, M10-SL, M10-SL-BLK, M10 TPC SL, M10 Bifacial, M10 SL-Bifacial, M10 TPC SL Bifacial, M10 NTYP SL or M10 NTYP SL Bifacial HT-SAAE HT-SAAE modules with 35 and 40 mm frames HTyy-aaaZ-xxx Where \"yy\" can be 60, 66, 72 or 78, \"aaa\" can be 18, 156 or 166, \"Z\" can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C, X or X (ND)-F Hyperion Solar (Runergy) Hyperion or Runergy modules with 30 and 35 mm frames HY-DHzzzA8-xxxB Where \"zzz\" can be 108 or 144; \"A\" can be N or P; [...] be blank, HN, HT, MM, SE, SO, SQ , SR, SX, TS, 108, 120 or 144; and \"aa\" can be blank, 0B, 2B, BB, BW, 1J, 4G, 4J, 4S, 4T, 5K, 5R, 5T, 60, 6J, 6S, 6W, 6Z, 8K, 8T, 9R, 9S or 9Z Mitrex Mitrex modules with 30 and 40 mm frames Mxxx-XYZ Where \"X\" can be A, B, I or L; \"Y\" can be 1 or 3; and \"Z\" can be F or H Mitsubishi Mitsubishi modules PV-MYYxxxZZ Where \"YY\" can be LE or JE; and \"ZZ\" can be either HD, HD2, or FB Motech IM and XS series modules with 40 mm frames Navitas Navitas Modules with 35 mm",
        "score": 0.26814866,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/pitched-roof-mounting/resources/brochures/IronRidge_Flush_Mount_Installation_Manual.pdf",
        "title": "[PDF] xr flush mount installation manual - IronRidge",
        "snippet": "P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or TB-AG CertainTeed CertainTeed modules with 30, 35 and 40 mm frames CTBBxxxYZZ-AA Where \"BB\" can be blank or M10; \"Y\" can be M, P, or [...] AP Systems DS3, QS1, QT2 and YC600 Darfon MIG240, MIG300, G320, G640 Duracell D350-M1, D350-M1A-xxx, D400-M1A-xxx, D600-M2A-xxx, D700-M2, D800-M2A-xxx, D1500-M4 Where \"xxx\" can be blank, 208A or 240A Enphase M250-72, 250-60, M215-60, C250-72, S230, S280, IQ 6, IQ 6+, IQ7, IQ 7A, IQ 7+, IQ7 PD, IQ 7X, Q Aggregator; IQ8-60, IQ8PLUS-72, IQ8A-72, IQ8H-208-72, IQ8H-240-72, IQ8M-72, may be followed by -2-US; IQ8H-3P-72-E-US or IQ8P-3P-72-E-US Generac S2502 Hoymiles HMA-xxxYY-ZZ where \"A\" can be blank [...] 156 or 166, \"Z\" can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C, or X Hyperion Solar (Runergy) Hyperion modules with 30 and 35 mm frames HY-DHzzzA8-xxxB Where \"zzz\" can be 108 or 144; \"A\" can be N or P; and \"B\" can be blank or B Hyundai Hyundai modules with 30, 32, 33, 35 and 40 mm frames HiY-SxxxZZ Where \"Y\" can be A, D, N or S; \"S\" can be M, S or T; and \"ZZ\" can be GI, HG, HI, KI, MI, MF, MG, NF(BK), NJ, OJ, PI, RI, RG, RG(BF), RG(BK), SG, TI, TG, YH(BK) or XG(BK) Illuminate",
        "score": 0.25200692,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/groundmounting/brochures/IronRidge_Ground_Mount_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Ground Mount Manual",
        "snippet": "MS, MHBB, or PBB; \"ZZ\" can be 54, 60, 72 or 78; \"AAA\" is the module power rating; and \"bb\" can be 03, 04 or 05 Module Compatibility GROUND MOUNT INSTALLATION MANUAL - 22 © 2025 IRONRIDGE, INC. VERSION 4.5 VSUN VSUN modules with 30, 35 and 40 mm frames VSUNxxxA-YYz-aa Where \"A\" can be blank or N; \"YY\" can be 60, 72, 108, 120, 132, 144; \"z\" can be M, P, MH, PH, or BMH; and \"aa\" can be blank, BB, BW, or DG Waaree Waaree modules with 35 and 40 mm frames AAyy-xxx Where \"AA\" canbe WS or Bi; and \"yy\" [...] H-BF, H-BF-DG, H-HC, H-HC-BF, H-HC-BF-DG, HC-BF or HC-BF-DG BYD BYD modules with 30 and 35 mm frames BYDxxxAY-ZZ Where \"A\" can be M6, P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or [...] be blank, HN, HT, MM, SE, SO, SQ , SR, SX, TS, 108, 120 or 144; and \"aa\" can be blank, 0B, 2B, BB, BW, 1J, 4G, 4J, 4S, 4T, 5K, 5R, 5T, 60, 6J, 6S, 6W, 6Z, 8K, 8T, 9R, 9S or 9Z Mitrex Mitrex modules with 30 and 40 mm frames Mxxx-XYZ Where \"X\" can be A, B, I or L; \"Y\" can be 1 or 3; and \"Z\" can be F or H Mitsubishi Mitsubishi modules PV-MYYxxxZZ Where \"YY\" can be LE or JE; and \"ZZ\" can be either HD, HD2, or FB Motech IM and XS series modules with 40 mm frames Navitas Navitas Modules with 35 mm",
        "score": 0.25046378,
        "bucket": "installation"
      },
      {
        "url": "https://www.tiedown.com/userdocs/pdf/d12.pdf",
        "title": "[PDF] MANUFACTURED HOUSING INSTALLATION MANUAL - Tiedown",
        "snippet": "30 Cross Drive 3611 5417 None 1 vertical only 59664 .75 30 2-4” 3200 4800 None 4a 45 59665 .75 36 1 @6”, 1 @ 4” 3200 4800 None 4a 45 59091 0 719 29 5 2 @ 4\" 3150 4725 7\" Dia Cap 3 45 59092 0 719 34 1 @ 6\" 1 @ 4\" 3150 4725 7\" Dia Cap 4 45 59097 0 75 60 2 @ 4\" 3267 4900 None 2 45 59128 0.75 42 2 @ 4\" 3200 4800 No 59292 4a 45 59086 0 75 47 2 @ 4\" 3200 4800 No 59292 3 45 M12H64 0 719 34 1 @ 6\" 1 @ 4\" 3467 5200 No 59292 4 45 M12H 3/4 0 742 48 1 @ 6\" 3645 5467 No 59292 4 45 MI2H 0 625 48 1 @ 6\" 4045 [...] Step 1 Place Speed Wrench over the bolt head. Insert the strap end into the slot in bolt until flush with opposite side of bolt.\nStep 2 Hold Speed Wrench in place, tighten bolt with socket wrench on outside of Speed Wrench (bolt head side).\nStep 3 Move socket to the opposite (nut) side. Hold Speed Wrench in place. Use socket wrench to tighten nut. [...] 276 to 350 lbs.\n175 to 275 lbs.\n2 Blue Yellow Green Red 1 3 4b C 2 SOI a professional engineer ed il scription y dense and/or cemented ds, coarse gravel, cobbies, oaded silts, clays and coral.\nund hard rock.\ndium dense coarse sands dy gravels very stiff silts clays.\nse to medium dense sands, m to stiff clays and silts, vial fill.\nse sands, firm clays and s, alluvial fill.\n4b 4a 3 + 351 to 550 lbs.\n276 to 350 lbs.\n175 to 275 lbs.\nYellow Green Red 1 3 4b C 2 SOI 4b 4a 276 to 350 lbs.",
        "score": 0.22548524,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Ironridge%20Flush%20Mount%20Installation%20Guide.pdf",
        "title": "[PDF] IronRidge Flush Mount Manual - LA County Public Works",
        "snippet": "35 and 40 mm frames HTyy-156Z-xxx Where “yy” can be 60 or 72, “Z” can be M, P, M-C, P-C, M(S), M(VS), M(V), P(V), M(V)-C, P(V)-C Hyundai Hyundai modules with 33, 35, 40 and 50 mm frames HiY-SxxxZZ Where “Y” can be A, D, M or S; and “ZZ” can be GI, HG, HI, KI, MI, MF, MG, PI, RI, RG, RG(BF), RG(BK), SG, TI, or TG © 2020 IRONRIDGE, INC. VERSION 3.0 FLUSH MOUNT INSTALLATION MANUAL - 23 MODULE COMPATIBILITY Itek Itek Modules with 40 and 50 mm frames IT-xxx-YY Where “YY” can be blank, HE, or SE, or [...] © 2020 IRONRIDGE, INC. VERSION 3.0 FLUSH MOUNT INSTALLATION MANUAL - 2 RATINGS Product markings are located on the Grounding Lug bolt head.\nMARKINGS UL 2703 LISTED • Conforms to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\n• Certified to CSA STD LTR AE-001-2012 Photovoltaic Module Racking Systems. [...] website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death.",
        "score": 0.20400904,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/pitched-roof-mounting/resources/brochures/IronRidge_Aire_System_Installation_Manual.pdf",
        "title": "[PDF] IronRidge Flush Mount Manual",
        "snippet": "the full QM Installation Manual. [...] P6, MH, MLB, MLT, NLB or PH; \"Y\" can be C or K; and \"ZZ\" can be 30 or 36 Canadian Solar Canadian Solar modules with 30, 32, 35 and 40 mm frames CSbY-xxxZ Where \"b\" can be 1, 3, 6, 6.1, 6.2 or 7; \"Y\" can be H, K, L, N, P, R, U, V, W, X, Y, -48TM, -54TM, -66TB or -72TB; and \"Z\" can be H, HP, M, P, T, MS, PX , M-SD, P-AG, P-SD, MB-AG, PB-AG, MS-AG, MS-HL, MS-SD or TB-AG CertainTeed CertainTeed modules with 30, 35 and 40 mm frames CTBBxxxYZZ-AA Where \"BB\" can be blank or M10; \"Y\" can be M, P, or [...] MARKINGS UL 2703 LISTED Conforms to UL STD 2703 Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/ Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels • Scope of Evaluation includes bonding, grounding, mechanical loading, and fire classification • Max Overcurrent Protective Device (OCPD) Rating: 40A • Max Module Size: 30.5 ft² • Module Orientation: Portrait or Landscape • System Design Load Rating: 10 PSF downward, 5 PSF",
        "score": 0.20173493,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Warranty%20Statement.pdf?srsltid=AfmBOor5XKq5HGpsLWrZbJSvuGgPZj3AnRTuF47sggpmu6GCNiZ4o4XF",
        "title": "[PDF] Mounting Systems Warranty Statement - Solaris-shop.com",
        "snippet": "Mounting Systems, Inc. | 820 Riverside Parkway | West Sacramento, CA 95605 Contact: Phone 1 855 731 9996 | jobs@mounting-systems.us | www.mounting-systems.us § 1 Limited Warranty A. Mounting Systems, Inc., hereinafter referred to as “Mounting Systems”, warrants only to its direct customer (“Customer”) that the products listed below (each a “Product” and, collectively, the “Products”), when installed properly in the United States of America or Canada, will be free from defects in workmanship and [...] is 10 years. C. The warranty period for all non-metallic Product components is 2 years. D. Each warranty period commences on the date of delivery of the Product to the Customer. § 3 Procedures in the Event of a Warranty Claim If the Product exhibits defects that are covered under this Limited Warranty, then please promptly contact Mounting Systems Customer Service at (855) 731-9996 or at the address or facsimile number noted below. Please have the following information available when contacting [...] INCIDENTAL DAMAGES ARISING FROM OR OUT OF THE INSTALLATION OR USE OF ANY PRODUCT, OR ANY BREACH OF WARRANTY; WITHOUT LIMITING THE FOREGOING, MOUNTING SYSTEMS SHALL NOT BE LIABLE FOR PERSONAL INJURY, PROPERTY DAMAGE, LOST PROFIT, LOST REVENUE, HARM TO REPUTATION, LOSS OF DATA, ADVERTISING OR MANUFACTURING COSTS, OVERHEAD COSTS, LOST CUSTOMERS, OPERATIONAL DISRUPTIONS OR DOWN-TIME RESULTING FROM THE INSTALLATION OR USE OF ANY PRODUCT OR ANY BREACH OF WARRANTY. Some jurisdictions do not allow the",
        "score": 0.66569364,
        "bucket": "other"
      },
      {
        "url": "https://www.mounting-systems.com/wp-content/uploads/MSY_MA_Pitched-ProLine_EN.pdf",
        "title": "[PDF] Pitched ProLine Installation manual - Mounting Systems",
        "snippet": "This document describes the general applicable information for Mounting Systems products on standardisation, safety, transport, maintenance,.",
        "score": 0.46089602,
        "bucket": "other"
      },
      {
        "url": "https://multimedia.3m.com/mws/media/175699O/flexographic-mounting-system-selection-guide.pdf",
        "title": "[PDF] Balancing solids and dots for customer satisfaction.",
        "snippet": "mils 0.300 0.000 -0.300 -0.600 -0.900 -1.200 mils -1.2 35.1 0.0 0.0 mils 46.9 Easy Mount Adhesive mils 0.300 0.000 -0.300 -0.600 -0.900 -1.200 mils -1.2 35.1 46.9 0.0 0.0 mils Pebbled Liner mils 0.300 0.000 -0.300 -0.600 -0.900 -1.200 mils -1.2 35.1 46.9 0.0 0.0 mils Flat Liner 3 3M™ Flexographic Plate Mounting Systems | Selection Guide Uniform coverage of solids when halftone dot reproduction is not critical.\nWhen plate contains mostly solids in a combination of solid and halftone images. [...] DL: Double Liner E: Air Release, Standard Plate Side Adhesion EH: Air Release, High Plate Side Adhesion K: \u0007 High Sleeve Side Adhesion for Composite Sleeves L: Air Release, Less Removal Force and Plate Damage M: Modified Plate Side Adhesion R: For Rubber Plates S: \u0007 High Sleeve Side Adhesion for Urethane Sleeves 4 3M™ Flexographic Plate Mounting Systems | Selection Guide 3M™ Flexographic Plate Mounting Systems Selection Guide Product Number Application Thickness Inches (mm) Manufactured Target [...] Description 9913 2-hole Spreader (1/4\" hole span) 9916 3-hole Spreader 9921 .090\" Fluted Tip 9922 .063\" Fluted Tip 9940 .125\" Fluted Tip 9725 .072\" Mini Extension Tip 9785 .070\" Tapered Aluminum Extension 9916 9913 9785 9725 9922 9940 9921 1 7 3M™ Flexographic Plate Mounting Systems | Selection Guide Plate Edge Sealing (cont.) Multiple options with 3M™ Single Coated Tapes 3M™ Aluminum Foil Tape 425, 3M™ Vinyl Tape 471 or 3M™ Polyester Film Tape 850 are pressure sensitive adhesive tapes that",
        "score": 0.3891524,
        "bucket": "other"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Installation%20Guide.pdf?srsltid=AfmBOoquAUzFWGTDflE55YRRdy0m9Gxv5cGZ2n8YhxT7RGznh6pSASvw",
        "title": "[PDF] Alpha+ On-Roof System Installation Manual - Solaris-shop.com",
        "snippet": "21 Alpha+ Installation Manual i NOTE!\nThe use of shared rails requires precise positioning of the base rails. Mounting Systems, Inc. strongly recommends the use of roof attachments with adequate adjustability.\nMounting Systems recommends fabrication and use of a gauge such as a length of dowel or PVC pipe to be used to precisely position and maintain the distance between roof attachments in the N-S direction. [...] 3 Appendix B and Appendix C on Monuting Systems' roof hooks can be found on Mounting Systems' website: [...] • Determine the rafter or purlin locations and mark them on the E-W chalk lines.\n• For standard 2- or 3-rail installations, if you are using Mounting Systems, Inc. flashings, install them at the above marked locations per the instructions in the MS Flashing Installation Manual, which can be found on Mounting Systems' website.2 For other mounting/ flashing products, install per the manufacturer’s installation instructions.",
        "score": 0.37779367,
        "bucket": "other"
      },
      {
        "url": "https://plp.com/id/images/pdfs/solar/SL-ML-1034-11P-2019_SolPwrRailCat.pdf",
        "title": "[PDF] PV Solar Roof and Structure Mounting Systems - PLP",
        "snippet": "84\" Standard Lengths Length 84\" Weight Per Unit (lbs.) 2.67 Part # Finish Price P4-84 Mill 22.05 P4-84-BA Black 29.77 P4-84-CA Clear 25.36 Power Rail P4 – Extrusion 126\" Standard Lengths Length 126\" Weight Per Unit (lbs.) 4.00 Part # Finish Price P4-126 Mill 33.60 P4-126-BA Black 45.36 P4-126-CA Clear 38.64 162\" Standard Lengths Length 162\" Weight Per Unit (lbs.) 5.15 Part # Finish Price P4-162 Mill 42.00 P4-162-BA Black 56.70 P4-162-CA Clear 48.30 204\" Standard Lengths Length 204\" Weight Per [...] Unit (lbs.) 6.48 Part # Finish Price P4-204 Mill 51 .98 P4-204-BA Black 70.17 P4-204-CA Clear 59.78 242\" Standard Lengths Length 242\" Weight Per Unit (lbs.) 7 .60 Part # Finish Price P4-242 Mill 59.85 P4-242-BA Black 80.80 P4-242-CA Clear 68.83 282\" Standard Lengths Length 282\" Weight Per Unit (lbs.) 8.95 Part # Finish Price P4-282 Mill 69.56 P4-282-BA Black 93.91 P4-282-CA Clear 80.00 324\" Standard Lengths Length 324\" Weight Per Unit (lbs.) 10.29 Part # Finish Price P4-324 Mill 78.75 P4-324-BA [...] Part # Description Weight Per Unit (lbs.) Price FF5 5˚ Front Foot 0.25 7 .35 BF5 5˚ Back Foot 0.50 11 .55 FF10 10˚ Front Foot 0.25 7 .35 BF10 10˚ Back Foot 0.75 15.75 Tilted \"L\" Feet \"L\" Feet \"L\" Feet are fabricated from high-strength 3/16\" aluminum and include a vertical slot for adjusting to irregular surfaces. 5/16\" coated hardware included.",
        "score": 0.33222425,
        "bucket": "other"
      },
      {
        "url": "https://www.solar-electric.com/lib/wind-sun/Tamarack-Mount-Brochure.pdf?srsltid=AfmBOoodC3S6D2Ox_wPreDnj4EeE4RcPggvlyBBn7b8jVxPZ0vI6Xp4z",
        "title": "[PDF] Tamarack Solar Products",
        "snippet": "sales@tamaracksolar.com 800-819-7236 LEGACY UNI-SERIES TOP OF POLE Tamarack Solar Products Top of Pole Mounts are a heavy duty mounting system ideal for single pole, multi panel arrays. Originally designed for 80W BP mod- ules, these mounts accomodate a wide variety of smaller 12V and 24V modules with ease. - Uses either 4” or 6” Schedule 40 poles, (not included) - Fits multiple modules in single or dual column configurations, rails are 45” - 110” - Manufactured using powder coated steel and [...] included - Can be used as an awning structure, flat roof install, or ground mount Mounts can also accommodate variable ground heights to create a consistent level install due to adjustability in leg length. Great for use in off-grid remote applications, on flat roofed structures such as shipping containers, sheds and awning structures. This mount is a simple and comprehensive solution for small area solar photovoltaic (PV) needs or larger commercial installs. Mounts can also accommodate [...] sales@tamaracksolar.com 800-819-7236 Tamarack Solar Products UNI-SERIES SINGLE ARM Our Single Arm Mount is a simple mounting solution for poles, walls and other flat surfaces. This incredibly versatile mount has been used on the sides of shipping containers, buildings, as an awning, or mounted to just about any flat surface. - Mounts to poles of 2” to 4” diameter, Schedule 40 (not included) - Accommodates module widths between 5.26 and 25.5 inches - Manufactured using heavy-duty",
        "score": 0.18719247,
        "bucket": "other"
      },
      {
        "url": "https://www.stihlusa.com/WebContent/CMSFileLibrary/InstructionManuals/STIHL-MS-170-180-Owners-Instruction-Manual.pdf",
        "title": "[PDF] STIHL MS 170, 180 Owners Instruction Manual",
        "snippet": "Engineering Improvements STIHL’s philosophy is to continually improve all of its products. As a result, engineering changes and improvements are made from time to time. Therefore, some changes, modifications and improvements may not be covered in this manual. If the operating characteristics or the appearance of your machine differs from those described in this manual, please contact your STIHL dealer or the STIHL distributor for your area for assistance. [...] WARNING An improperly mounted or damaged cylinder housing or a damaged/deformed muffler shell may interfere with the cooling process of the muffler. To reduce the risk of fire or burn injury, do not continue work with a damaged or improperly mounted cylinder housing or a damaged/deformed muffler shell. [...] If this chain saw is subjected to unusually high loads for which it was not designed (e. g. heavy impact or a fall), always check that it is in good condition before continuing work. Check in particular that the fuel system is tight (no leaks) and that the controls and safety devices are working properly. Do not continue operating this chain saw if it is damaged. In case of doubt, have it checked by your STIHL servicing dealer.",
        "score": 0.13856693,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "mounting-systems",
    "product": "Mounting Systems MS-TILT",
    "candidates": [
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOoqjegw2fPqdqrjeCy9BXR4_OsjXIzrKoQJihosr7Gu-_o0ggvsV",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] with 32, 35, 40, and 42mm frames aaYY-ZZ-xxx where \"aa\" can be Q. or B.; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/ TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/ SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately.",
        "score": 0.5962692,
        "bucket": "datasheets"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOorDzC4gqn5AvB2V6xSvYesQOWtmOk-U5ApG83yLG_NbhsGaMf2j",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] with 32, 35, 40, and 42mm frames aaYY-ZZ-xxx where \"aa\" can be Q. or B.; \"YY\" can be PLUS, PRO, PEAK, LINE PRO, LINE PLUS, PLUS DUO or PEAK DUO; and \"ZZ\" can be G3, G3.1, G4, G4.1, L-G2, L-G2.3, L-G3, L-G3.1, L-G3y, L-G4, L-G4.2, L-G4y, LG4.2/ TAA, BFR-G3, BLK-G3, BFR-G3.1, BLK-G3.1, BFR-G4, BFR-G4.1, BFR G4.3, BLK-G4.1, G4/SC, G4.1/SC, G4.1/TAA, G4.1/MAX, BFR G4.1/TAA, BFR G4.1/MAX, BLK G4.1/TAA, BLK G4.1/SC, EC-G4.4, G5, G5/ SC, G5/TS, BLK-G5, BLK-G5/SC, BLK-G5/TS, L-G5, L-G5.1, L-G5.2, [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately.",
        "score": 0.5962692,
        "bucket": "datasheets"
      },
      {
        "url": "https://files.ironridge.com/flat-roof-mounting/resources/brochures/Tilt_Mount_Data_Sheet.pdf",
        "title": "[PDF] Tilt Mount System - IronRidge",
        "snippet": "Datasheet Trust your system at every angle.\nThe IronRidge Tilt Mount System supports a wide range of solar module tilting angles, while also resisting the extreme wind and snow forces experienced over a building’s lifetime. [...] • Integrated bonding • No tools or hardware • Self-centering stop tab Grounding Lugs Connects Tilt Mount system to equipment ground.\n• Low profile • Single tool installation • Mounts in any direction Ends Caps & Wire Clips Provide a finished look and organize electrical wires.\n• Simple snap-in installations • Clips hold up to ten 5mm wires • UV-stabilized polymer UFOs Universal Fastening Objects secure and bond modules to rails. [...] Tilt Mount System Roof Friendly Lightweight and compatible with industry-standard attachments.\nPE Certified Pre-stamped engineering letters available in most states.\nStrength Tested All components evaluated for superior structural performance. Design Assistant Online software makes it simple to create, share, and price projects. UL 2703 Listed System Meets newest effective UL 2703 standard.\n25-Year Warranty Products guaranteed to be free of impairing defects.",
        "score": 0.5663309,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.enerack.com/uploadfile/downloads/2025%20Enerack%20Solar%20Mounting%20System%20Catalog.pdf",
        "title": "[PDF] 2025 Enerack Solar Mounting System Catalog.pdf",
        "snippet": "Stainelss steel 304 Anodized Landscape Ballasted-ULT Mounting Technical features: Product name Application Tilt System Material Fastener material Finish Module orientation Ballasted-ULT Series Concrete flat roof and trapezoidal sheet metal roof 10°or 15° Extruded aluminum profile 6005 T5, EPDM Stainless steel 304 Anodized Landscape 47 48 Assembly 1 Assembly 2 ERK-BUF-10 ERK-BUF-15 ERK-BST-02 ERK-SFR-04 ERK-R41-02 ERK-BUR-10 ERK-BUR-15 Enerack East & West Ballasted-Ult\u0000Systems suitable for [...] parts are made of extruded aluminum, with stainless steel 304 fasteners EPDM foam tape is installed at the bottom of the system, separated the roof and system. EPDM foam tape provides better friction and compensates for the height difference when the roof is uneven. 10 or 15 Degree tilt Technical features: Product name Application Tilt System Material Fastener material Finish Module orientation 1 2 3 4 ERK-FEC ERK-BPF15 ERK-BPR15 S 10 or 15 Flat roof 10°or 15° extruded aluminum profile 6005 T5 [...] East & West 10° for concrete flat roof South or North 10° for concrete flat roof South or North 10° for trapezoidal sheet metal roof ERK-EFT-03 Ballasted-Ult East-West Integrated Rear Leg Assembly ERK-BUR-10 ERK-BUR-15 ERK-SFR-04 ERK-BST-02 ERK-R41-02 ERK-EFT-03 ERK-BIR-10 ERK-BIR-15 Assembly Product name Application Tilt System material Fastener material Finish Module orientation Ballasted-Ult East-West integrated rear leg Concrete flat roof or trapezoidal sheet metal roof 10°or 15° AL6005-T5,",
        "score": 0.55998856,
        "bucket": "datasheets"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/QuickMount%20PV%20Quick%20Rack%20Installation%20Guide.pdf",
        "title": "[PDF] Rail Mounting System - LA County Public Works",
        "snippet": "e Distance between the modules = 17mm (11/16 in) f Distance between module rows = 0.25 in. minimum, no maximum distance provided gap does not result in snow damming DANGER Risk of fatal injury due to falling. Falling from the roof can result in serious injuries or death.\n• Please wear and use proper protective equipment.\n• Secure yourself against falling.\n• Do not perform any work in strong winds. [...] a Height of the module field: Number of modules vertically x module length (+ any clearances) b Width of the module array: Using standard end clamps : [number of modules horizontally x module width] + [number of 17mm (11/16in) module gaps] + [2 x 1.2 in (30.5mm) to account for rail extending beyond modules]. Using hidden end clamp: [number of modules horizontally x module width] + [number of 17mm (11/16 in) module gaps]. [...] JKMxxxPP-72-V, JK- MxxxM-72, JKMxxxM-72B, JKMxxxM-72B-J4, JKMxxxM-72-J4, JKMxxxM-72-V, MX JKMSxxxPP-72 JKMxxxM - 60BL, JKMxxxM - 60HBL, JKMxxxM - 72L - V, JKMxxxM - 72HL - V, JKMxxxM-72HL-TV, JKMSxxxM-72HL-V-MX3, JKMSxxxM-60HBL-EP (AC Module) WHERE B = null or B; L = null or L; H = null or H; V= null or V LG LGxxxF1G-A5, LGxxxF2G-A5,LGxxxQ1G-A5, LGxxxF1G-V5, LGxxxF2G-V5, LGxxxQ1G-V5, LGxxxN2T-J5, LGxxxA1C-V5 Note: F = E, N, S; G = any letter in the alphabet LONGi LR6-60A-XXXM, LR6-72A-XXXM,",
        "score": 0.40867847,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.renusol.com/files/content/Downloads/Datenbl%C3%A4tter/MS/20231030_EN_MS%2B_System%20Datasheet.pdf",
        "title": "[PDF] System Datasheet - MS+ - Renusol",
        "snippet": "manufacturer released Roof types Trapezoidal sheet metal roof and corrugated sheet metal roof made of steel and aluminium Sandwich plate according to manufacturer‘s approval Metal sheet thickness Steel: 0.4-1.25mm / Aluminum: 0.5-2 mm Roof slope min. 3°/max. 75° System properties Module tilt Roof paralell Material Stainless steel, aluminum and EPDM Modules Type PV-modules with frame height between 30-50 mm Module size (max) Length: unlimited; Width: unlimited Module guidance Vertical/Portrait [...] MS+ EN | Renusol System Datasheet Misprints and errors, technical or other changes and changes in the availability of products are expressively reserved MS+ 30.10.2023 General System PV-Mounting system for metal sheet roofs Content Mounting bracket, fastening elements, module clamps System warranty 10 years Application area Pitched metal sheet roofing (except hydrogen sulfide exposition) Roof covering Trapezoidal metal sheet made of steel and aluminum Sandwich trapezoidal sheet according to [...] Certifications TÜV ID1111212485 according to 2PfG Building authority approval Z-14.1-4, Z-14.1-537 (Fastening material) Water thightness MFPA 5.1/10-535 MCS012 IK0197/02 Issue: 04 ETN BT120019 Services PV layout Provided by Renusol System Datasheet 1/1",
        "score": 0.38539833,
        "bucket": "datasheets"
      },
      {
        "url": "https://static.solartricity.ie/wp-content/uploads/2020/01/Renusol-MS-datasheet.pdf",
        "title": "[PDF] Renusol System Datasheet MS+",
        "snippet": "trapezoidal sheet according to manufacturer release Metal sheet thickness Steel: 0.4 - 2.0 mm / Aluminum: 0.5 - 2.0 mm Roof slope min. 5°, max. 45° System properties Module tilt Roof paralell Material Stainless steel, Aluminium and EPDM (pre-attached) Modules Type PV-Modules with frame height from 30 to 50 mm Module size (max) Length: unlimited, Width: unlimited Orientation Horizontal/Landscape Certifications MCS012 IK0197/02 Issue: 04 Water thightness MFPA 5.1/10-535 TÜV ID1111212485 according [...] 1/1 MS+ Renusol System datasheet MS+ | 09/2019 Misprints and errors, technical or other changes and changes in the availability of products are expressively reserved System Datasheet General System PV-Mounting system for metal sheet roofs Content 12.5 cm Mounting bracket, fastening material , module clamps System warranty 10 years Application area Pitched metal sheet roof (except hydrogen sulfide exposition) Roof covering Trapezoidal and corrugated metal sheet made of steel and aluminum Sandwich [...] to 2PfG ETN BT120019 Building authority approval ETA-13-0255, Z-14.1-181, Z-14.1-4, Z-14.1-537 (Fastening material) Services PV layout Provided by Renusol",
        "score": 0.29497138,
        "bucket": "datasheets"
      },
      {
        "url": "https://cdn.prod.website-files.com/656404ff3a4863a2cee9d509/65ea6ccb003d4ca98adac937_Clenergy-PV-ezRack-SolarRoof-Penetrative-Tilt-Legs-Installation-Guide-V5.0.pdf",
        "title": "[PDF] PV-ezRack® SolarRoofTM Tilt Legs Installation Guide",
        "snippet": "items: - Mounting system components, including the fixings, capacity and rail deflection. - Buildex 14 - 11 x 70 Hex Head Zips Climaseal 3 with 16 mm Aluminium Bonded Washer. - A different screw can be used if the pullout capacity is equal or greater than the above Buildex screw. Note 3. This document does not cover the following: - Building frame capacity It has been assumed that the building frame will be able to resist the additional loadings imposed by the installation of the solar panels [...] in conjunction with the Clenergy mounting system. Note 4. Roof pitch between 1° and 10°. Note 5. Fixing spacings were calculated using two screws per tilt leg on Steel Purlins G450 1.5mm and 35 mm Timber F7 (Pine). Note 6. For installation with one screw per tilt leg on 1.5 mm and 1.9 mm steel purlins G450, all spacings shall be reduced as follows: Wind Region One screw reduction factor (%) α < 10° 10° < α < 15° 15° < α < 20° 20° < α < 25° 25° < α < 30° α = 30° 30° < α < 60° A 0 0 0 0 0 0 0 B [...] 908 266 403 533 666 194 292 389 583 D 354 536 708 885 319 483 637 797 226 342 451 564 212 322 425 531 155 232 310 465 Angle against horizontal - 10° < α < 15° Wind Region Building Height (m) H < 5 5 < H < 10 10 < H < 15 15 < H < 20 20 < H < 30 Corner Edge Intermediate Internal Corner Edge Intermediate Internal Corner Edge Intermediate Internal Corner Edge Intermediate Internal Corner Edge Intermediate Internal A 648 982 1297 1588 583 884 1167 1459 545 825 1089 1361 459 696 919 1149 355 532 709",
        "score": 0.2808658,
        "bucket": "datasheets"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOooEAhyiW2U3L_8ezz-1FMhWZBx7D38SGsOOiAIXCyAAb437Xf9E",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] COMPATIBILITY\b 13-17 FRAMLESS MODULE COMPATIBILITY\b 18 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death. [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately.",
        "score": 0.69274646,
        "bucket": "installation"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOor3Ndx89M6IYCZJSuIS9QAhJ0pOYybNl_6iQuALk4IK0auDmszN",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately. [...] COMPATIBILITY\b 13-17 FRAMLESS MODULE COMPATIBILITY\b 18 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death.",
        "score": 0.65940565,
        "bucket": "installation"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOooHIShPHNQvll3jvDybdnuFnr7Z6CCSZx8oahG7cWc5h2B1kB7w",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately. [...] COMPATIBILITY\b 13-17 FRAMLESS MODULE COMPATIBILITY\b 18 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death.",
        "score": 0.65940565,
        "bucket": "installation"
      },
      {
        "url": "https://assets.unilogcorp.com/2/ITEM/DOC/Ironridge_TM_FTL_010_Manual.pdf",
        "title": "[PDF] IronRidge Roof Mount Manual - Unilog",
        "snippet": "INSTALLATION MANUAL TILT MOUNT Contents TILT MOUNT INSTALLATION MANUAL - 1 © 2017 IRONRIDGE, INC. VERSION 1.40 DISCLAIMER\b 1 RATINGS\b 2 MARKINGS\b 2 CHECKLIST\b 3 1. ATTACH BASES\b 4 2. ADD TILT LEGS\b 4 3. PLACE RAILS\b 5 4. SECURE LUGS\b 5 5. SECURE MODULES\b 6 EXPANSION JOINTS\b 7 ELECTRICAL DIAGRAM\b 7 ELECTRICAL DIAGRAM (CONTINUED)\b 8 END CAPS\b 8 WIRE CLIPS\b 8 MICROINVERTER KITS\b 9 SYSTEMS USING ENPHASE MICROINVERTERS\b 9 FRAMELESS MODULE KITS\b 9 MODULE COMPATIBILITY\b 10 WARRANTY\b 12 This manual [...] COMPATIBLE PRODUCTS Enphase M250-72, M250-60, M215-60, C250-72, S230, S280, IQ 6, IQ 6 PLUS, Q Aggregator Darfon MIG240, MIG300, G320, G640 Solar Edge P300, P320, P400, P405, P600, P700, P730, P800p, P800s TILT MOUNT INSTALLATION MANUAL - 10 © 2017 IRONRIDGE, INC. VERSION 1.40 MODULE COMPATIBILITY The Tilt Mount System may be used to ground and/or mount a PV module complying with UL 1703 only when the specific module has been evaluated for grounding and/or mounting in compliance with the [...] LG Modules with 35, 40, and 46mm frames and model identifier LGxxxYaZ-bb; where \"Y\" is A, E, N, Q, S; \"a\" is 1 or 2; \"Z\" is C, K, T, or W; and \"bb\" is A3, A5, B3, G3, G4, or K4.\nTILT MOUNT INSTALLATION MANUAL - 11 © 2017 IRONRIDGE, INC. VERSION 1.40 MODULE COMPATIBILITY MAKE MODELS Mission Solar Modules with 40mm frames with model identifier MSExxxZZaa; where \"ZZ\" is SO or SQ, and \"aa\" is 4J, 4S, 5K, 5T, 6J, 6S, or 6W.",
        "score": 0.6496014,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Ironridge%20Tilt%20Mount%20Installation%20Guide.pdf",
        "title": "[PDF] Ironridge Tilt Mount Installation Guide.pdf - LA County Public Works",
        "snippet": "INSTALLATION MANUAL TILT MOUNT Contents TILT MOUNT INSTALLATION MANUAL - 1 © 2020 IRONRIDGE, INC. VERSION 2.7 DISCLAIMER\b 1 RATINGS\b 2 MARKINGS\b 2 CHECKLIST\b 3 1. ATTACH BASES\b 4 2. ADD TILT LEGS\b 4 3. PLACE RAILS\b 5 4. SECURE LUGS\b 5 5. SECURE MODULES\b 6 CAMO\b 7 EXPANSION JOINTS\b 8 ELECTRICAL DIAGRAM\b 9 END CAPS\b 10 WIRE CLIPS\b 10 SYSTEMS USING ENPHASE MICROINVERTERS OR SUNPOWER AC MODULES\b 10 MICROINVERTER KITS\b 11 SYSTEMS USING MICROSTORAGE PRODUCTS\b 11 FRAMELESS MODULE KITS\b 12 MODULE [...] COMPATIBILITY\b 13-17 FRAMLESS MODULE COMPATIBILITY\b 18 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death. [...] (Version 1.10).",
        "score": 0.60245985,
        "bucket": "installation"
      },
      {
        "url": "https://3415913.app.netsuite.com/core/media/media.nl?id=2486046&c=3415913&h=fe27ea30b80b92667967&_xt=.pdf",
        "title": "[PDF] IronRidge Roof Mount Manual - NetSuite",
        "snippet": "INSTALLATION MANUAL. TILT MOUNT. Page 2. CONTeNTS. TILT MOUNT INSTALLATION MANUAL - 1. © 2019 IRONRIDGE, INC. VERSION 1.90. DISCLAIMeR. 1. RATINGS. 2. MARKINGS.",
        "score": 0.5900477,
        "bucket": "installation"
      },
      {
        "url": "https://www.mizarimaging.com/wp-content/uploads/2020/04/Tilt-Manual.pdf",
        "title": "[PDF] Tilt-Manual.pdf - Mizar Imaging",
        "snippet": "1.1 Remove existing microscope stage The Tilt replaces your existing microscope stage. To remove your existing stage, remove the screws securing it to the stand and lift the stage up. 1.2 Install stage adapters (if needed) Use the provided screws to attach the provided stage adapters. Note that certain stands require only spacers for mounting the Tilt. [...] 3 – Installation Installation of the Tilt must only be performed by a trained service professional. Improper setup may impair performance of the Tilt and can result in unsafe exposure laser light.\n4 – Removal, Modification, and Repair Do not attempt to remove or disassemble any part of the Tilt. Any modifications or at-tempts to repair this product can result in unsafe exposure to laser light. Please contact Mizar Imaging if the Tilt requires service. [...] 1.5 Install the safety features Attach the Fiber Cover, Light Trap, and Laser Shield with the provided hardware.",
        "score": 0.585789,
        "bucket": "installation"
      },
      {
        "url": "https://files.ironridge.com/flat-roof-mounting/resources/brochures/IronRidge_Tilt_Mount_Installation_Manual.pdf",
        "title": "[PDF] xr tilt mount - IronRidge",
        "snippet": "P300, P320, P340, P370, P400, P401, P405, P485, P505, P600, P700, P730, P750, P800p, P800s, P801, P850, P860, P950, P960, P1100, P1101, S440, S500, S500B, S650B, S1200, S1201, U650 and U650B Tigo Tigo Access Point (TAP) TS4-R-X (where X can be F, M, O, or S) TS4-R-X-DUO (where X can be M, O, or S) TS4-A-X (where X can be F, 2F, O, O-DUO, or S) Yotta DPI 208/480 End Caps (Optional) TILT MOUNT INSTALLATION MANUAL - 13 © 2025 IRONRIDGE, INC. VERSION 4.4 MODULE COMPATIBILITY The Tilt Mount System [...] MS, MHBB, or PBB; \"ZZ\" can be 54, 60, 72 or 78; \"AAA\" is the module power rating; and \"bb\" can be 03, 04 or 05 module compatibility TILT MOUNT INSTALLATION MANUAL - 20 © 2025 IRONRIDGE, INC. VERSION 4.4 VSUN VSUN modules with 30, 35 and 40 mm frames VSUNxxxA-YYz-aa Where \"A\" can be blank or N; \"YY\" can be 60, 72, 108, 120, 132, 144; \"z\" can be M, P, MH, PH, or BMH; and \"aa\" can be blank, BB, BW, or DG Waaree Waaree modules with 35 and 40 mm frames AAyy-xxx Where \"AA\" canbe WS or Bi; and \"yy\" [...] TILT MOUNT INSTALLATION MANUAL - 6 © 2025 IRONRIDGE, INC. VERSION 4.4 5. SECURE MODULES A. SECURE FIRST END Place first module in position on rails, a minimum of 1” from rail ends. Snap Stopper Sleeves onto UFO. Fasten the module to the rail with the UFO or EFO, ensuring that the clamp is hooked over the top of the module. Torque to 80 in-lbs. ►Ensure rails are square before placing modules. ►Hold Stopper Sleeves on end while torquing to prevent rotation. ►If using CAMO instead of UFO + Stopper",
        "score": 0.5829428,
        "bucket": "installation"
      },
      {
        "url": "https://dpw.lacounty.gov/bsd/lib/fp/Small%20Residential%20Rooftop%20Solar%20Energy%20Systems/LA%20County%20Recognized%20UL%202703%20Racking%20Systems/Unirac%20SM%20SolarMount%20Installation%20Guide.pdf",
        "title": "[PDF] Unirac SM SolarMount Installation Guide.pdf",
        "snippet": "Manufacturer Series/Model Aleo P18, P19 AU Optronics (BenQ Solar) PM Series Auxin AXN6M610T, AXN6P610T, AXN6M612T & AXN6P612T Axitec AXIpower, AXIpremium, AXIblackpremium Boviet BVM6610 & BVM6612 Series Canadian Solar CS5A-M, CS6P-M, CS6P-P, CS6X-P, CSX-P, ELPS CS6P-MM, ELPS CS6A-MM, CS6U-P, CS6U-M, CS6K-MS, CS6K-M, CS6K-P, CS3U-P, CS3U-MS, CS3K-P, CS3K-MS, CS1K-MS, CS3W-P, CS3L-P, CS3K-MB, CS3K-PB, CS3U-MB, CS3U-PB, CS3U-MS, CS3U-P, CS3K-MS, CS3K-P, CS6U-P, CS6K-MS, CS6K-P Centrosolar America [...] INSTALLATION (IF REQUIRED PER SYSTEM DESIGN) If your installation uses SOLARMOUNT splice bars, attach the rails together before mounting to the L-feet / footings. Use splice bars only with flush installations or those that use low-profile tilt legs. A rail can be supported by more than one footing on both sides of the splice. There should be a gap between rails, up to 3/16\" at the splice connections. To install, slide T-feature on splice into the T-slot on each rail, centering the splice [...] anodized, or dark anodized.",
        "score": 0.30489007,
        "bucket": "installation"
      },
      {
        "url": "https://ecofastensolar.com/wp-content/uploads/2021/11/ClickFit_InstallGuide_v2.6_Addendum_v1.1_COMBINED.pdf",
        "title": "[PDF] INSTALLATION GUIDE - EcoFasten Solar",
        "snippet": "VERSION: v2.6 REVISION DATE: 10/11/21 INSTALLATION GUIDE OVERVIEW PAGE 04 OVERVIEW The ClickFit mounting system consists of patented adjustable tile hooks and L feet, rails, and the installation materials required for the mounting of photovoltaic modules on composition shingle or tile roofs. For simplicity, tile hooks and L feet will be referred to as “attachments”. [...] FEATURES • Tool and fastener free rail attachment • Fully integrated bonding • Click-on Mid & End Clamps • Compatible with a variety of EcoFasten roof attachments VERSION: v2.6 REVISION DATE: 10/11/21 INSTALLATION GUIDE INTRODUCTION PAGE 03 INTRODUCTION This manual describes the installation of the ClickFit mounting system for photovoltaic modules on steep-slope roofs. Described within are details for composition shingle and tile, attachments for ClickFit System. Other roof types as well as all [...] L-FOOT STANDARD RAIL The components referenced in this addendum conform to STD UL 2703 (2015) Standard for Safety First Edition: Mounting Systems, Mounting Devices, Clamping/Retention Devices, and Ground Lugs for Use with Flat-Plate Photovoltaic Modules and Panels.\nPAGE 02 VERSION: v1.1 REVISED: 06/07/21 INSTALLATION GUIDE ADDENDUM INSTALLATION FLASHING AND L-FOOT Installation of Flashing and L-Foot • ClickFit for comp shingle roofs uses EcoFasten Solar’s GF-1 watertight flashing system.",
        "score": 0.2709838,
        "bucket": "installation"
      },
      {
        "url": "https://www.solaris-shop.com/content/Mounting%20Systems%20Warranty%20Statement.pdf?srsltid=AfmBOorm1HcwAwuMXI94QNc4935ONXWUBICbsZ1H8neUZLKcwrxG9-T5",
        "title": "[PDF] Mounting Systems Warranty Statement - Solaris-shop.com",
        "snippet": "Mounting Systems, Inc. | 820 Riverside Parkway | West Sacramento, CA 95605 Contact: Phone 1 855 731 9996 | jobs@mounting-systems.us | www.mounting-systems.us § 1 Limited Warranty A. Mounting Systems, Inc., hereinafter referred to as “Mounting Systems”, warrants only to its direct customer (“Customer”) that the products listed below (each a “Product” and, collectively, the “Products”), when installed properly in the United States of America or Canada, will be free from defects in workmanship and [...] is 10 years. C. The warranty period for all non-metallic Product components is 2 years. D. Each warranty period commences on the date of delivery of the Product to the Customer. § 3 Procedures in the Event of a Warranty Claim If the Product exhibits defects that are covered under this Limited Warranty, then please promptly contact Mounting Systems Customer Service at (855) 731-9996 or at the address or facsimile number noted below. Please have the following information available when contacting [...] INCIDENTAL DAMAGES ARISING FROM OR OUT OF THE INSTALLATION OR USE OF ANY PRODUCT, OR ANY BREACH OF WARRANTY; WITHOUT LIMITING THE FOREGOING, MOUNTING SYSTEMS SHALL NOT BE LIABLE FOR PERSONAL INJURY, PROPERTY DAMAGE, LOST PROFIT, LOST REVENUE, HARM TO REPUTATION, LOSS OF DATA, ADVERTISING OR MANUFACTURING COSTS, OVERHEAD COSTS, LOST CUSTOMERS, OPERATIONAL DISRUPTIONS OR DOWN-TIME RESULTING FROM THE INSTALLATION OR USE OF ANY PRODUCT OR ANY BREACH OF WARRANTY. Some jurisdictions do not allow the",
        "score": 0.6922474,
        "bucket": "other"
      },
      {
        "url": "https://cdn.msisurfaces.com/files/flyers/everlife-lvt-warranty-1.pdf",
        "title": "[PDF] WARRANTY",
        "snippet": "Buyer acknowledges and agrees that the foregoing conditions and limitations are an essential basis for Buyers agreement with MSI. Any suit or other legal action that the Buyer may bring against MSI arising out the sale of this tile must be filed within 30 days from the date of MSI’s alleged breach. Buyer’s failure to file within this stipulated period shall be deemed to act as waiver and time bar for any and all claims against M S International Inc. [...] Buyer acknowledges and agrees that the foregoing conditions and limitations are an essential basis for Buyers agreement with MSI. Any suit or other legal action that the Buyer may bring against MSI arising out the sale of this tile must be filed within 30 days from the date of MSI’s alleged breach. Buyer’s failure to file within this stipulated period shall be deemed to act as waiver and time bar for any and all claims against M S International Inc. [...] L ’acheteur reconnaît et accepte que les conditions et limitations précédentes constituent une base essentielle pour l’accord de l’acheteur avec MSI. Toute poursuite ou autre action en justice que l’acheteur pourrait intenter contre MSI suite à la vente de cette tuile doit être déposée dans les 30 jours suivant la date de la violation présumée de MSI. L ’omission de l’acheteur de déposer dans ce délai stipulé sera considéré comme une renonciation et une prescription pour toute réclamation",
        "score": 0.6296157,
        "bucket": "other"
      },
      {
        "url": "https://images.thdstatic.com/catalog/pdfImages/f9/f9c38b12-59f7-4fb6-87a2-a5dba8fa6ce7.pdf",
        "title": "[PDF] ONE YEAR LIMITED WARRANTY STATEMENT",
        "snippet": "This warranty will not cover – • Damage from customer misuse including negligence, physical, or chemical abuse • Defect due to installation • Variation in technical specifications are inherent due to variability in the raw materials and production process.\nMSI does not warrant product installations that violate building codes. Local building codes may dictate minimum tile performance specifications. [...] EXCEPT AS EXPRESSLY SET FORTH IN THIS WARRANTY, MSI MAKES NO OTHER WARRANTIES EXPRESSED OR IMPLIED, INCLUDING ANY IMPLIED WARRANTIES OR MERCHANTABILITY AND FITNESS FOR A PARTICU-LAR PURPOSE. MSI EXPRESSLY DISCLAIMS ALL WARRANTIES NOT STATED IN THIS LIMITED WARRANTY. ANY IMPLIED WARRANTIES THAT MAY BE IMPOSED BY LAW ARE LIMITED TO THE TERMS OF THIS EXPRESS LIMITED WARRANTY Implied Warranty of Fitness for a Particular Purpose Appropriate tile and stone applications are detailed in the product [...] ONE YEAR LIMITED WARRANTY STATEMENT TERMS OF THE WARRANTY This limited warranty of M S International, Inc. (MSI) applies to flooring and surfacing products manufactured or distributed by MSI. The product purchased will be free from defects in material and workmanship for a period of one year from date of purchase. Defect is defined as a shortfall in the product to perform within industry allowable tolerances as set forth in standard, national industry protocols. Appropriate tile and stone",
        "score": 0.61140573,
        "bucket": "other"
      },
      {
        "url": "https://ressupply.com/documents/ironridge/Tilt_Mount_Installation_Manual.pdf?srsltid=AfmBOoqBN1cR9a-TuYEBtzChd5flqAjDLs6HUPF2TNoBTa7XbayQpEsd",
        "title": "[PDF] Tilt Mount Installation Manual - RES Supply",
        "snippet": "(Version 1.10). [...] COMPATIBILITY\b 13-17 FRAMLESS MODULE COMPATIBILITY\b 18 DISCLAIMER This manual describes proper installation procedures and provides necessary standards required for product reliability. Warranty details are available on website. All installers must thoroughly read this manual and have a clear understanding of the installation procedures prior to installation. Failure to follow these guidelines may result in property damage, bodily injury or even death. [...] • Ensure provided information is accurate. Issues resulting from inaccurate information are the installer’s responsibility.\n• Ensure bare copper grounding wire does not contact aluminum and zinc-plated steel components, to prevent risk of galvanic corrosion.\n• If loose components or loose fasteners are found during periodic inspection, re-tighten immediately. If corrosion is found, replace affected components immediately.",
        "score": 0.5923135,
        "bucket": "other"
      },
      {
        "url": "https://www.snapav.com/wcsstore/ExtendedSitesCatalogAssetStore/attachments/documents/Mounts/ManualsAndGuides/SM-TILT-S_Manual.pdf",
        "title": "[PDF] SM-TILT-S - Snap AV",
        "snippet": "INSTALLATION 1A. Installing the Wall Plate (Drywall) IMPORTANT! For safety reasons, this mount must be secured to a wood stud. The stud must be capable of supporting the combined weight of the mount and the display.\n1B. Installing the Wall Plate (Concrete) Important! For safety reasons, the concrete wall must be capable of supporting the combined weight of the mount and the display. [...] • \u0007 The wall or mounting surface must be capable of supporting the combined weight of the mount and the display; otherwise the structure must be reinforced.\n• \u0007 Safety gear and the proper tools must be used. Failure to do so can result in property damage and/or serious injury.\n• \u0007 Follow all instructions and recommendations regarding adequate ventilation and suitable locations for mounting your display. Consult the owner’s manual for your display for information. [...] Installation CAUTION: This wall mount is intended for use only with the maximum weight of 44 lbs.",
        "score": 0.464392,
        "bucket": "other"
      },
      {
        "url": "https://plp.com/id/images/pdfs/solar/SL-ML-1034-11P-2019_SolPwrRailCat.pdf",
        "title": "[PDF] PV Solar Roof and Structure Mounting Systems - PLP",
        "snippet": "Module Clamps with WEEB Grounding 20 POWER RAILTM Accessories Grounding Hardware 21 Turn Bolts 21 Wire Management Clips 22 POWER DISKTM 23 Table of Contents 1 (800) 260.3792 preformed.com 2 (800) 260.3792 preformed.com POWER RAIL ™ Module Mounting System The PV module mounting system engineered to reduce installation costs and provide maximum strength for parallel-to-roof, tilt up, or open structure mounting applications. [...] Part # Description Weight Per Unit (lbs.) Price FF5 5˚ Front Foot 0.25 7 .35 BF5 5˚ Back Foot 0.50 11 .55 FF10 10˚ Front Foot 0.25 7 .35 BF10 10˚ Back Foot 0.75 15.75 Tilted \"L\" Feet \"L\" Feet \"L\" Feet are fabricated from high-strength 3/16\" aluminum and include a vertical slot for adjusting to irregular surfaces. 5/16\" coated hardware included. [...] P8 POWER RAIL Extrusions ordered separately.\nTwo-Tier Tilt Kit Includes Strong Back, Fixed Leg, Mounting Feet, Rail Brackets, and Hardware.\nP8 POWER RAIL Extrusions ordered separately. Cross Bracing is required. See Assembly Instructions.",
        "score": 0.45784017,
        "bucket": "other"
      },
      {
        "url": "https://k2-systems.com/wp-content/uploads/2024/09/SimpleTilt-AI-EN.pdf",
        "title": "[PDF] Simple Tilt System",
        "snippet": "This racking system may be used to ground and/or mount a PV module complying with UL 61730 only when the specific module has been evaluated for grounding and/or",
        "score": 0.3995779,
        "bucket": "other"
      },
      {
        "url": "https://www.simonton.com/wp-content/uploads/Widen%20Assets/Documents/Simonton-Asure-Warranty.pdf",
        "title": "[PDF] Simonton-Asure-Warranty.pdf",
        "snippet": "To tilt in the operable sash on Double Hung and Single Hung windows, you must: • Unlock the bottom sash and raise it approximately 4\" above the frame.\n• On the top of the sash you’ll find the tilt latches. Slide the tilt latches toward the window lock and gently tilt and lower the sash towards you, letting it rest against the window sill. [...] • If it becomes necessary to remove and reinsert the sash, tilt the sash inward to a 90-degree angle and lift the bottom of the sash up and out of the frame. To reinsert the sash into the frame, make sure both pivot bars (located at the bottom of the sash) are fully inserted into the balance shoes. [...] the Product); (ii) shipping/freight expenses to return the Product to Simonton; (iii) normal maintenance; or (iv) consequential, incidental, special, or indirect losses or damages of any kind Disclaimer of Warranties THIS LIMITED WARRANTY IS IN LIEU OF AND EXCLUDES ALL OTHER WARRANTIES NOT EXPRESSLY SET FORTH HEREIN, EXPRESSED OR IMPLIED BY OPERATION OF LAW OR OTHERWISE, INCLUDING BUT NOT LIMITED TO ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR FITNESS FOR A PARTICULAR PURPOSE. TO THE EXTENT",
        "score": 0.16848753,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "outback-power",
    "product": "OutBack GFX1312E",
    "candidates": [
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/gvfx3024e_discontinued/gtfx_gvfx_decl_conformity.pdf",
        "title": "[PDF] Declaration of Conformity - Outback power",
        "snippet": "following.  GTFX2012E  GVFX2612E  GFX1312E  GTFX2024E  GVFX3024E  GFX1424E  GTFX2348E  GVFX3048E  GFX1448E IMPORTANT: Models intended for use in power applications other than 230 Vac, 50 Hz, or three-phase 230/400 Vac, 50 Hz, are not covered by this Declaration of Conformity. CE Compliance The OutBack inverter/charger models listed in this document are CE compliant for off-grid applications. These products comply with the following European Union directives:  EU Declaration of [...] 0.16 0.102 230 User setting > 52 1.00 0.605 230 User setting < 48 1.00 0.656 Settable acceptance ranges are 115 to 276 Vac, 49 to 51 Hz (IEEE selection), and 48 to 52 Hz (User selection). The reconnection delay is 12 seconds after restoration of acceptable conditions. The sell delay is 1 minute. These settings are not adjustable. All associated technical files are located in the Engineering Department at OutBack Power Technologies, Arlington, WA, USA. For a full list of product specifications, [...] typical power factor of 0.96 or better.  All International Series GTFX and GVFX inverter/chargers are tested to comply with Table 1. Table 1 Anti-Islanding Parameters Voltage Range (AC Volts) Frequency (Hz) Clearing Time (Seconds) Measured Time (Seconds) V < 115 50 0.16 0.02 115 ≤ V < 202.4 50 2.00 0.155 202.4 to 253 50 No cessation No cessation 253 < V < 276 50 1.00 0.157 V ≥ 276 50 0.16 Instantaneous, but 0.137 seconds to zero current 230 IEEE setting > 51 0.16 0.098 230 IEEE setting < 49",
        "score": 0.6672566,
        "bucket": "datasheets"
      },
      {
        "url": "https://old.outbackpower.com/downloads/catalog/productguide9_catalog.pdf",
        "title": "[PDF] outBack power technologies",
        "snippet": "Distortion Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Output Voltage Regulation ± 2.5% ± 2.5% ± 2.5% ± 2.5% ± 2.5% ± 2.5% Maximum Output Current Peak: 28AAC RMS: 20AAC Peak: 35AAC RMS: 25AAC Peak: 35AAC RMS: 25AAC Peak: 28AAC RMS: 20AAC Peak: 35AAC RMS: 25AAC Peak: 35AAC RMS: 25AAC AC Overload Capability Surge: 4600VA 5 Sec: 4300VA 30 Min: 2500VA Surge: 5750VA 5 Sec: [...] (L1-N or L2-N) 85 to 140VAC (L-N) 170 to 290VAC (L-N) 170 to 290VAC AC Input Frequency Range (Default) 54 to 66Hz @ 60Hz (45 to 55Hz @ 50Hz) 45 to 55Hz @ 50Hz (54 to 66Hz @ 60Hz) Grid-Interactive Voltage Range (Default) (L1-N or L2-N) 108 to 132VAC (L1-N or L2-N) 108 to 132VAC (L-N) 208 to 252VAC (L-N) 208 to 252VAC Grid-Interactive Frequency Range 59.3 to 60.5Hz 59.3 to 60.5Hz 57.0 to 61.0Hz 57.0 to 61.0Hz Maximum AC Input Current 50AAC @ 240VAC 50AAC @ 240VAC 50AAC 50AAC Maximum Utility [...] 60Hz (50Hz) Nominal DC Input Voltage 12VDC 24VDC 48VDC 12VDC 24VDC 48VDC Continuous AC RMS Output (@ 25° C) 16.7AAC 20.8AAC 25AAC 23.3AAC 29.2AAC 30AAC Idle Power Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Typical Efficiency 90% 92% 93% 90% 92% 93% CEC Weighted Efficiency — — 91% — 90.5% 91% Peak Efficiency — — — — — 95% Total Harmonic Distortion",
        "score": 0.65252984,
        "bucket": "datasheets"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_intl_series/gfx_intl_installmanual.pdf",
        "title": "[PDF] International Series GFX Inverter/Charger",
        "snippet": "of its mounting plate. Use M6 x 20 mm machine screws, one per corner, to attach the inverter to the mounting plate. Follow the instructions with each mounting system. IMPORTANT: Use correct fasteners to secure the GFX inverter to the mounting surface, regardless of the type of surface. OutBack cannot be responsible for damage to the product if it is attached with inadequate fasteners. ¾ Mount and secure each component before attaching any wiring. ¾ When the inverter is used with other metal [...] 41 cm (16.25”) Height 30.5 cm (12”) Installation 16 900-0111-01-00 Rev B Tools Required ¾ Wire cutters/strippers ¾ Torque wrenches ¾ Assorted insulated screwdrivers ¾ DVM or Voltmeter Mounting ¾ It is easier for two people to install the GFX inverter due to its weight. ¾ The unit has four mounting holes, one in each corner. Use fasteners in all four corners for a secure installation. ¾ Due to the variance in other mounting methods, OutBack only endorses the use of FLEXware or previous versions [...] system. See page 19 for instructions. DC and AC GROUND TERMINALS: Connect to grounding system for both batteries and AC. See page 18 for instructions. CONTROL WIRING TERMINAL BLOCK: Connects control wires for a variety of functions, including automatic generator starting. See pages 24 and 25 for instructions and the International Series GFX Operator’s Manual for more information. The Terminal Block can be unplugged from the AC board for convenience. While installed, keep screws tight and the",
        "score": 0.7756902,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_intl_series/gfx_intl_installmanual_spanish.pdf",
        "title": "[PDF] Series internacionales GFX Inversor/Cargador - Outback power",
        "snippet": "inversor GFX resulta más sencilla si la llevan a cabo dos personas.  La unidad tiene cuatro orificios de montaje, una en cada esquina. Use tornillos en las cuatro esquinas para asegurar la instalación.  Dada la variedad de métodos de montaje, OutBack solo aprueba el uso de FLEXware o versiones anteriores de su placa de montaje. Use tornillos M6 x 20 mm, uno por esquina, para fijar el inversor a la placa de montaje. Siga las instrucciones suministradas con el sistema de montaje [...] correspondiente.. IMPORTANTE: Use los tornillos correctos para fijar el inversor GFX a la superficie de montaje, independientemente del tipo de superficie. OutBack no será responsable de los daños causados al producto si no se fija de forma adecuada.  Instale y fije todos los componentes antes de conectar cualquier cable.  Cuando el inversor se usa con otra carcasa metálica, asegúrese de que todas las carcasas estén conectadas a tierra correctamente. (Consulte las instrucciones para la toma [...] (Disminución de un 125% ) Tamaño del conductor (Mínimo) Tamaño del disyuntor (Mínimo) GFX1312E 130 70 mm2 (2/0 AWG) o 0,109 pulg.2 175 ACC GFX1424E 70 70 mm2 (1/0 AWG) o 0,109 pulg.2 125 ACC GFX1448E 35 50 mm2 (#1 AWG) o 0,078 pulg.2 100 ACC Ubicación del terminal Requisitos de par de apriete Terminales de CC del inversor 4,0 Nm (35 libra-pulgada) Terminales de la batería Consulte las recomendaciones del fabricante de la batería. Cuando instale los cables de CC:  Asegúrese de que los",
        "score": 0.74785584,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/catalog/product_guide.pdf",
        "title": "[PDF] Outback power - Product Guide",
        "snippet": "back-up is pre-assembled onto a single factory tested pre-wired panel. Just install the mounting bracket, hang the system on a wall, make the necessary connections, and the system is ready-to-go. [...] (HxWxD) are 17x 16 x 8.5” (43.2 x 40.6 x 12.6 cm) and the Shipping Dimensions (HxWxL) are 23.25 x 20.5 x 13.25” (59.1 x 52.1 x 33.7 cm). [...] at temperatures greater than 77°F (25°C) will require recharge sooner than batteries stored at lower temperatures. Temperature Compensation Factor (Charging) 5mV per degree C per cell (2V) 5mV per degree C per cell (2V) Terminal Threaded copper alloy insert terminal Threaded copper alloy insert terminal to accept ¼-20 UNC bolt (provided) to accept ¼-20 UNC bolt (provided) Terminal Hardware Initial Torque 110 in-lbs (12.4 Nm) 110 in-lbs (12.4 Nm) Weight 115 lbs (52 kg) 131 lbs ( 60 kg)",
        "score": 0.72814995,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/warranty_and_safety/warranty_standard_english_spanish.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "precableados de fábrica en EE. UU. que incorporan los inversores anteriores • Sistemas de visualización y de reguladores serie MATE3s OutBack Power ofrece una garantía limitada de cinco (5) años contra defectos de materiales y fabricación y una garantía limitada de dos (2) años contra averías de ventiladores para los inversores/cargadores y reguladores de carga enumerados anteriormente. La duración de esta garantía comienza cuando se produzca el primero de los eventos siguientes: • La puesta en [...] inverter/chargers with model numbers ending in A or E • All GS series inverter/chargers with model numbers ending in A or E • FM60, FM80, and FM100 MPPT charge controllers • USA factory pre-wired FLEXpower systems incorporating the above inverters • MATE3s system display & controller products OutBack Power provides a five (5) year limited warranty against defects in materials and workmanship, and a two (2) year limited warranty against fan failure, for the inverter/chargers and charge [...] servicio/la primera activación del producto por parte de un instalador o usuario final • 6 meses después de que el producto se envíe desde fábrica Esta garantía es aplicable al comprador original del producto OutBack, y es transferible únicamente si el producto permanece instalado en el lugar de uso original. Se recomienda encarecidamente registrar el producto enviando la tarjeta de registro de la garantía o a través de www.outbackpower.com para agilizar las respuestas a toda posible",
        "score": 0.7596005,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/warranty_and_safety/warranty_standard_english.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "o The warranty period of any repaired or replacement product or component is the greater of ninety (90) days from date of shipment from us or the remainder of the initial warranty term. We reserve the right to request the Product be returned to us for analysis. [...] Warranty does not cover damage or defects to the Product caused by: • failure to follow any of the Product instructions or to perform preventive maintenance on the Product; • transportation, storage, installation, reinstallation, removal, improper use, alterations, modifications or disassembly; • improper repair or service, normal wear and tear, loose wires, natural forces, vandalism, freezing, lightning, fire, floods, or acts of God; • failure to properly set the charge/discharge current [...] o If the Product fails within ninety (90) days from original purchase date, we will replace the Product. If the Product fails after ninety (90) days and within the Warranty Period, we will either repair and return the Product or ship a replacement product. We will determine whether the Product is to be repaired or replaced in accordance with the Product’s age and model. We may authorize advance shipment of a replacement based on product age and model.",
        "score": 0.68874115,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_series/gfx_operators_manual.pdf",
        "title": "[PDF] GFX Series Inverter/Charger",
        "snippet": "OutBack Power Technologies.................................................................................................................7 System Display and Controller ........................................................................................................................................8 Operation ....................................................................................................9 Functional [...] Three-Phase Stacking Arrangement (Three Inverters)..............................26 900-0114-01-00 Rev A 7 Introduction Welcome to OutBack Power Technologies Thank you for purchasing the OutBack GFX Series Inverter/Charger. This product offers a complete power conversion system between batteries and AC power. It can provide backup power or complete off-grid service.  Battery-to-AC inverting which delivers 120 Vac at 60 Hz  AC-to-battery charging  Rapid transfer between AC source and inverter [...] WARNING: Limitations on Use This equipment is NOT intended for use with life support equipment or other medical equipment or devices. CAUTION: Equipment Damage Only use components or accessories recommended or sold by OutBack Power Technologies or its authorized agents. 900-0114-01-00 Rev A 3 Table of Contents Important Safety Instructions ........................................................................1 Audience",
        "score": 0.61140573,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "outback-power",
    "product": "OutBack GFX1424E",
    "candidates": [
      {
        "url": "https://outbackpower.com/downloads/documents/catalog/product_guide.pdf",
        "title": "[PDF] Outback power - Product Guide",
        "snippet": "21.0 to 34.0VDC 42.0 to 68.0VDC Continuous Battery Charge Output 55 amps DC 35 amps DC 85 amps DC 45 amps DC Temperature Range Rated 0°C to 50°C (power derated above 25°C) 0°C to 50°C (power derated above 25°C) Maximum -25°C to 60°C -25°C to 60°C Warranty Standard 5 year Standard 5 year Weight Unit 62 lbs (31 kg) 61 lbs (31 kg) Shipping 67 lbs (31 kg) 67 lbs (31 kg) Dimensions (H x W x L) Unit 13 x 8.25 x 16.25” (33 x 21 x 41 cm) 12 x 8.25 x 16.25” (30 x 21 x 41 cm) Shipping 21.75 x 13 x 22” [...] Distortion Typical 2% 2% 2% 2% Maximum <5% <5% <5% <5% Output Voltage Regulation ± 2% ± 2% ± 2% ± 2% Maximum Output Current Peak 70 amps AC 70 amps AC 70 amps AC 70 amps AC RMS 50 amps AC 50 amps AC 50 amps AC 50 amps AC AC Overload Capability Surge 5000VA 5000VA 5000VA 5000VA 5 Seconds 4100VA 4100VA 4100VA 4100VA 30 Minutes 2800VA 2800VA 3000VA 3000VA AC Input Current Maximum 60 amps AC 60 amps AC 60 amps AC 60 amps AC AC Input Voltage Range (adjustable) 66 to 120 amps AC 66 to 120 amps AC 66 [...] (HxWxD) are 17x 16 x 8.5” (43.2 x 40.6 x 12.6 cm) and the Shipping Dimensions (HxWxL) are 23.25 x 20.5 x 13.25” (59.1 x 52.1 x 33.7 cm).",
        "score": 0.69870013,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/gvfx3024e_discontinued/gtfx_gvfx_decl_conformity.pdf",
        "title": "[PDF] Declaration of Conformity - Outback power",
        "snippet": "following.  GTFX2012E  GVFX2612E  GFX1312E  GTFX2024E  GVFX3024E  GFX1424E  GTFX2348E  GVFX3048E  GFX1448E IMPORTANT: Models intended for use in power applications other than 230 Vac, 50 Hz, or three-phase 230/400 Vac, 50 Hz, are not covered by this Declaration of Conformity. CE Compliance The OutBack inverter/charger models listed in this document are CE compliant for off-grid applications. These products comply with the following European Union directives:  EU Declaration of [...] 0.16 0.102 230 User setting > 52 1.00 0.605 230 User setting < 48 1.00 0.656 Settable acceptance ranges are 115 to 276 Vac, 49 to 51 Hz (IEEE selection), and 48 to 52 Hz (User selection). The reconnection delay is 12 seconds after restoration of acceptable conditions. The sell delay is 1 minute. These settings are not adjustable. All associated technical files are located in the Engineering Department at OutBack Power Technologies, Arlington, WA, USA. For a full list of product specifications, [...] distortion (THD) and anti-islanding performance when the inverter exports power to a utility source. The OutBack inverter/charger models listed in this document are validated through compliance testing. The following specifications refer to exporting power to a simulated utility source of less than 1% voltage total harmonic distortion (THD).  The THD of the root mean square (RMS) current is less than 5%.  The output of the GTFX and GVFX inverter exceeds the minimum power factor of 0.85 with a",
        "score": 0.67527276,
        "bucket": "datasheets"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_series/gfx_operators_manual.pdf",
        "title": "[PDF] GFX Series Inverter/Charger",
        "snippet": "OutBack Power Technologies.................................................................................................................7 System Display and Controller ........................................................................................................................................8 Operation ....................................................................................................9 Functional [...] ..........................................................................................44 Table 12 Mechanical Specifications (GFX1424) .....................................................................................44 Table 13 Electrical Specifications (GFX1548) ..........................................................................................45 Table 14 Mechanical Specifications (GFX1548) .....................................................................................45 [...] accompanied by a RED STATUS LED to indicate a Low Battery ERROR. Table 2 Battery LED Values Color 12 Vdc Unit 24 Vdc Unit, ± 0.2 Vdc 48 Vdc Unit, ± 0.4 Vdc Battery Status GREEN 12.5 Vdc or higher 25.0 Vdc or higher 50.0 Vdc or higher ACCEPTABLE YELLOW 11.5 to 12.4 Vdc 23.0 to 24.8 Vdc 46.0 to 49.6 Vdc USABLE RED 11.4 Vdc or lower 22.8 Vdc or lower 45.6 Vdc or lower LOW  Gaps in the table (higher-voltage units) are due to the resolution of the inverter’s DC meter.  These voltage settings are",
        "score": 0.6551821,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/n_series/FX_series_Install.pdf",
        "title": "[PDF] FX SERIES INVERTER/CHARGER - Outback power",
        "snippet": "• Due to the variance in other mounting methods, OutBack only endorses the use of FLEXware or previous versions of its mounting plate for installing the FX and associated system components using M6 X 20mm machine screws (stainless steel for FLEXware and self-tapping for older mounting plates), one per corner. Follow the instruction manual that comes with each mounting system. • If mounting the FX on other surfaces such as plywood, wall studs, or masonry, use appropriate fasteners to support [...] Install the FX in a dry location, preferably indoors.\n• Install the FX in a shaded area out of direct sun light for best operation.\n• For installations where the FX may be exposed to water spray, a sealed FX must be used and mounted either with the base down (shelf mounting) or with the AC wiring compartment facing down (wall mounting). [...] • An FX must be secured with appropriate fasteners to a sturdy mounting surface capable of supporting its weight. It is easier for two people to install the FX due to its weight.\n• OutBack FXs can be mounted in any position, but they perform better in locations off ering plenty of air circulation. • NOTE: If using an OutBack FLEXware Mounting Plate, avoid large air gaps behind the plate which can result in louder mechanical noise during inverting/charging under heavy loads.",
        "score": 0.79637206,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_intl_series/gfx_intl_installmanual.pdf",
        "title": "[PDF] International Series GFX Inverter/Charger",
        "snippet": "of its mounting plate. Use M6 x 20 mm machine screws, one per corner, to attach the inverter to the mounting plate. Follow the instructions with each mounting system. IMPORTANT: Use correct fasteners to secure the GFX inverter to the mounting surface, regardless of the type of surface. OutBack cannot be responsible for damage to the product if it is attached with inadequate fasteners. ¾ Mount and secure each component before attaching any wiring. ¾ When the inverter is used with other metal [...] 41 cm (16.25”) Height 30.5 cm (12”) Installation 16 900-0111-01-00 Rev B Tools Required ¾ Wire cutters/strippers ¾ Torque wrenches ¾ Assorted insulated screwdrivers ¾ DVM or Voltmeter Mounting ¾ It is easier for two people to install the GFX inverter due to its weight. ¾ The unit has four mounting holes, one in each corner. Use fasteners in all four corners for a secure installation. ¾ Due to the variance in other mounting methods, OutBack only endorses the use of FLEXware or previous versions [...] system. See page 19 for instructions. DC and AC GROUND TERMINALS: Connect to grounding system for both batteries and AC. See page 18 for instructions. CONTROL WIRING TERMINAL BLOCK: Connects control wires for a variety of functions, including automatic generator starting. See pages 24 and 25 for instructions and the International Series GFX Operator’s Manual for more information. The Terminal Block can be unplugged from the AC board for convenience. While installed, keep screws tight and the",
        "score": 0.77096564,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/gfx_intl_series/gfx_intl_installmanual_spanish.pdf",
        "title": "[PDF] Series internacionales GFX Inversor/Cargador - Outback power",
        "snippet": "inversor GFX resulta más sencilla si la llevan a cabo dos personas.  La unidad tiene cuatro orificios de montaje, una en cada esquina. Use tornillos en las cuatro esquinas para asegurar la instalación.  Dada la variedad de métodos de montaje, OutBack solo aprueba el uso de FLEXware o versiones anteriores de su placa de montaje. Use tornillos M6 x 20 mm, uno por esquina, para fijar el inversor a la placa de montaje. Siga las instrucciones suministradas con el sistema de montaje [...] correspondiente.. IMPORTANTE: Use los tornillos correctos para fijar el inversor GFX a la superficie de montaje, independientemente del tipo de superficie. OutBack no será responsable de los daños causados al producto si no se fija de forma adecuada.  Instale y fije todos los componentes antes de conectar cualquier cable.  Cuando el inversor se usa con otra carcasa metálica, asegúrese de que todas las carcasas estén conectadas a tierra correctamente. (Consulte las instrucciones para la toma [...] serie del inversor.  Los primeros dos dígitos muestran el vataje del modelo. Por ejemplo, “GFX1312E” es de 1300 vatios.  El segundo par de dígitos muestra el voltaje nominal de CC del inversor. Por ejemplo, “GFX1424E” es de 24 voltios.  La letra “E” al final del número de modelo indica que el inversor puede entregar 230 VCA a 50 Hz.  Inversión de batería a CA que entrega 230 VCA a 50 Hz  Carga de CA a batería  Transferencia rápida entre la fuente de CA y la salida del inversor con mínimo",
        "score": 0.7429634,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/catalog/productguide9_catalog.pdf",
        "title": "[PDF] outBack power technologies",
        "snippet": "Everything needed, outside of power sources and battery backup, is completely integrated—just install the mounting bracket, hang the system on a wall, make the necessary connections and the system is fully operational. [...] All OutBack Power components are designed to work seamlessly with one and other, resulting in system efficiency, simplified installation and single-source ordering and technical support. Every OutBack product is engineered to serve one of three key functions in a renewable energy system—Make, Store and Manage. [...] Distortion Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Typical: < 2% Maximum: < 5% Output Voltage Regulation ± 2.5% ± 2.5% ± 2.5% ± 2.5% ± 2.5% ± 2.5% Maximum Output Current Peak: 28AAC RMS: 20AAC Peak: 35AAC RMS: 25AAC Peak: 35AAC RMS: 25AAC Peak: 28AAC RMS: 20AAC Peak: 35AAC RMS: 25AAC Peak: 35AAC RMS: 25AAC AC Overload Capability Surge: 4600VA 5 Sec: 4300VA 30 Min: 2500VA Surge: 5750VA 5 Sec:",
        "score": 0.6415577,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/warranty_and_safety/warranty_standard_english_spanish.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "precableados de fábrica en EE. UU. que incorporan los inversores anteriores • Sistemas de visualización y de reguladores serie MATE3s OutBack Power ofrece una garantía limitada de cinco (5) años contra defectos de materiales y fabricación y una garantía limitada de dos (2) años contra averías de ventiladores para los inversores/cargadores y reguladores de carga enumerados anteriormente. La duración de esta garantía comienza cuando se produzca el primero de los eventos siguientes: • La puesta en [...] inverter/chargers with model numbers ending in A or E • All GS series inverter/chargers with model numbers ending in A or E • FM60, FM80, and FM100 MPPT charge controllers • USA factory pre-wired FLEXpower systems incorporating the above inverters • MATE3s system display & controller products OutBack Power provides a five (5) year limited warranty against defects in materials and workmanship, and a two (2) year limited warranty against fan failure, for the inverter/chargers and charge [...] servicio/la primera activación del producto por parte de un instalador o usuario final • 6 meses después de que el producto se envíe desde fábrica Esta garantía es aplicable al comprador original del producto OutBack, y es transferible únicamente si el producto permanece instalado en el lugar de uso original. Se recomienda encarecidamente registrar el producto enviando la tarjeta de registro de la garantía o a través de www.outbackpower.com para agilizar las respuestas a toda posible",
        "score": 0.7570233,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/warranty_and_safety/warranty_standard_english.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "o The warranty period of any repaired or replacement product or component is the greater of ninety (90) days from date of shipment from us or the remainder of the initial warranty term. We reserve the right to request the Product be returned to us for analysis. [...] o If the Product fails within ninety (90) days from original purchase date, we will replace the Product. If the Product fails after ninety (90) days and within the Warranty Period, we will either repair and return the Product or ship a replacement product. We will determine whether the Product is to be repaired or replaced in accordance with the Product’s age and model. We may authorize advance shipment of a replacement based on product age and model. [...] Warranty does not cover damage or defects to the Product caused by: • failure to follow any of the Product instructions or to perform preventive maintenance on the Product; • transportation, storage, installation, reinstallation, removal, improper use, alterations, modifications or disassembly; • improper repair or service, normal wear and tear, loose wires, natural forces, vandalism, freezing, lightning, fire, floods, or acts of God; • failure to properly set the charge/discharge current",
        "score": 0.68723184,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "outback-power",
    "product": "OutBack Radian GS4048A",
    "candidates": [
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/gs_8048a_4048a_operator.pdf",
        "title": "[PDF] Radian Series Inverter/Charger - Outback power",
        "snippet": "PCS controlled bus bar or conductor. NOTE: The maximum operating currents in controlled bus bars or conductors are limited by the settings of the power control system. They may be lower than the sum of the currents of the connected controlled power sources. Model GS8048A has a maximum continuous current of 33.3 Aac (8 kVA). Model GS4048A has a maximum continuous current of 16.7 Aac (4 kVA).  This level of output cannot be reduced when used in an off-grid installation. [...] requirements for licensing and training for the installation of electrical power systems. 1 Outback Power Technologies Intuitive Control System for Renewable Energy 10 900-0161-01-01 Rev C ©2017 EnerSys. All Rights Reserved. Introduction GS8048A o 8,000 watts (8 kW) continuous power at 48 Vdc o 16.97 kVA peak surge capacity o Modular internal design allows low idle consumption, high efficiency at both high and low power operation GS4048A o 4,000 watts (4 kW) continuous power at 48 Vdc o 8.48 [...] battery terminals 3a 16 900-0161-01-01 Rev C ©2017 EnerSys. All Rights Reserved. Operation Response Times This table shows the rated maximum current and open-loop response times in the four named PCS modes for the Radian (A series) inverters. Table 3 Inverter Ratings Inverter: GS4048A GS8048A Maximum PCS Controlled Current: 16 Aac 32 Aac Maximum Open-Loop Response Time: Unrestricted Mode < 2 seconds < 2 seconds No-Exchange Mode < 2 seconds < 2 seconds Export-Only Mode < 2 seconds < 2 seconds",
        "score": 0.7657514,
        "bucket": "datasheets"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_gs_load_center/radian_gslc_datasheet.pdf",
        "title": "[PDF] Radian Series - Outback power",
        "snippet": "20.4 Recommended Charge Controller Model FLEXmax 60 and 80 FLEXmax 100 FLEXmax 60 and 80 FLEXmax 100 Recommended Radian Model GS8048A-01 GS4048A-01 GS7035E GS3548E GS8048A-01 GS4048A-01 GS8048A-01 GS8048A-01 GS4048A-01 GS4048A-01 230 Model Numbers GSLC175-230 GSLC175-PV-230 GSLC-PV-300VDC-230 GSLC175PV1-230 GSLCPV1-300VDC-230 Enclosure w/ Hinged Door u u u u u 175A Breakers 2 2 2 1 1 Dual AC Inputs u u u u u GFDI u u FLEXnet DC u u u u PV Disconnects 2 2 1 1 500A DC Shunt 1 3 3 2 2 Weight [...] provided inverter DC overcurrent protection and disconnects, dual AC inputs, grid-tied inverter connection and 120/240VAC or 230V maintenance bypass. [...] Designed for use with the Radian Series inverter/charger family, the options offer solutions for group-up custom designs or factory pre-wired configurations for specific applications. The OutBack GS Load Centers simplify the configuration, distribution and implementation of energy storage of the Radian Series inverter/charger through a standardized approach.",
        "score": 0.6852132,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/gs_8048a_4048a_install.pdf",
        "title": "[PDF] Radian Series Inverter/Charger - Outback power",
        "snippet": "(33 Aac) Model GS4048A can continuously produce up to 4 kVA (16 Aac) o Mounts easily with supplied mounting plate o All terminals exit at the bottom of the inverter, allowing the installer to use a single distribution box; the GS Load Center (GSLC) is specifically designed for this purpose o Uses the MATE3s™ System Display and Controller for user interface as part of a Grid/Hybrid system  MATE3s revision 1.001.000 or greater is required for grid support functionality  Grid support and certain [...] IMPORTANT: Use correct fasteners to secure the mounting plate and the Radian inverter/charger to the mounting surface. OutBack Power cannot be responsible for damage to the product if it is attached with inadequate fasteners. The Radian inverter/charger comes equipped with a mounting plate, as shown in Figure 8. Figure 8 Installing the Mounting Plate Mount the Radian inverter using these steps. 1. [...] NOTE: The left corner is used for securing the inverter to a stud. If the Radian inverter is mounted on plywood or a similar wide-area mounting surface as shown, any of the slots in the mounting flange may be used.\n2.\nPlace the Radian inverter against the wall and slide it directly over the upper lip of the mounting plate.\nThe inverter’s mounting flange should come to rest within the lip so that it hangs securely.",
        "score": 0.7975099,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/gs_svc.pdf",
        "title": "[PDF] Radian Series Inverter/Charger Service Instructions - Outback power",
        "snippet": "re-installing the configuration file, running the configuration wizard, or manually accessing the inverter’s settings and making the appropriate changes. NOTE: Radian models GS3548E and GS4048A must be re-programmed for their specific model. Using the MATE3, press the “LOCK” button, press the “UP” button, and insert the “Installer” password. The default password is  but may have been changed. If necessary, contact the installer or OutBack Power Technical Support. Press the center button, scroll [...] Position Black Wire Terminal White Wire Terminal Red Wire Terminal Fan Cable Terminal Ribbon Cable GS8048 Left L1 (LEFT XFMR) N (NEUTRALS) L2 (LEFT XFMR) FAN LEFT J8 Right L1 (RIGHT XFMR) N (NEUTRALS) L2 (RIGHT XFMR) FAN RIGHT J4 GS7048E Left L1 (LEFT XFMR) N (LEFT XFMR) N/A FAN LEFT J8 Right L1 (RIGHT XFMR) N (RIGHT XFMR) N/A FAN RIGHT J4 GS8048A Left L1-L NEU-L L2-L FAN LEFT J8 Right L1-R NEU-R L2-R FAN RIGHT J4 GS3548E Left L1 (LEFT XFMR) N (LEFT XFMR) N/A FAN LEFT J8 GS4048A Left L1-L NEU-L [...] their specific model. Using the MATE3, press the “LOCK” button, press the “UP” button, and insert the “Installer” password. The default password is  but may have been changed. If necessary, contact the installer or OutBack Power Technical Support. Press the center button, scroll down to “Model Select”, press the center button and then change the model to the correct version (labeled on the left side of the Radian chassis as well is within the chassis in the upper right-hand Radian Series 8",
        "score": 0.77792513,
        "bucket": "installation"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/radian_gs_load_center/gs_loadcenter_install.pdf",
        "title": "[PDF] GS Load Center - Outback power",
        "snippet": "skip to the wiring section on page 33. o GSLC175PV1-120/240, GSLC175PV1-230, GSLC-PV1-300VDC, and GSLCPV1-300VDC-230 are the “fully-loaded” versions for Radian models GS4048A and GS3548E. They have all options already present and need only external wiring and devices added. Users with these versions can skip to the wiring section on page 33. Additional AC and DC circuit breakers are available for installation on all models. The following pages describe the installation of individual items, [...] Remove the nuts and other hardware (washer, lock washer, hex nut) from the bottom terminal in the back of each DC disconnect.\n2.\nPlace the two DC disconnects side by side.\n3.\nOrient the DC positive plate so that the three largest holes are at the top. These holes have a diameter of 0.50\" (1.3 cm). Insert the studs on each disconnect through the first and third holes.\n4.\nReplace the disconnect hardware (washer, lock washer, hex nut). [...] product is only serviceable by qualified personnel. Do not use this product without reading the appropriate Radian inverter/charger literature. Symbols Used WARNING: Hazard to Human Life This type of notation indicates that the hazard could be harmful to human life. CAUTION: Hazard to Equipment This type of notation indicates that the hazard may cause damage to the equipment. IMPORTANT: This type of notation indicates that the information provided is important to the installation, operation",
        "score": 0.7568076,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/integrated_systems/flexpower_radian/fpradian_qsg.pdf",
        "title": "[PDF] FP-Radian - Outback power",
        "snippet": "Lift the inverter high enough that the inverter bracket is above the wall bracket. Lower the inverter so that the top of the back plane flange slips into the wall bracket. Ensure the unit is centered on the wall bracket.\nInstall the mounting screws. See illustration below for preferred locations for maximum mounting strength. [...] IMPORTANT  Ensure all settings are correct for the system. The Profile Wizard can be used for rapid setup. For Grid Support functions it may be necessary to load a .GIP file.  Verify the firmware revision of all OutBack devices before use.\nThe Radian inverter and system display may not communicate or operate correctly unless their firmware is above a specified revision number.\n For firmware and .GIP file installation, see the Installation Manual. [...] NOTE: Working gloves are strongly recommended when performing installation steps.\nEnsure the mounting surface is strong enough to handle 3 times the total weight of all the components. Add plywood or other reinforcing material as necessary to strengthen the surface.\nAttach the wall bracket. Center the mounting holes on the wall studs. Use all 6 mounting screws to secure the bracket.",
        "score": 0.7180613,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/radianseries_8048a_4048a_specsheet.pdf",
        "title": "[PDF] Radian A-Series™ - Outback power",
        "snippet": "The Radian GS8048A and GS4048A feature dual AC inputs for grid/generator flexibility with no external switching required, unparalleled surge capability and operational stability, easy field upgrade-ability and stacking capability for large system scaling, simplified system commissioning through a powerful, easy to use configuration wizard and multi-mode operational flexibility. These inverter/chargers incorporate OutBack Power’s GridZero technology: energy management for self-generation and [...] Radian A-Series™ Specifications Models: GS8048A GS4048A Instantaneous Power (100ms): 16970VA 8500VA Surge Power (5 sec): 12000VA 6000VA Peak Power (30 min): 9000VA 4500VA Continuous Power Rating (@ 25°C): 8000VA 4000VA Nominal DC Input Voltage: 48VDC 48VDC AC Output Voltage (Selectable): 120/240VAC (200 to 260VAC) 120/240VAC (200 to 260VAC) AC Output Frequency (Selectable): 60Hz (50Hz) 60Hz (50Hz) Continuous AC Output Current (@ 25°C): 33.3AAC @ 240VAC 16.7AAC Idle Power: Invert mode, no load: [...] limited •\t8000 and 4000VA of continuous power with dual AC inputs and peak operating efficiency of 96% •\tOff-grid and grid-tied functionality in one unit •\tIntegrates both grid and generator with dual inputs •\tPerforms AC coupling with both legacy and UL1741SA inverters, using frequency shifting The acclaimed Radian Series inverter/chargers from OutBack Power™ make solar and backup power available and accessible in one platform.",
        "score": 0.8098936,
        "bucket": "other"
      },
      {
        "url": "https://www.outbackpower.com/downloads/noteworthy/outback-news-noteworthy2.pdf",
        "title": "[PDF] Outback power - FLEXcoupled AC-Coupling Solution Radian Series ...",
        "snippet": "nearly any system architecture: off-grid, grid-connected, microgrid, back-up, grid-support, and much more. Innovative energy system designers can now offer Radian superiority across their entire project portfolio with the all-new GS3548E and GS4048A models, which take the performance, flexibility and technology of their high-powered counterparts and scale it for work in nearly any residential or commercial project. [...] 3 coupled AC-Coupling Solution 4 Radian Series Specifications GS4048A GS3548E Nominal DC Input Voltage 48 Vdc 48 Vdc Continuous Output Power at 25°C 4000 VA 3500 VA AC Output Voltage Range 120/240 Vac 230 Vac (210 - 250 VAC) AC Output Frequency (default) 60 Hz 50Hz Continuous AC Output Current at 25°C 16.6 Aac 15 Aac Typical Efficiency 93% 92% Maximum Output Current 1 ms peak 50 Aac at 240 Vac 50 Aac 100 ms RMS 35.35 Aac at 240 Vac 35.35 Aac Overload Capability 100 ms surge 8.48 kVA 8.2kVA 5 [...] per directive EN61000-6-1, EN61000-6-3, EN61000-3-2, 2011/65/eu EN61000-3-3, AS31000, CE, RoHS compliant per directive 2011/65/eu Warranty Standard 5 year Standard 5 year Weight Unit 84 lbs (38.1 kgs) 84 lbs (38.1 kgs) Shipping 95 lbs (43.09 kg) 95 lbs (43.09 kg) 2 N E W & N O T E W O R T H Y 5 Radian GS3548E & GS4048A With the introduction of its acclaimed Radian series, OutBack made the benefits of Grid/Hybrid technology available and accessible in one agile powerful, platform ideal for",
        "score": 0.7559439,
        "bucket": "other"
      },
      {
        "url": "https://outbackpower.com/downloads/warranty_and_safety/warranty_bos_english_spanish.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "comienza cuando se produzca el primero de los eventos siguientes:  La puesta en servicio/la primera activación del producto por parte de un instalador o usuario final  6 meses después de que el producto se envíe desde fábrica Esta garantía es aplicable al comprador original del producto OutBack, y es transferible únicamente si el producto permanece instalado en el lugar de uso original. Se recomienda encarecidamente registrar el producto enviando la tarjeta de registro de la garantía o a [...] más adelante) o reinstalación de los productos o partes de productos. ESTA GARANTÍA LIMITADA ES LA ÚNICA GARANTÍA APLICABLE A PRODUCTOS OUTBACK. OUTBACK RECHAZA EXPRESAMENTE CUALQUIER OTRA GARANTÍA EXPLÍCITA O IMPLÍCITA DE SUS PRODUCTOS, INCLUIDAS, ENTRE OTRAS, LAS GARANTÍAS IMPLÍCITAS DE COMERCIABILIDAD O IDONEIDAD PARA UN FIN DETERMINADO. OUTBACK TAMBIÉN LIMITA EXPRESAMENTE SU RESPONSABILIDAD EN CASO DE REPARACIÓN O SUSTITUCIÓN DE UN PRODUCTO DEFECTUOSO DE ACUERDO CON LOS TÉRMINOS DE ESTA [...] 900-0219-10-00 Rev B 900-0219-10-00 Rev B Si es necesaria una caja de envío para la devolución de un producto fuera de garantía, OutBack se la enviará bajo petición. El cliente es responsable del pago del envío a OutBack. El período de garantía de cualquier producto reparado o de sustitución, así como de cualquier parte del producto, es de noventa (90) días a partir de la fecha de envío desde OutBack, o igual al período de validez restante de la garantía inicial, el que sea mayor de los dos.",
        "score": 0.7485182,
        "bucket": "other"
      },
      {
        "url": "https://www.outbackpower.com/downloads/catalog/productguide8_catalog.pdf",
        "title": "[PDF] Product guide 8 - Outback power",
        "snippet": "additional assurance as they transition to solar power.” High Performance, Pure Aesthetics High-End Residential OutBack Grid/Hybrid System, Ozark Mountains, MO 9 Inverter/Chargers Radian ™ Series Inverter/Charger Specifications Models: Domestic (For Selected North, Central and Latin American Countries) International (For Europe, Asia and Global Countries) GS8048 GS8048A GS4048A GS7048E GS3548E Nominal DC Input Voltage 48VDC 48VDC 48VDC 48VDC 48VDC Continuous Output Power (@ 25°C) 8000VA 8000VA [...] Shipping: 34 / 15.4 Unit: 40 / 18.1 Shipping: 45 / 20.4 Unit: 37 / 16.8 Shipping: 45 / 20.4 Unit: 37 / 16.8 Shipping: 45 / 20.4 Unit: 40 / 18.1 Shipping: 45 / 20.4 Unit: 40 / 18.1 Shipping: 45 / 20.4 Unit: 40 / 18.1 Shipping: 45 / 20.4 Unit: 40 / 18.1 Shipping: 45 / 20.4 Recommended Radian Model GS8048 GS8048A GS4048A GS7035E GS3548E GS8048 GS8048A GS4048A GS8048 GS8048A GS4048A GS7048E GS8048 GS8048A GS7048E GS4048A GS3548E 11 Inverter/Chargers Radian ™ Series Sample Bill of Materials and [...] Frequency/Voltage 60Hz / 230VAC 60Hz / 230VAC 60Hz / 230VAC 60Hz / 230VAC Continuous AC RMS Output (@25°C) 8.7AAC 10AAC 13AAC 13AAC Idle Power Full: ~20W Search: ~6W Full: ~23W Search: ~6W Full: ~20W Search: ~6W Full: 20W Search: ~6W Typical Efficiency 92% 93% 92% 93% Total Harmonic Distortion Typical: 2% Maximum: < 5% Typical: 2% Maximum: < 5% Typical: 2% Maximum: < 5% Typical: 2% Maximum: < 5% Output Voltage Regulation ±2% ±2% ±2% ±2% Maximum Output Current Peak: 35AAC RMS: 25AAC Peak: 35AAC",
        "score": 0.70263255,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/integrated_systems/flexpower_radian/flexpowerradian_specsheet.pdf",
        "title": "[PDF] FLEXpower Radian™",
        "snippet": "Available in the Radian A Series 4kW or 8kW inverter/charger, both models incorporate OutBack Power’s GridZero technology, a superior level of intelligence in energy management for self-generation and self-consumption programs. It provides precise balancing between using stored energy, solar and utility power, blending-in the latter to overcome surges and load spikes. Both models support leading-edge battery technologies such as lithium-ion and others, and enhanced diagnostics for improved [...] pre-assembled and pre-wired power systems take the concept of fast, easy installation to a new level of value and flexibility with the OutBack Power™ FLEXpower Radian™. [...] FLEXpower Radian™ Specifications Model Description Inverter GSLC Bypass Inverter OCPD PV OCPD GFDI AFCI RTS Charge Controller FPR-4048A-300AFCI GS4048A FLEXpower Radian AFCI GS4048A GSLC-PV1-300VDC 120/240VAC 175A 80A Yes Yes Yes (1) FLEXmax 100 AFCI FPR-4048A-01 GS4048A FLEXpower Radian GS4048A GSLC175-PV1-120/240 120/240VAC 175A 80A Yes No Yes (1) FLEXmax 80 FPR-8048A-300AFCI GS8048A FLEXpower Radian AFCI GS8048A GSLC-PV-300VDC 120/240VAC (2×) 175A (2×) 80A Yes Yes Yes (2) FLEXmax 100 AFCI",
        "score": 0.67140645,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "outback-power",
    "product": "OutBack Radian GS8048A",
    "candidates": [
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/radianseries_8048a_4048a_specsheet.pdf",
        "title": "[PDF] Radian A-Series™ - Outback power",
        "snippet": "Yes Yes Field Upgradeable Firmware: Yes Yes Chassis Type: Vented Vented 03/202 1 #980-00076-01-001 REV C Instantaneous Power Rating: Most stringent, massive load start•GS8048A: 16970VA Surge Power Rating: Less stringent load start•GS8048A: 12000VA Peak Power Rating: Frequent “heavy duty” load requirements•GS8048A: 9000VA Continuous Power Rating: Sustained “real world” load requirements•GS8048A: 8000VA Radian GS8048A Power Rating Power (VA) 20000 15000 10000 5000 0 100ms 5 sec 30 min Continuous [...] Radian A-Series™ Specifications Models: GS8048A GS4048A Instantaneous Power (100ms): 16970VA 8500VA Surge Power (5 sec): 12000VA 6000VA Peak Power (30 min): 9000VA 4500VA Continuous Power Rating (@ 25°C): 8000VA 4000VA Nominal DC Input Voltage: 48VDC 48VDC AC Output Voltage (Selectable): 120/240VAC (200 to 260VAC) 120/240VAC (200 to 260VAC) AC Output Frequency (Selectable): 60Hz (50Hz) 60Hz (50Hz) Continuous AC Output Current (@ 25°C): 33.3AAC @ 240VAC 16.7AAC Idle Power: Invert mode, no load: [...] Radian GS8048A Power Factor Power Factor 8.0kVA 8.0kW 8.0kVA 6.8kW 1.0 0.75 0.5 0.25 0.0 0.85 Industry Standard Non-Industry Standard",
        "score": 0.8088086,
        "bucket": "datasheets"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/gs_8048a_4048a_operator.pdf",
        "title": "[PDF] Radian Series Inverter/Charger - Outback power",
        "snippet": "requirements for licensing and training for the installation of electrical power systems. 1 Outback Power Technologies Intuitive Control System for Renewable Energy 10 900-0161-01-01 Rev C ©2017 EnerSys. All Rights Reserved. Introduction GS8048A o 8,000 watts (8 kW) continuous power at 48 Vdc o 16.97 kVA peak surge capacity o Modular internal design allows low idle consumption, high efficiency at both high and low power operation GS4048A o 4,000 watts (4 kW) continuous power at 48 Vdc o 8.48 [...] PCS controlled bus bar or conductor. NOTE: The maximum operating currents in controlled bus bars or conductors are limited by the settings of the power control system. They may be lower than the sum of the currents of the connected controlled power sources. Model GS8048A has a maximum continuous current of 33.3 Aac (8 kVA). Model GS4048A has a maximum continuous current of 16.7 Aac (4 kVA).  This level of output cannot be reduced when used in an off-grid installation. [...] refer to the entire range. However, some references are made to 120/240 Vac or 60 Hz output. These are intended as examples only. NOTE: Model GS8048A, a battery-based, grid-support inverter, has a maximum sell current limit of 30 Aac, at 240 Vac. This corresponds to 7.2 kVA of maximum potential power output towards the grid. This value is configurable and require a password to access and configure. It is only accessible by qualified personnel who meet all local and governmental code",
        "score": 0.80625874,
        "bucket": "datasheets"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/radian/gs8048_specsheet_english.pdf",
        "title": "[PDF] Radian™ Series",
        "snippet": "The 120/240V 60Hz split-phase Radian is an 8,000W power solution that seamlessly integrates with traditional North American wiring practices. System integration and programming is easier with OutBack’s MATE3 and HUB communications management devices. Advanced front-vented layout provides optimum cooling in zero-clearance installations. A field-serviceable design simplifies maintenance and firmware updates without the addition of specialized equipment. [...] 9122.79889.0 Fax: +49 9122.79889.21 Latin America Tel: +1 561.792.9651 Fax: +1 561.792.7157 Asia Pacific Tel: +852 2736.8663 Fax: +852 2199.7988 A v a i l a b l e F r o m Radian Series GS8048 Specifications 05/2015 Model: GS8048 Nominal DC Input Voltage 48VDC Continuous Output Power (@ 25°C) 8000VA AC Output Voltage (Selectable) 120/240VAC AC Output Frequency (Selectable) 60Hz Continuous AC Output Current (@ 25°C) 33.3AAC @ 240VAC Idle Consumption (Invert Mode, No Load) 30W Typical Efficiency [...] (L1-N or L2-N) 106 to 132VAC Grid-Interactive Frequency Range 59.3 to 60.5Hz Maximum AC Input Current 50AAC @ 240VAC Maximum Utility Interactive Current 32A Continuous Battery Charge Output 115.0ADC DC Input Voltage Range 40 to 64VDC Temperature Range (Power derated above 25°C) Rated: 0 to 50°C Maximum:-25 to 60°C Accessory Ports Remote Temperature Sensor, MATE3 & HUB Communications Non-Volatile Memory Yes Field Upgradable Firmware Yes Chassis Type Vented Certifications ETL Listed to UL1741,",
        "score": 0.8016413,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/radian_8048a_4048a/gs_8048a_4048a_install.pdf",
        "title": "[PDF] Radian Series Inverter/Charger - Outback power",
        "snippet": "Radian Series Inverter/Charger. GS4048A. GS8048A. Installation Manual. Page 2. About OutBack Power. OutBack Power™ is a leader in advanced energy storage and",
        "score": 0.98533,
        "bucket": "installation"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/radian/gs8048_operator_manual.pdf",
        "title": "[PDF] Radian Series Inverter/Charger - Outback power",
        "snippet": "AC Alternating Current; refers to voltage produced by the inverter, utility grid, or generator AGS Advanced Generator Start CSA Canadian Standards Association; establishes Canadian national standards and the Canadian Electrical Code, including C22.1 and C22.2 DC Direct Current; refers to voltage produced by the batteries or renewable source Important Safety Instructions 2 900-0020-01-00 Rev B Table 1 Terms and Definitions Term Definition DVM Digital Voltmeter ETL Electrical Testing Laboratories; short for the company ETL Semko; refers to a certification issued by ETL to OutBack products indicating that they meet certain UL standards GND Ground; a permanent conductive connection to earth for safety reasons; also known as Chassis Ground, Protective Earth, PE, Grounding Electrode Conductor, and GEC Grid-interactive, grid-intertie, grid-tie Utility grid power is available for use and the inverter is a model capable of returning (selling) electricity back to the utility grid HBX High Battery Transfer; a function of the remote system display IEEE Institute of Electrical and Electronics Engineers; refers to a series of standards and practices for the testing of electrical products LBCO Low Battery Cut-Out; set point at which the inverter shuts down due to low voltage NEC National Electric Code NEU AC Neutral; also known as Common Off-grid Utility grid power is not available for use PV Photovoltaic RELAY AUX Auxiliary connection that uses switch (relay) contacts to control external devices.",
        "score": 0.98375,
        "bucket": "installation"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/radian_gs_load_center/gs_loadcenter_install.pdf",
        "title": "[PDF] GS Load Center - Outback power",
        "snippet": "GS8048, GS8048A, and GS7048E. They have hardware for Radian inverter AC and DC connections. Battery monitoring or PV capability must be installed as needed. Installation for these items begins with the DC shunts on page 26. o GSLC175-PV-120/240, GSLC175-PV-230, GSLC-PV-300VDC, and GSLC-PV-300VDC-230 are the “fully-loaded” versions for Radian models GS8048, GS8048A, and GS7048E. They have all options already present and need only external wiring and devices added. Users with these versions can [...] but can be customized in other ways.  Intended for Radian models GS8048 and GS8048A. The removable front cover allows for opening from either side of the enclosure. Introduction 8 900-0123-01-01 Rev A o GSLC175-230 – GS Load Center for AC applications (single-phase). Factory-prepared with dual 175 Adc inverter circuit breakers, dual AC inputs, and 230 Vac maintenance bypass assembly. Recommended for systems which have a single Radian inverter and an AC source, but can be customized in other [...] product is only serviceable by qualified personnel. Do not use this product without reading the appropriate Radian inverter/charger literature. Symbols Used WARNING: Hazard to Human Life This type of notation indicates that the hazard could be harmful to human life. CAUTION: Hazard to Equipment This type of notation indicates that the hazard may cause damage to the equipment. IMPORTANT: This type of notation indicates that the information provided is important to the installation, operation",
        "score": 0.78314424,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/warranty_and_safety/warranty_standard_english_spanish.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "precableados de fábrica en EE. UU. que incorporan los inversores anteriores • Sistemas de visualización y de reguladores serie MATE3s OutBack Power ofrece una garantía limitada de cinco (5) años contra defectos de materiales y fabricación y una garantía limitada de dos (2) años contra averías de ventiladores para los inversores/cargadores y reguladores de carga enumerados anteriormente. La duración de esta garantía comienza cuando se produzca el primero de los eventos siguientes: • La puesta en [...] inverter/chargers with model numbers ending in A or E • All GS series inverter/chargers with model numbers ending in A or E • FM60, FM80, and FM100 MPPT charge controllers • USA factory pre-wired FLEXpower systems incorporating the above inverters • MATE3s system display & controller products OutBack Power provides a five (5) year limited warranty against defects in materials and workmanship, and a two (2) year limited warranty against fan failure, for the inverter/chargers and charge [...] servicio/la primera activación del producto por parte de un instalador o usuario final • 6 meses después de que el producto se envíe desde fábrica Esta garantía es aplicable al comprador original del producto OutBack, y es transferible únicamente si el producto permanece instalado en el lugar de uso original. Se recomienda encarecidamente registrar el producto enviando la tarjeta de registro de la garantía o a través de www.outbackpower.com para agilizar las respuestas a toda posible",
        "score": 0.7608822,
        "bucket": "other"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/radian_gs_load_center/radian_gslc_datasheet.pdf",
        "title": "[PDF] Radian Series - Outback power",
        "snippet": "20.4 Recommended Charge Controller Model FLEXmax 60 and 80 FLEXmax 100 FLEXmax 60 and 80 FLEXmax 100 Recommended Radian Model GS8048A-01 GS4048A-01 GS7035E GS3548E GS8048A-01 GS4048A-01 GS8048A-01 GS8048A-01 GS4048A-01 GS4048A-01 230 Model Numbers GSLC175-230 GSLC175-PV-230 GSLC-PV-300VDC-230 GSLC175PV1-230 GSLCPV1-300VDC-230 Enclosure w/ Hinged Door u u u u u 175A Breakers 2 2 2 1 1 Dual AC Inputs u u u u u GFDI u u FLEXnet DC u u u u PV Disconnects 2 2 1 1 500A DC Shunt 1 3 3 2 2 Weight [...] Designed for use with the Radian Series inverter/charger family, the options offer solutions for group-up custom designs or factory pre-wired configurations for specific applications. The OutBack GS Load Centers simplify the configuration, distribution and implementation of energy storage of the Radian Series inverter/charger through a standardized approach. [...] provided inverter DC overcurrent protection and disconnects, dual AC inputs, grid-tied inverter connection and 120/240VAC or 230V maintenance bypass.",
        "score": 0.7334523,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/warranty_and_safety/warranty_standard_english.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "o The warranty period of any repaired or replacement product or component is the greater of ninety (90) days from date of shipment from us or the remainder of the initial warranty term. We reserve the right to request the Product be returned to us for analysis. [...] o If the Product fails within ninety (90) days from original purchase date, we will replace the Product. If the Product fails after ninety (90) days and within the Warranty Period, we will either repair and return the Product or ship a replacement product. We will determine whether the Product is to be repaired or replaced in accordance with the Product’s age and model. We may authorize advance shipment of a replacement based on product age and model. [...] of the original Product to us and is subject to additional terms and conditions that are provided by us if we offer the service to you. How do you obtain warranty service? When you discover a defect or nonconformity in the Product, you must promptly notify us and cooperate with us by making the Product available for assessment or repair. Subject to the terms and conditions of this Limited Warranty, you must do the following to obtain warranty service: o Contact your installer, dealer or",
        "score": 0.70580584,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/integrated_systems/flexpower_radian/flexpowerradian_specsheet.pdf",
        "title": "[PDF] FLEXpower Radian™",
        "snippet": "Radian GS8048A Power Factor Chart Power Factor 1.0 0.75 0.5 0.25 0.0 Industry-Standard Non-Industry Standard 0.85 Radian GS8048A Power Rating Chart Power (VA) 20000 15000 10000 5000 0 100ms 5 sec 30 min continuous Instantaneous Power Rating Most stringent, massive load start GS8048A: 16970VA Surge Power Rating Less stringent load start GS8048A: 12000VA Peak Power Rating Frequent “heavy duty” load requirements GS8048A: 9000VA Continuous Power Rating Sustained “real world” load requirements [...] GS8048A: 8000VA 16970VA 12000VA 9000VA 8000VA Typical Efficiency Rating Real world efficiency with variable loads GS8048A: 93% CEC Efficiency Rating Most stringent US rating GS8048A: 92.5% Radian GS8048A Efficiency Rating Chart Efficiency 100% 90% 80% 70% 60% 50% 40% 30% 20% 10% 0% 2kVA 4kVA 6kVA 8kVA 92.5% (CEC) 93% (Typical) INVERTING SELLING All pre-wired systems include a Radian Series inverter/charger, FLEXmax charge controller(s), MATE3s system display and communications, FLEXnet DC [...] Available in the Radian A Series 4kW or 8kW inverter/charger, both models incorporate OutBack Power’s GridZero technology, a superior level of intelligence in energy management for self-generation and self-consumption programs. It provides precise balancing between using stored energy, solar and utility power, blending-in the latter to overcome surges and load spikes. Both models support leading-edge battery technologies such as lithium-ion and others, and enhanced diagnostics for improved",
        "score": 0.67885995,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "outback-power",
    "product": "OutBack VFXR3048A",
    "candidates": [
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_a/FXR_A_specsheet.pdf",
        "title": "[PDF] FXR/VFXR A-Series - Outback power",
        "snippet": "FXR/VFXR A-Series Specifications Models: Sealed Vented FXR2012A FXR2524A FXR3048A VFXR2812A VFXR3524A VFXR3648A Instantaneous Power (100ms) 4800VA 6000VA 6000VA 4800VA 6000VA 6000VA Surge Power (5 sec) 4500VA 5400VA 5400VA 4500VA 5400VA 5400VA Peak Power (30 min) 2500VA 3200VA 3200VA 3200VA 4000VA 4000VA Continuous Power Rating (@ 25°C) 2000VA 2500VA 3000VA 2800VA 3500VA 3600VA Nominal DC Input Voltage 12VDC 24VDC 48VDC 12VDC 24VDC 48VDC AC Output Voltage (Selectable) 120VAC (100 to 130VAC) [...] 120VAC (100 to 130VAC) 120VAC (100 to 130VAC) 120VAC (100 to 130VAC) 120VAC (100 to 130VAC) 120VAC (100 to 130VAC) AC Output Frequency (Selectable) 60Hz (50Hz) 60Hz (50Hz) 60Hz (50Hz) 60Hz (50Hz) 60Hz (50Hz) 60Hz (50Hz) Continuous AC Output Current (@ 25°C) 16.7AAC 20.8AAC 25AAC 23.3AAC 29.2AAC 30AAC Idle Power Full: ≈34W Search: ≈9W Off: ≈3W Full: ≈34W Search: ≈9W Off: ≈3W Typical Efficiency 90% 92% 93% 90% 92% 93% CEC Weighted Efficiency Not applicable Not applicable 91% Not applicable 90.5% [...] 91% Total Harmonic Distortion Typical: <2% Maximum: <5% Typical: <2% Maximum: <5% Output Voltage Regulation ±2.5% ±2.5% ±2.5% ±2.5% ±2.5% ±2.5% AC Input Voltage Range (MATE3s Adjustable) 85 to 140VAC 85 to 140VAC 85 to 140VAC 85 to 140VAC 85 to 140VAC 85 to 140VAC AC Input Frequency Range 54 to 66Hz (45 to 55Hz) 54 to 66Hz (45 to 55Hz) 54 to 66Hz (45 to 55Hz) 54 to 66Hz (45 to 55Hz) 54 to 66Hz (45 to 55Hz) 54 to 66Hz (45 to 55Hz) Grid-Interactive Voltage Range — 106 to 132VAC 106 to 132VAC —",
        "score": 0.78944516,
        "bucket": "datasheets"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_e/FXR_E_specsheet.pdf",
        "title": "[PDF] FXR/VFXR E-Series - Outback power",
        "snippet": "Dimensions H × W × L (in/cm) Unit: 13 × 8.25 × 16.25 / 21.75 × 13 × 22 Shipping: 21.75 × 13 × 22 / 55 × 33 × 56 Unit: 13 × 8.25 × 16.25 / 21.75 × 13 × 22 Shipping: 21.75 × 13 × 22 / 55 × 33 × 56 Temperature Range Rated: –20 to 50°C Operating: –40 to 60°C Storage: –40 to 60°C Rated: –20 to 50°C Operating: –40 to 60°C Storage: –40 to 60°C Relative Humidity Rating 93% 93% 93% 93% 93% 93% Listings/Certifications IEC 62109, EN 61000-3, EN 61000-6 IEC 62109, EN 61000-3, EN 61000-6, AS4777.2/3 IEC [...] Output Voltage (selectable) 230VAC (200 to 260VAC) 230VAC (200 to 260VAC) 230VAC (200 to 260VAC) 230VAC (200 to 260VAC) 230VAC (200 to 260VAC) 230VAC (200 to 260VAC) AC Output Frequency (selectable) 50Hz (60Hz) 50Hz (60Hz) 50Hz (60Hz) 50Hz (60Hz) 50Hz (60Hz) 50Hz (60Hz) Continuous AC Output Current (@ 25°C) 8.7AAC 8.7AAC 10AAC 11.3AAC 13AAC 13AAC Idle Power Full: ~34W Search: ~9W Off: ~3W Full: ~34W Search: ~9W Off: ~3W Typical Efficiency 90% 92% 93% 90% 92% 93% Total Harmonic Distortion [...] Typical: <2% Maximum: <5% Typical: <2% Maximum: <5% Output Voltage Regulation ±2.5% ±2.5% ±2.5% ±2.5% ±2.5% ±2.5% AC Input Voltage Range (MATE3s Adjustable) 170 to 290VAC 170 to 290VAC 170 to 290VAC 170 to 290VAC 170 to 290VAC 170 to 290VAC AC Input Frequency Range 45 to 55Hz (54 to 66Hz) 45 to 55Hz (54 to 66Hz) 45 to 55Hz (54 to 66Hz) 45 to 55Hz (54 to 66Hz) 45 to 55Hz (54 to 66Hz) 45 to 55Hz (54 to 66Hz) Grid-Interactive Voltage Range — 208 to 252VAC 208 to 252VAC — 208 to 252VAC 208 to",
        "score": 0.7722049,
        "bucket": "datasheets"
      },
      {
        "url": "https://outbackpower.com/downloads/documents/integrated_systems/flexpower_two_fxr/flexpowertwofxr_datasheet.pdf",
        "title": "[PDF] FLEXpower TWO FXR™ - Outback power",
        "snippet": "Finished Dimensions H × W × D (in/cm) 20.25 × 46.5 × 13.0 / 51 × 118 × 33 20.25 × 46.5 × 13.0 / 51 × 118 × 33 Finished Weight (lb/kg) 256 / 116 256 / 116 Shipping Dimensions H × W × D (in/cm) 54 × 30 × 34 / 76.2 × 86.4 × 159.2 54 × 30 × 34 / 76.2 × 86.4 × 159.2 Shipping Weight (lb/kg) 360 / 163.3 354 / 160.6 Excludes charge controllers & MATE3s. [...] 240VAC Bypass FLEXmax 80 175A 80A Yes FP2-3048A-300AFCI Dual FXR3048A, 6.0kW FLEXpower TWO 300VDC AFCI FXR3048A (×2) — 240VAC Bypass FLEXmax 100 AFCI 250A 80A Yes FP2 FXR3048A-01 Dual FXR3048A, 6.0kW FLEXpower TWO FXR3048A (×2) — 240VAC Bypass FLEXmax 80 250A 80A Yes FP2 FXR2524A-01 Dual FXR2524A, 5.0kW FLEXpower TWO FXR2524A (×2) — 240VAC Bypass FLEXmax 80 175A 80A Yes For Europe Description Inverter(s) FW-X240 Bypass Charge Controller Inverter OCPD PV OCPD RTS FP2 VFXR3024E-300 Dual",
        "score": 0.6599319,
        "bucket": "datasheets"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/integrated_systems/flexpower_four_fxr/flexpowerfourfxr_specsheet.pdf",
        "title": "FLEXpower FOUR FXR™",
        "snippet": "2 FLEXpower FOUR FXR Specifications 01/2020 www.outbackpower.com #980-0040-01-00 REV B For North America Description Inverter(s) FW-X240 Bypass Charge Controller Inverter OCPD PV OCPD RTS FP4 FXR3048A-01 Quad FXR3048A, 12.0kW FLEXpower FOUR FXR3048A (4×) — 240VAC Bypass FLEXmax 80 (4×) 175A 80A Yes FP4 VFXR3648A-01 Quad VFXR3648A, 14.4kW FLEXpower FOUR VFXR3648A (4×) — 240VAC Bypass FLEXmax 80 (4×) 175A 80A Yes For Europe Description Inverter(s) FW-X240 Bypass Charge Controller Inverter OCPD PV [...] 1 OutBack’s pre-assembled and pre-wired FLEXpower systems are now equipped with the updated FXR Series inverter/chargers. [...] Copyright © 2020 OutBack Power. All Rights Reserved. OutBack Power is a registered trademark of Alpha Technologies Services, Inc.",
        "score": 0.5501488,
        "bucket": "datasheets"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_a/fxr_install.pdf",
        "title": "[PDF] FXR Series Inverter/Charger - FXR2012A FXR2524A FXR3048A ...",
        "snippet": "o The unit has four mounting holes, one in each corner. (See Figure 4.) Use fasteners in all corners.\no Due to the variance in other mounting methods, OutBack Power only endorses the use of FLEXware mounting products. Use M6 × 20 mm machine screws, one per corner, to attach the inverter to the mounting plate. Follow the instructions with each mounting system. [...] IMPORTANT: Use correct fasteners to secure the inverter to the mounting surface, regardless of the type of surface. OutBack Power cannot be responsible for damage to the product if it is attached with inadequate fasteners. 2 o Insulated screwdriver set (flat and Phillips) o Long-nose pliers o High-resolution voltmeter 18 900-0166-01-01 Rev B ©2017 EnerSys. All Rights Reserved. [...] output circuits are isolated from ground. The installer is responsible for system grounding according to all applicable codes.  For safety, the neutral and ground conductors should be mechanically bonded. OutBack Power does not bond these conductors within the inverter. Some codes require the bond to be made at the main panel only. Make sure that no more than one bond is present in the AC system at any time. WARNING: Shock Hazard For all installations, the negative battery conductor should be",
        "score": 0.81489426,
        "bucket": "installation"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_e/fxr_intl_install.pdf",
        "title": "[PDF] FXR International Series Inverter/Charger - Outback power",
        "snippet": "o The unit has four mounting holes, one in each corner. (See Figure 4.) Use fasteners in all corners.\no Due to the variance in other methods, OutBack Power only endorses the use of FLEXware mounting products. Use M6 × 20 mm machine screws, one per corner, to attach the inverter to the plate.\nFollow the instructions with each mounting system. [...] IMPORTANT: Use correct fasteners to secure the inverter to the mounting surface, regardless of the type of surface. OutBack Power cannot be responsible for damage to the product if it is attached with inadequate fasteners. 2 o Insulated screwdriver set (flat and Phillips) o Long-nose pliers o High-resolution voltmeter 18 900-0168-01-00 Rev D ©2015 EnerSys. All Rights Reserved. [...] o Mount the plate on a flat, solid mounting surface. Ensure the surface is strong enough to handle three times the total weight of all the components. If using a FLEXware Mounting Plate, avoid large air gaps behind the plate. These can result in louder mechanical noise during inverting or charging.\no Mount and secure each component before attaching any wiring.",
        "score": 0.80698997,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_a/fxr_qsg.pdf",
        "title": "[PDF] FXR™ and VFXR™ (A) Series Inverter/Charger - Outback power",
        "snippet": "o Due to the variance in other mounting methods, OutBack Power only endorses the use of FLEXware mounting products. Use M6 × 20 mm machine screws, one per corner, to attach the inverter to the mounting plate. Follow the instructions with each mounting system.\no Mount and secure each component before attaching any wiring.\no When the inverter is used with other metal chassis, make sure that all chassis are grounded. Use either metal-to-metal contact or separate ground wires as appropriate. [...] Contact Information Mailing Address: 3767 Alpha Way Bellingham, WA 98226 USA Web Site: www.outbackpower.com Date and Revision September 2022, Revision B 1 Installation Requirements o The FXR and VFXR inverter/chargers are intended for indoor installation only.\no Ensure the mounting surface is strong enough to handle 3 times the total weight of all the components.\no The inverter has four 0.313\" (8 mm) mounting holes ( ), one in each corner. Use fasteners in all corners. [...] If it becomes necessary to remove the Turbo Fan: 1. Remove the screws at the four corners of the Turbo Fan.\n2. Remove the compartment cover.\n3. Unscrew the AUX+ and AUX– terminal screws.\n4. Remove the wires.\n5. Remove the Turbo Fan.\nIMPORTANT: Use correct fasteners to secure the inverter to the mounting surface. OutBack cannot be responsible for damage to the product if it is attached with inadequate fasteners.",
        "score": 0.75290436,
        "bucket": "installation"
      },
      {
        "url": "https://old.outbackpower.com/downloads/documents/inverter_chargers/m_series/fx_mobile_install.pdf",
        "title": "[PDF] FX Inverter/Charger - Outback power",
        "snippet": "product if it is attached with inadequate fasteners. o Due to the variance in other mounting methods, OutBack only endorses the use of FLEXware mounting products or previous versions of OutBack mounting plates. Use M6 × 20 mm machine screws, one per corner, to attach the inverter to the mounting plate. Follow the instructions with each mounting system. o Mount and secure each component before attaching any wiring. o When the inverter is used with other metal chassis, make sure that all chassis [...] Assorted insulated screwdrivers o Digital voltmeter (DVM) or standard voltmeter Installation 14 900-0197-01-00 Rev B Mounting o One person can install the FX inverter, but installation may be easier with two people. o The unit has four mounting holes, one in each corner. Use fasteners in all corners to ensure a secure installation. IMPORTANT: Use correct fasteners to secure the inverter to the mounting surface, regardless of the type of surface. OutBack cannot be responsible for damage to the [...] are grounded appropriately. (See the grounding instructions on page 15.) Grounding other chassis may involve metal-to-metal contact, or separate ground wires. If using an OutBack FLEXware Mounting Plate, avoid large air gaps behind the plate. These can result in louder mechanical noise during heavy inverting or charging. Mount the plate on a flat, solid mounting surface. Dimensions Figure 4 Dimensions Height with Turbo 13″ (33 cm) Width 8.25″ (21 cm) Length 16.25″ (41 cm) Height without Turbo",
        "score": 0.7343678,
        "bucket": "installation"
      },
      {
        "url": "https://outbackpower.com/downloads/warranty_and_safety/warranty_standard_english_spanish.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "precableados de fábrica en EE. UU. que incorporan los inversores anteriores • Sistemas de visualización y de reguladores serie MATE3s OutBack Power ofrece una garantía limitada de cinco (5) años contra defectos de materiales y fabricación y una garantía limitada de dos (2) años contra averías de ventiladores para los inversores/cargadores y reguladores de carga enumerados anteriormente. La duración de esta garantía comienza cuando se produzca el primero de los eventos siguientes: • La puesta en [...] servicio/la primera activación del producto por parte de un instalador o usuario final • 6 meses después de que el producto se envíe desde fábrica Esta garantía es aplicable al comprador original del producto OutBack, y es transferible únicamente si el producto permanece instalado en el lugar de uso original. Se recomienda encarecidamente registrar el producto enviando la tarjeta de registro de la garantía o a través de www.outbackpower.com para agilizar las respuestas a toda posible [...] al cliente a pagar hasta 180,00 dólares estadounidenses por la mano de obra y la manipulación. Fuera de garantía Si un producto está fuera de garantía, OutBack podrá repararlo y sustituirlo si el cliente asume los costes. De forma alternativa, si fuese aplicable y bajo petición, OutBack puede enviar por adelantado piezas de repuesto. Este servicio tiene un coste. Limited Warranty This warranty statement applies to the following OutBack Power products: • All Vented and Sealed (V)FXR series",
        "score": 0.7771143,
        "bucket": "other"
      },
      {
        "url": "https://old.outbackpower.com/downloads/warranty_and_safety/warranty_standard_english.pdf",
        "title": "[PDF] Limited Warranty - Outback power",
        "snippet": "o The warranty period of any repaired or replacement product or component is the greater of ninety (90) days from date of shipment from us or the remainder of the initial warranty term. We reserve the right to request the Product be returned to us for analysis. [...] 900-0216-01-00 FXR/VFXR™ Inverter/Charger, GS (A and E) Inverter/Charger, FLEXmax™ Charge Controller, FLEXpower System, and MATE3s™ Series System Display Limited Warranty REVISION: E DATE: MAY 2023 Limited Warranty EnerSys, Alpha Technologies Services, Inc., its affiliates, and subsidiaries (“we” or “us” or “our”) warrant that during the applicable warranty period the following products (each, the “Product”) will be free from defects in materials and conform to the published or designated [...] Warranty does not cover damage or defects to the Product caused by: • failure to follow any of the Product instructions or to perform preventive maintenance on the Product; • transportation, storage, installation, reinstallation, removal, improper use, alterations, modifications or disassembly; • improper repair or service, normal wear and tear, loose wires, natural forces, vandalism, freezing, lightning, fire, floods, or acts of God; • failure to properly set the charge/discharge current",
        "score": 0.7031221,
        "bucket": "other"
      },
      {
        "url": "https://www.outbackpower.com/downloads/documents/inverter_chargers/fxr_vfxr_a/fxr_operator.pdf",
        "title": "[PDF] FXR Series Inverter/Charger - Outback power",
        "snippet": "............................................................................................................................... 60 Specifications .................................................................................... 61 Electrical Specifications .......................................................................................................... 61 Mechanical Specifications ....................................................................................................... [...] authorized agents. 8 900-0167-01-01 Rev B ©2017 EnerSys. All Rights Reserved. [...] 900-0167-01-01 Rev B 5 Table of Contents List of Tables Table 1 FXR/HUB Compatibility with Other OutBack Products ............................................ 10 Table 2 System Display Compatibility ................................................................................... 11 Table 3 Battery Indicator Values ........................................................................................... 13 Table 4 Summary of Input Modes",
        "score": 0.5815176,
        "bucket": "other"
      }
    ]
  },
  {
    "manufacturer": "panasonic",
    "product": "EVERVOLT HIT Black VBHN325SA16",
    "candidates": []
  },
  {
    "manufacturer": "panasonic",
    "product": "EVERVOLT HIT VBHN330SA17",
    "candidates": []
  },
  {
    "manufacturer": "panasonic",
    "product": "EVERVOLT HIT+ VBHN340SA17",
    "candidates": []
  },
  {
    "manufacturer": "panasonic",
    "product": "HIT H350",
    "candidates": [
      {
        "url": "https://help.na.panasonic.com/wp-content/uploads/2023/02/SCHTB350_HTB351_RQT9670_2P_ENG.pdf",
        "title": "[PDF] Owner's Manual Home Theater Audio System - Panasonic",
        "snippet": "to 25 kHz (j10 dB) Active subwoofer 1 way, 1 speaker system (Bass reflex type) Woofer 16 cm (6 1/2q) cone typek1 Frequency range 30 Hz to 180 Hz (j16 dB) 35 Hz to 160 Hz (j10 dB) GENERAL Power consumption Main unit: 25 W Active subwoofer: 21 W In standby condition Main unit: Approx. 0.1 W Active subwoofer: Approx. 0.1 W Power supply AC 120 V, 60 Hz Dimensions (WkHkD) Main unit Cabinet dimension 310 mmk44 mmk195 mm (12 7/32qk1 23/32qk7 11/16q) Maximum outer dimension 310 mmk45 mmk202 mm (12 [...] SPEAKER GENERAL Horizontal placement using the stands Dimensions (WkHkD) 956 mmk102 mmk74 mm (37 5/8qk4 1/32qk2 29/32q) Mass (Weight) 1.61 kg (3.7 lbs) Horizontal placement using the speaker feet and the support legs Dimensions (WkHkD) 956 mmk78 mmk55 mm (37 5/8qk3 1/16qk2 5/32q) Mass (Weight) 1.57 kg (3.5 lbs) Horizontal placement (for wall mount) Dimensions (WkHkD) 956 mmk75 mmk35 mm (37 5/8qk2 15/16qk1 3/8q) Mass (Weight) 1.54 kg (3.5 lbs) Vertical placement using the speaker bases [...] 7/32qk1 25/32qk7 15/16q) Active subwoofer 180 mmk408 mmk306 mm (7 3/32qk16 1/16qk12 1/16q) Mass (Weight) Main unit 1.1 kg (2.4 lbs) Active subwoofer 5.2 kg (11.47 lbs) Operating temperature range 0 oC to _40 oC (_32 oF to _104 oF) Operating humidity range 20 % to 80 % RH (no condensation) 30 RQT9670 1 Specifications are subject to change without notice.",
        "score": 0.71995544,
        "bucket": "datasheets"
      }
    ]
  },
  {
    "manufacturer": "panasonic",
    "product": "HIT N340 Black",
    "candidates": []
  }
]